{
  "title": "Navigator Powers",
  "info": "# Navigator Powers\n\n## Using Navigator Powers\n\nUnlike psychic powers, Navigators do not need to summon the energies of the warp or use arcane psychic foci to activate their powers. Rather, their powers are a result of their innate connection to the warp and the legacy of their genes. Because of these factors, a Navigator character does not make a focus test to try and gather warp energy as a Psyker would or have a Psy Rating. Instead, whenever she chooses to use one of her powers, she must pass a characteristic test for it to be successful.\n\nEach power's description indicates which characteristic must be tested, plus any modifiers and additional effects for degrees of success the Navigator gains. The most common characteristics used by a Navigator in this way are Willpower and Perception.\n\nIn addition to any modifiers detailed in the power's description, a Navigator gains a bonus to the test based on her level of mastery with the power:\n* +0 Novice\n* +10 Adept\n* +20 Master\n\nUnless otherwise noted, using a Navigator Power is a Half Action. In starship combat, unless otherwise noted, a Navigator may use one Navigator Power per Strategic Turn (at the GM's discretion, the Navigator may use more than one power if the powers do not effect the starship combat).\n\nNote that Navigators never need to roll for Psychic Phenomena or Perils of the Warp, and cannot risk triggering these effects with the use of their powers. Likewise, any items, creatures, or psychic effects that would either cause or increase the chance of a Psyker triggering Perils of the Warp will not affect them when they use their abilities.",
  "component": "NavigatorPowers",
  "data": [
    {
      "name": "A Cloud in the Warp",
      "id": "a_cloud_in_the_warp",
      "novice": "By making a Willpower test, the Navigator becomes shrouded in an immaterial cloak, forcing those that use any kind of psychic sight, detection or divination to make a Challenging (+0) Perception Test to see her with such powers. This power also has the same effect on the perception of all Daemons and warp entities. This power will last as long as the Navigator maintains it, however whilst she does so, she cannot use any other powers (though she may take other actions normally)",
      "adept": "As Novice, except the test to detect the Navigator becomes Difficult (-10).",
      "master": "As Adept, except the power gains a radius equal to the Navigator's Willpower Bonus in metres centred on her person. Any creature within the radius may be shrouded at the choice of the Navigator."
    },
    {
      "name": "Foreshadowing",
      "id": "foreshadowing",
      "novice": "With a successful Perception Test, the Navigator draws three secrets from the future. She may then “spend” a secret on her following turn to gain a +10 bonus on any Test. Using one secret in this way carries no danger. However, she may choose to spend either of her other two secrets to add an additional +10 bonus to the roll for each secret spent (for a total bonus of +20 for 2 secrets used, and +30 for three secrets used). For each additional secret used beyond the first, the Navigator must roll a d10; if this roll comes up 7, 8, 9, or 10, then the secret causes the Navigator to suffer a -10 penalty instead of granting a bonus. Secrets not used in the following round are lost as time marches on. Using this power more than once in the same hour is dangerous, as no one should know too much about her own future. For every use after the first in a single hour, the Navigator suffers 1d5 Insanity Points.",
      "adept": "As Novice, except secrets will only deduct rather than add on a roll of 9 or 10.",
      "master": "As Adept except secrets can be used up to five rounds after the power is used."
    },
    {
      "name": "Gaze into the Abyss",
      "id": "gaze_into_the_abyss",
      "novice": "With a successful Perception Test, the Navigator can determine if a creature or object holds the taint of the warp. This will tell the Navigator if the person or object has a Psy Rating or is tainted (roughly speaking if they have more than 20 Corruption Points, warp mutations, are possessed, etc.). Psykers who have made dark pacts with the warp and daemons are more resistant to this power, however. These creatures may make a Willpower Test opposed by the Navigator's Perception, which if successful will hide their true natures. This power can also be used to track powerful psychic or warp creatures using the rules for Tracking.",
      "adept": "As Novice, with the additional effect that the Navigator can detect major disturbances in the warp, such as warp portals and ships entering and exiting the Immaterium within a radius of 100 kilometres times her Perception Bonus. In Starship Combat, this power functions within a number of VUs equal to the Navigator's Perception Bonus.",
      "master": "As Adept but the Navigator can also use the power to detect the use of psychic powers within a radius of 10 metres per point of her Perception Bonus."
    },
    {
      "name": "Held in my Gaze",
      "id": "held_in_my_gaze",
      "novice": "The Navigator chooses a target which she has line of sight to and is no further away than 5 metres per point of her Perception Bonus. She then makes an Opposed Willpower test with the target. If she is successful, then the target is locked and will remain so as long as the Navigator does not use any other powers. A locked target must beat the Navigator in an Opposed Willpower test each time it wishes to use a psychic power or invoke the Daemonic Presence Trait. If the target moves out of range or line of sight, the power ends. Daemons affected by this power suffer 1 point of additional Damage for Warp Instability.",
      "adept": "As Novice, however the range increases to the 20 metres per point of the Navigator's Perception Bonus and daemons affected by this power suffer 2d10 points of damage instead of 1 point when suffering Warp Instability.",
      "master": "As Adept, with the addition that the Navigator no longer needs to have line of sight to the target and daemons suffering any damage from Warp Instability are immediately destroyed and cast back into the warp."
    },
    {
      "name": "The Course Untravelled",
      "id": "the_course_untravelled",
      "novice": "If the Navigator succeeds at a Difficult (-10) Willpower Test, she may move to any point within a distance equal to her Perception Characteristic in metres, so long as she could have walked, climbed, or swam there normally without impediment. If she fails this test, she is Stunned for 1 round and fails to change position. If she fails this test by three degrees or more, she is Stunned for 1d10 rounds and gains an Insanity Point. Whether or not this power is successful, the Navigator suffers a level of Fatigue at the end of the Round thanks to the strain on her body.",
      "adept": "As Novice, except the test is only Challenging (+0) and the range is increased to double the Navigator's Perception Characteristic in metres.",
      "master": "As Adept, except she may now perform this power as a Free Action or as a Reaction."
    },
    {
      "name": "The Lidless Stare",
      "id": "the_lidless_stare",
      "novice": "As a Full Action, the Navigator makes an Opposed Willpower Test with anyone looking into her Warp Eye. Make a single test for the Navigator and compare it to the results of each of her opponents. If the Navigator achieves more degrees of success, the opponent suffers 1d10 + the Navigator's Willpower bonus in Energy damage. This damage is not reduced by armour or Toughness Bonus. Anyone taking damage from this power is also Stunned for 1 round as they are ripped with agony. Using this power is taxing and inflicts a level of Fatigue on the Navigator. If the Navigator fails this Test by one degree of failure or more, she suffers two levels of Fatigue. The Lidless Stare will affect anyone, friend or foe, that looks into the Navigator's third eye when this power is activated. This has an effective range of 15m (reduced to 5m in fog or mist) and has no effect on unliving targets, Untouchables, and daemons or other entities from the Warp. Those forewarned can look away, though even then being within line of sight of a Navigator is dangerous. The power of her eye is persuasive, and looking away only grants them +30 on their rolls to resist its power. Those who are unaware of the Navigator's presence gain this bonus as well.",
      "adept": "As Novice, however, the damage is increased to 2d10 + (the Navigator's WP bonus) and the time the victims are Stunned increases to 1d5 rounds. Victims also suffer 1d5 Insanity Points.",
      "master": "As Adept, with the additional effect that any creature possessing an Intelligence of 20+ suffering damage from this power must make an immediate Difficult (-10) Toughness Test or be slain. If they pass, they suffer 1d10 Insanity points rather than 1d5."
    },
    {
      "name": "Tides of Time and Space",
      "id": "tides_of_time_and_space",
      "novice": "Each round the Navigator wishes to use this power she must make a Perception test as a Free Action to read the strands of time. On a success, she doubles her Agility Bonus for the purposes of determining initiative and may take an additional Half Action that turn. The additional Action may not have the Concentration subtype. On a failure, she halves her Agility Bonus for initiative and may only take a Half Action that turn as she loses her grip on reality, becoming confounded and disorientated. Should she fail by three degrees or more, she winks out of existence for 1d5 rounds, reappearing where she was at the end of this duration. Should something else occupy that space when the Navigator returns, she shifts her position as much as necessary to a point of the player's choice should something else occupy that space. Whether or not this power is successful, however, the Navigator suffers a level of Fatigue at the end of the Round each time it is used. This power does not give the Navigator an additional Reaction.",
      "adept": "As Novice, except she triples her Agility Bonus for the purposes of determining Initiative.",
      "master": "As Adept, however, she quadruples her Agility Bonus for Initiative. In addition, she may take two extra Half Actions or a Full Action in addition to her other actions this round (rather than a single Half Action as results from the Novice manifestation of this power)."
    },
    {
      "name": "Tracks in the Stars",
      "id": "tracks_in_the_stars",
      "novice": "Using Perception, the Navigator can track the warp trail of a ship through real space in the same way as if she was using the Tracking use of the Survival skill. To track a warp trail, it can be no older than the Navigator's Perception Bonus in weeks, although the size and power of the vessel involved may mitigate this.",
      "adept": "As Novice, however, the warp trail may be up to a number of months old equal to the Navigator's Perception Bonus. She may also track ships in the warp in the same manner.",
      "master": "As Adept, except she can follow a warp trail equal to the Navigator's Perception bonus in years old, although this information may be erratic and fragmentary."
    },
    {
      "name": "Void Watcher",
      "id": "void_watcher",
      "novice": "The Navigator can make a Perception test (modified by range and size of potential objects as the GM thinks appropriate) to detect objects in space up to a distance equal to the Navigator's Perception Bonus in Void Units. If the power is not being used during space combat, the distance equals 1,000 kilometres times the Navigator's Perception Bonus. Information gained about such objects is only what the Navigator could discover through normal observation.",
      "adept": "As Novice, however, range is increased to a distance equal to double the Navigator's Perception Bonus in Void Units, or 10,000 km times the Navigator's Perception Bonus if the power is not being used during space combat. She may make a Difficult (-10) Willpower Test to gain some information about the nature of the object (i.e., what minerals are in an asteroid, what kind of crew a starship has).",
      "master": "As Adept, except range becomes equal to five times the Navigator's Perception Bonus in Void Units, or 100,000 km times the Navigator's Perception Bonus if the power is not being used during space combat. The test to gain additional information becomes Ordinary (+10)."
    }
  ]
}
