{
  "title": "Starship Combat Actions",
  "info": "# Starship Combat Actions",
  "component": "StarshipActions",
  "data": {
    "extended": [
      {
        "action": "Active Augury",
        "test": "Challenging (+0) Scrutiny + Detection",
        "benefit": "If the scan is successful, the GM should reveal basic (and important) information about celestial bodies, phenomena, and ships within 20 VUs of the vessel. If there is a vessel on Silent Running within scan range, it is immediately detected. For every degree of success, the character can extend the range of his scan by five VUs."
      },
      {
        "action": "Aid the Machine Spirit",
        "test": "Challenging (+0) Tech-Use",
        "benefit": "On a success, the character may add +5 to the ship's Manoeuvrability or Detection for the remainder of the turn. For every two additional degrees of success, the character may add an additional +5 to the same system."
      },
      {
        "action": "Disinformation",
        "test": "Difficult (-10) Deceive",
        "benefit": "If he succeeds, he can increase the crew's Morale by 1d5 for every degree of success for the duration of the combat."
      },
      {
        "action": "Emergency Repairs",
        "test": "Difficult (-10) Essential Repair Skill",
        "benefit": "If he succeeds, he repairs one unpowered, damaged, or depressurized Component. Repairs normally take 1d5 turns, however, this can be reduced by one turn per degree of success, to a minimum of one turn. Emergency Repairs cannot fix destroyed Components."
      },
      {
        "action": "Flank Speed",
        "test": "Challenging (+0) Tech-Use",
        "benefit": "Success means the ship may move an additional VU this turn. Every degree of success allows an additional VU of movement. Failure by 2 or more degrees means the ship immediately suffers an Engines Crippled critical hit as the engines are strained too hard."
      },
      {
        "action": "Focused Augury",
        "test": "Challenging (+0) Scrutiny + Detection",
        "benefit": "Scan a particular ship within 20 VUs of his vessel. A successful scan reveals a number of Components aboard the enemy ship.\n* Basic Success: All Essential Components except Auger Arrays and Void Shields\n* One Degree of Success: All Weapon Components\n* Two Degrees of Success: Auger Arrays, Void Shields, and any combat related Components\n* Three Degrees of Success: All Components aboard the target ship"
      },
      {
        "action": "Hail the Enemy",
        "test": "Interaction Skill",
        "benefit": "This action is unique as it can be performed by characters who have participated in Manoeuvre Actions or Shooting Actions during the turn. The character contacts one enemy ship using his ship's vox systems. He may use Interaction Skills to accomplish certain goals, such as the Intimidation Skill to convince an opponent to surrender. The exact details of how this works is left up to the GM"
      },
      {
        "action": "Hit and Run",
        "test": "Challenging (+0) Operate (Aeronautica) & Ordinary (+10) Command",
        "benefit": "The character makes a Challenging (+0) Operate (Aeronautica) Test, attempting to reach one enemy ship within 5 VUs in a boarding craft, accompanied by a team of raiders. This test can be further modified by the target vessel's Turret Rating. If he fails the test, he is forced to return to his ship. If he fails by four or more degrees, his craft is shot down. The character either survives stranded in a crippled craft or is killed at the GM's discretion. If he succeeds, he must make an opposed Ordinary (+10) Command Test against the commander of troops aboard the enemy ship. If he succeeds, roll 1d5 on the Critical Hit chart twice and select one result to apply to the enemy ship, plus 1 point of damage to Hull Integrity for every degree of success. If he fails, his force is forced to retreat back to his boarding craft, unsuccessful in causing mayhem."
      },
      {
        "action": "Hold Fast!",
        "test": "Challenging (+0) Willpower",
        "benefit": "The character must have Air of Authority (or a similar Talent at the GM's discretion) and make a Challenging (+0) Willpower Test. If he succeeds, he inspires the crew and reduces any damage to Morale by 1, plus 1 for every degree of success to a minimum of 1. Hold Fast! may only cancel out Morale damage suffered during the previous turn."
      },
      {
        "action": "Jam Communications",
        "test": "Difficult (-10) Tech-Use",
        "benefit": "The Character makes a Difficult (-10) Tech-Use Test, targeting a ship within 10 VUs of his vessel. If he succeeds, that ship is unable to use vox-transmitters or other technologies to communicate with other ships. Psychic communicators — such as an Astropath — are unaffected. For every degree of success, the range of Jam Communications is extended by one VU."
      },
      {
        "action": "Launch Assault Boats",
        "test": "Challenging (+0) Command+Craft Rating",
        "benefit": "The assault boat squadrons may be grouped up into one or more wings consisting of two or more squadrons, or may operate as independent squadrons, in any combination, as desired. Upon launch and again at the beginning of their parent vessel's subsequent Strategic Turns, the assault boat wings may move freely a number of VUs up to the speed of the slowest squadron in the unit. They may continue to remain away from their carrier in this manner for no more than four turns, as fuel and life support supplies begin to run low and the assault boats are forced to return to their carrier. Upon moving within 1VU of an enemy vessel, the assault boats may commence an attack run, closing quickly upon their target to deliver their payload before retreating back to the carrier.\n\nMake a Challenging (+0) Command+Craft Rating Test (this will either be from a character aboard the carrier, or from a character leading the assault boats personally), gaining a +5 bonus for every squadron of friendly bombers after the first. A successful test means that a single assault boat squadron has reached the ship and breached the hull, with an additional assault boat landing for every degree of success, up to a maximum equal to the number of assault boat squadrons attacking that survived any defensive fire. The character leading the boarding parties (if an Explorer is piloting an assault boat, he may not also lead the boarding parties) then begins a Hit and Run Action against the target, ignoring the Operate (Aeronautica) Test and gaining a +10 for every assault boat squadron that successfully landed.\n\n**After delivering their payload, the assault boats withdraw to their carrier with any survivors by the shortest expedient route.**"
      },
      {
        "action": "Launch Bombers",
        "test": "Challenging (+0) Command+Craft Rating",
        "benefit": "The bomber squadrons may be grouped up into one or more wings consisting of two or more squadrons, or may operate as independent squadrons, in any combination, as desired. Upon launch and again at the beginning of their parent vessel's subsequent Strategic Turns, the bomber wings may move freely a number of VUs up to the speed of the slowest squadron in the unit. They may continue to operate away from their carrier for no more than six Strategic Turns (four if the wings include fighters), as fuel and life support supplies begin to run low and the bombers are forced to return to their carrier. Upon moving within 1VU of an enemy vessel, the bombers may commence an attack run, closing quickly upon their target to deliver their payload before retreating back to the carrier...\n\nMake a Challenging (+0) Command+Craft Rating Test (this will either be from a character aboard the carrier, or from a character leading the bombers personally), gaining a +5 bonus for every squadron of friendly bombers after the first. A successful test causes a single hit upon the enemy vessel, with an additional hit for every degree of success. This is up to a maximum of three hits, plus one additional maximum hit for every additional bomber squadron after the first. If the bombing run scores at least four degrees of success, the target also suffers a Critical Hit. Roll 1d5 on the Critical Hit chart and apply the result.\n\nEach hit deals 1d10+4 damage. Add together the damage rolled from each hit, and then subtract from that the armour value of the target ship. Bomber attacks ignore void shields. If, for any reason, the target ship has multiple armour values (such as from the Armoured Prow Component), then the lowest armour value is always used. The final total is the number of points of Hull Integrity the target ship loses. \n\n**After delivering their payload, the bombers withdraw to their carrier to refuel and rearm.**"
      },
      {
        "action": "Launch Combat Void Patrol",
        "test": "Challenging (+0) Command+Craft Rating",
        "benefit": "Any number of fighter squadrons currently ready within a ship's launch bays may commence a CVP operation. A CVP operation may be assigned to the fighters' own carrier or any friendly vessel within a distance equal to the speed of the slowest squadron in the patrol of the carrier, which must remain within that distance while the patrol continues. A patrol can remain in effect indefinitely, as squadrons return to their carrier to resupply periodically as a normal part of the operation. While the CVP remains in effect, any enemy attack craft or torpedoes that move within 5VUs of the patrolled ship are immediately attacked by half of the squadrons performing the patrol (rounding up). The remaining squadrons are either rearming at the time, or are elsewhere on the patrol route. Unlike intercept operations, attacking does not force squadrons to return to their carrier to rearm; such activities are a normal part of CVP operations, and thus the patrol continues even after it has attempted to repel an attack. Spent fighters return to the carrier, rearm, and re-launch on a continuous basis. "
      },
      {
        "action": "Launch Escorts",
        "test": "None/Challenging (+0) Command+Craft Rating",
        "benefit": "Take this action as part of a Launch Assault Boats or Launch Bombers action, protecting them from enemy fighters and harassing defensive turrets to allow their larger brethren to deliver their payloads. Fighter escorts move at the same speed as the attack craft they escort. Should the bombers/assault boats be attacked by enemy fighters, then the escorting fighters may attack the enemy fighters. The enemy fighters must engage the escort fighters (see “Attacking with Fighters”) Against defensive turrets, each squadron of escorting fighters impose a -10 penalty on the turrets' Ballistic Skill Test, and will be shot down before any of the escorted bombers/assault boats."
      },
      {
        "action": "Launch Interceptors",
        "test": "None/Challenging (+0) Command+Craft Rating",
        "benefit": "The fighter squadrons may be grouped up into one or more wings consisting of two or more squadrons, or may operate as independent squadrons, in any combination, as desired. Upon launch and again at the beginning of their parent vessel's subsequent Strategic Turns, the fighter wings may move freely a number of VUs up to the speed of the slowest squadron in the unit. They may continue to remain away from their carrier in this manner for no more than four Strategic Turns, as fuel and life support supplies begin to run low and the fighters are forced to return to their carrier. Squadrons on intercept operations may attack any enemy torpedoes or attack craft within 1VU of their position (whether they enter this range during their movement or enemies enter range during their own turns) (see “Attacking with Fighters”). "
      },
      {
        "action": "Lock on Target",
        "test": "Challenging (+0) Scrutiny + Detection",
        "benefit": "If successful, he adds a +5 bonus to the Ballistic Skill Test to fire one Weapon Component during this turn. Every two additional degrees of success adds an additional +5 to the same Test."
      },
      {
        "action": "Prepare to Repel Boarders!",
        "test": "Challenging (+0) Command",
        "benefit": "If he succeeds, he may add +10 to any opposed Command Test he performs against enemy borders during subsequent turns of combat, plus an additional +5 for every degree of success. Although the character is not required to make additional tests on subsequent turns, he will be occupied rallying the defenders for as long as he wants to maintain the bonus."
      },
      {
        "action": "Put Your Backs Into It!",
        "test": "Challenging (+0) Intimidate or Charm",
        "benefit": "If he succeeds, he can choose to add +5 to a Ballistic Skill Test to fire a Weapon Component, an Emergency Repairs Action, or an attempt to put out a fire made during this turn. He may aid an additional Ballistic Skill Test, Emergency Repairs Action, or firefighting attempt for every three degrees of success."
      },
      {
        "action": "Rapid Reload",
        "test": "Difficult (-10) Command or Tech Use Test.",
        "benefit": "This Action requires the Starship to have at least one Torpedo weapon component. If passed, all empty launch tubes on the vehicle are loaded successfully, and may be fired during the same Strategic Turn, rather than a subsequent turn."
      },
      {
        "action": "Triage",
        "test": "Difficult (-10) Medicae",
        "benefit": "If he succeeds, he reduces any damage to Crew Population by 1, plus 1 for every degree of success to a minimum of 1. Triage may only cancel Crew Population damage suffered during the previous Turn."
      }
    ],
    "manouevre": [
      {
        "action": "Standard Manoeuvre",
        "test": "None",
        "benefit": "When a starship takes its Manoeuvre Action, it chooses to move directly forward a number of VUs equal to its Speed value or half its Speed value. This is the default action of a starship — since starships are huge vessels with immense momentum, players do not have the option of simply not moving their ship. Once the starship has moved forward by its Speed value or half its Speed value, it may turn. Transports, raiders, frigates, and other ships of equivalent size (i.e., Hull Integrity and Available Space) can turn up to 90 degrees to the left or right (or port and starboard). Unless otherwise stated, all other ships may turn up to 45 degrees instead."
      },
      {
        "action": "Adjust Bearing",
        "test": "Challenging (+0) Operate (Voidship)+ Manoeuvrability",
        "benefit": "On a success, the starship may turn after moving one VU less than its Speed value. For every degree of success, it may turn after moving one less VU. A starship must move at least one VU before turning. Once the starship has turned, it must move the remaining distance so its complete movement is equal to its half or full Speed value."
      },
      {
        "action": "Adjust Speed",
        "test": "Challenging (+0) Operate (Voidship)+ Manoeuvrability",
        "benefit": "First, the ship decides if it is moving half its Speed value or its full Speed value. Then, the helmsman makes the test. On a success, he may increase or decrease the number of VUs his ship moves by one. For every degree of success, he may increase or decrease that number by an additional one. The starship may not move less than 0 VUs forward (the starship may come to a stop using its retro-thrusters, but cannot move in reverse). The starship may not move double or more its Speed value using this Manoeuvre (only Flank Speed allows that)."
      },
      {
        "action": "Adjust Speed & Bearing",
        "test": "Hard (-20) Operate (Voidship)+Manoeuvrability",
        "benefit": "First, the ship decides if it is moving half its Speed value or its full Speed value. Then, the helmsman makes the test. On a success, he may increase or decrease the number of VUs his ship moves by 1, and may turn after moving one VU less than its Speed Value (as above). Likewise, every degree of success awards the benefits of Adjust Speed and Adjust Bearing. However, the limitations of both Manoeuvre Actions apply."
      },
      {
        "action": "Come to New Heading",
        "test": "Difficult (-10) Operate (Voidship)+Manoeuvrability",
        "benefit": "Success means the starship may turn when it has moved half its Speed value, then turn again when it has moved its full Speed value. The ship suffers -20 to any Ballistic Skill Tests to fire its weapons during this turn."
      },
      {
        "action": "Disengage",
        "test": "Challenging (+0) Operate (Voidship)+ Manoeuvrability Opposed by Challenging (+0) Detection+Scrutiny",
        "benefit": "This Manoeuvre may not be performed if the starship is within 8 VUs of any enemy. The helmsman makes the test against an opposed by all opponents within 20 VUs. Provided their number of successes is greater than the successes of each enemy ship, the ship leaves combat, and may not renter it. Whether it succeeds or fails, the ship may not fire any weapons this turn. Once a starship has successfully disengaged from combat, it may not reengage its opponents unless the GM specifically allows otherwise. Additionally, the Disengage Manoeuvre cannot be used to initiate a Stern Chase. This is because the disengaging ship is shutting down all non-essential systems, including its engines, scanners, and weapons, and doing its best to pretend it isn't there. It will remain that way for several hours or even days, before restarting its systems (hoping that everyone else has already left the area)."
      },
      {
        "action": "Evasive Manoeuvres",
        "test": "Difficult (-10) Operate (Voidship)+Manoeuvrability",
        "benefit": "Success (and every subsequent degree of success) imposes a -10 penalty to all shooting directed against the starship until the beginning of its next Turn. The starship suffers the same penalty to its own shooting during this time."
      }
    ],
    "shooting": [
      {
        "action": "Fire Weapons",
        "test": "Challenging (+0) Ballistic Skill",
        "benefit": "Each Weapon Component may be fired once per Strategic Turn, and all Weapon Components must be fired at once, although they may be fired at different targets. A Weapon Component may only be fired at a target within its firing arc. The range of the shot can affect its accuracy. When firing at a target further away than the range of the weapon (up to the maximum of twice the range), the shot suffers a -10 penalty to the Ballistic Skill Test. However, when firing at a target at half the range, the shot gains a +10 bonus to the Ballistic Skill Test. If the number of successes equals or exceeds the weapon's Crit Rating, the shot has caused a Critical Hit. If the shot does not do any damage to Hull Integrity, inflict 1 automatic point of damage. Then roll 1d5 on the Critical Hit chart and apply the result to the target."
      },
      {
        "action": "Ram Them!",
        "test": "Hard (-20) Operate (Voidship) + Manoeuvrability Test",
        "benefit": "If a starship ends its Manoeuvre Action within one VU of an enemy vessel and its bow is facing said vessel, the starship may give up its Shooting Action this turn and ram the ship instead. The helmsman must make a Hard (-20) Operate (Voidship) + Manoeuvrability Test. If he succeeds, the ship crashes into its target, doing damage based on its hull size - 1d5 for transports and raiders, 1d10 for frigates, 2d5 for light cruisers, and 2d10 for cruisers. The ship adds the die roll to its prow armour value for total damage inflicted. This damage ignores void shields. The ramming ship then takes damage equal to the defending ship's Armour plus 1d5 to their prow armour, also ignoring void shields."
      },
      {
        "action": "Boarding Action",
        "test": "Hard (-20) Operate (Voidship) + Manoeuvrability Test",
        "benefit": "If a starship ends its Manoeuvre Action within 1 VU of its target, it may give up its Shooting Action to Board the target. The helmsman must make a Hard (-20) Operate (Voidship) + Manoeuvrability Test. If he succeeds, the two ships crash together and the boarding action begins. While two ships are involved in a boarding action, neither of them can take Manoeuvre or Shooting Actions (meaning the two ships remain stationary), although individual characters may still take Extended Actions. The ships are locked together, and the only way a ship can break free is by making a Hard (-20) Operate (Voidship) + Manoeuvrability Test at the beginning of its turn. If a ship attempts to break free and fails, however, it will suffer a -20 to the subsequent opposed Command Test (see below).\n\nThe two ships take their Strategic Turns simultaneously, dropping to last in the initiative order. During their turns, two characters, one from each ship (whoever is leading the ship's warriors), make an opposed Command Test. The ship with the larger Crew Population value will receive a +10 bonus to its character's Command Test for every full 10 points difference in Crew Population between the two ships. The ship with the higher remaining Hull Integrity provides a +10 bonus to its character's Command Test for every full 10 points difference in Crew Population between the two ships. Each ship's turret rating also provides a bonus.\n\nFor each degree the winner wins by, he may choose to inflict one of the following options on his opponent. The loser may either suffer 1d5 Crew Population and 1d5 Morale damage (representing the crew cutting through the enemy), or 1 point of Hull Integrity damage (representing the crew setting charges and doing as much damage as possible). Damage to Hull Integrity will also result in damage to Crew Population and Morale as normal.\n\nThe ship that has lost the opposed Command Test must then roll a d100 and compare it to their current Morale. If they roll an equal or lower number than their Morale, their crew continues to fight. During the next Strategic Turn, both ships will make opposed Command Tests again. If, however, the losing ship rolls higher than their current Morale, their crew routes and surrenders to their captors. If the ship is an NPC vessel, it surrenders. If it is the Explorers' vessel, the characters face a grim choice-surrender to their foes, or try and flee as best they can..."
      }
    ]
  }
}
