{
  "title": "Navigator - Elite Advance",
  "info": "# Navigator - Elite Advance",
  "component": "EliteAdvance",
  "data": {
    "eliteAdvance": "Navigator",
    "cost": 300,
    "prerequisites": [
      {
        "title": "An Eye in the Warp",
        "description": "Characters with the Psyker or Untouchable elite advance cannot gain the Navigator elite advance."
      },
      {
        "title": "Genetic Heritage",
        "description": "Navigator Elite Advance may only be taken during Character creation"
      }
    ],
    "instantChanges": [
      "Navigator trait",
      "Psyker Aptitude",
      "__The Boons of Lineage__",
      "__Navigator Mutations__",
      "__Unlicensed__",
      "__The Eye is Open__"
    ],
    "information": [
      {
        "title": "The Boons of Lineage",
        "description": "A Navigator hails from a lineage of a particular type that grants her a number of advantages and quirks. The Lineages which a Navigator may hail from are Nomadic Houses, Magisterial Houses, Shrouded Houses, or Renegade Houses. The details and effects of each of these lineages may be found at Navigator Houses. "
      },
      {
        "title": "Navigator Mutations",
        "description": "The Navigator begins play with a number of Navigator Mutations determined by the nature of her Lineage. Thereafter whenever the character gains a new Navigator power, or increases her level of mastery over a power she already has, she must test for mutation, an Ordinary (+10) Toughness Test. If she fails this test, then a flaw in her genes has revealed itself, and she must generate a mutation from Navigator Mutations."
      },
      {
        "title": "Unlicensed",
        "description": "If the character does not have the Navis Nobilte background, they also gain the Enemy (Navis Nobilite) talent"
      },
      {
        "title": "The Eye is Open",
        "description": "A Navigator is a living window into the warp, a fact mercifully mitigated for her own soul's and sanity's sake by the effects of the Navigator Gene that allows her to perceive the warp's mind-blasting truth in a unique way that allows her human mind to deal with it. As a result she does not suffer Corruption Points from Warp Shock, although she can acquire Corruption Points normally by other means."
      }
    ],
    "advances": [
      {
        "advance": "Learn New Navigator Power",
        "cost": "200xp",
        "information": "Gain the use of a new Navigator Power. See Navigator Powers"
      },
      {
        "advance": "Improve Power to Adept",
        "cost": "300xp",
        "information": "Improve an existing Navigator Power to Adept level"
      },
      {
        "advance": "Improve Power to Master",
        "cost": "400xp",
        "information": "Improve an Adept Navigator Power to Master level"
      }
    ]
  }
}
