{
  "title": "Talents",
  "info": "# Talents",
  "component": "Talents",
  "data": [
    {
      "tier": 3,
      "name": "A Machine of Flesh",
      "id": "a_machine_of_flesh",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 35",
        "Intelligence 40",
        "Mechanicus Implants",
        "Prosanguine",
        "Autosanguine Implants"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "You gain one of the following mutations: Swollen Brute or Bestial Hide; or one of the following Traits: Regeneration(1), Dark-sight, Natural Weapons, Sonar Sense, Toxic (1), or Sturdy. You gain that Trait or the effects of the Mutation (although, as you are either grafting biological systems into your body or manipulating your own genetic structure, whether or not you are actually a mutant is debatable). This talent may be taken a number of times equal to half your TB, rounded up",
      "source": "Into the Storm"
    },
    {
      "tier": 3,
      "name": "Abhor the Witch",
      "id": "abhor_the_witch",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "This talent may be used at any time by a character as long as he has at least an hour to perform a ritual of contempt  (a player may say his character has already performed the ritual before play begins if the GM agrees). The character must also spend one Fate Point. During the game session whenever the character is the subject of the effects of a psychic power, daemonic power or other warp based power, he may make a Willpower Test (make this test before any tests he would normally be permitted to resist the effects of the power). If the Willpower test is passed the character is unaffected by the psychic power. If the test is failed then the psychic power affects him as normal and, if he possess the Frenzy talent, he becomes Frenzied in addition to any other effects. The effects of this talent only apply to powers that directly affect the character (such as targeted powers or powers which catch him in their area of effect) and not powers which may harm him indirectly (such as attack from summoned daemons or falling or flung debris from a telekinetic). In addition, powers used by friendly psykers must also be resisted (and also cause Frenzy should he fail to resist them). A power that is resisted by a character using this talent is not nullified and others are affected by it as normal",
      "source": "Black Crusade / Deathwatch"
    },
    {
      "tier": 3,
      "name": "Abiding Resilience",
      "id": "abiding_resilience",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40"
      ],
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "When this character expends a Fate Point to regain Wounds, he regains a number of Wounds equal to 1d5 + his Toughness Bonus (instead of 1d5 Wounds as normal) and removes 1 level of Fatigue.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Accelerated Repairs",
      "id": "accelerated_repairs",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 3 in an Essential Repair Skill",
        "Rank 2 Tech-Use"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may now perform Repair Tests at a swifter rate. When opting to perform a Repair Test as a Rush Job, he suffers a -10 penalty instead of the normal -30. When electing to make Careful Repairs, he increases the Repair Time by 25% instead of 50% (so that a repair that would normally take 12 hours takes a total of 15 hours, instead of the 18 it would normally take with Careful Repairs)",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Ace Operator",
      "id": "ace_operator",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Operate (any)"
      ],
      "aptitudes": [
        "Agility",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever the character fails an Operate Test, he may spend a Fate Point to reduce his Degrees of Failure on the Test by his Agility Bonus.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Adamantium Faith",
      "id": "adamantium_faith",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Jaded",
        "Resistance (Fear)",
        "Willpower 45"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "He can subtract his Willpower bonus from his degrees of failure on a failed Fear or Pinning test. If this reduces the result to zero or less, he counts as having passed the Fear test with 1 degree of success",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Addictrix",
      "id": "addictrix",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 50",
        "Rank 2 Charm"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "The Heretic is a master of seduction and manipulation, and has ways of securing power over those who succumb to his wiles. The Heretic may attempt to seduce an NPC into his service, and ensure continued service by making the NPC dependent on something only the Heretic can offer. First, the Heretic must defeat the chosen NPC in a social confrontation (See Social Encounters). Should the Heretic succeed, he can take advantage of his victim's demoralised state and introduce him to whatever addicting substance the Heretic offers. The NPC becomes a Minion of the Heretic, retaining their profile and gear, and gaining a Loyalty value and the Monodevotant Trait. \n\nThis Talent is not effective on NPCs with a higher Infamy than the Heretic or the Touched by the Fates Trait, or NPCs categorised as Masters. Other NPCs may also be unaffected at the GM's discretion, such as those with the From Beyond or Machine Traits. The Heretic may only have a single seduced Minion in his service, but may discard him at any time by cutting off his supply—although the NPC may cause problems for the Heretic once he has recovered his senses! The seduced Minion does not count toward the character's limit. The GM and player should work together to determine the Minion's addiction, though it does not necessarily need to be the same substance every time—some Heretics have much to offer.",
      "source": "Tome of Excess"
    },
    {
      "tier": 1,
      "name": "Air of Authority",
      "id": "air_of_authority",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 30"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "When making Command Skill Tests, the character may affect a number of targets equal to 100 times their Fellowship Bonus rather than just 10. If the character is giving an Order to his Squad, the order's range is increased by 100 metres. If the character has Minions they are also more devoted to him and add +10 to their Loyalty when in his presence. This Talent has no effect on hostile targets and only affects NPCs. When making a Command Skill Test in a Social Conflict add a +10 bonus in addition to any other modifiers.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "All-Seeing Eye",
      "id": "all_seeing_eye",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants",
        "Rigor Mentis"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has been given, or stolen, access to the shadowed Praecursator Grid, the secret network of observation connecting every Mechanicus machine. To access the Grid, the agent should make a Hard (-20) Tech-Use test. If successful, the character gains the most recently recorded information, usually no more than a day old. If they succeed by three or more degrees, the agent can access any recorded information archived on the planet. It is up to the GM to determine how the agent accesses the Grid, and if the Grid is available in the area.",
      "source": "The Lathe Worlds"
    },
    {
      "tier": 2,
      "name": "Ambassador Imperialis",
      "id": "ambassador_imperialis",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35",
        "Intelligence 35"
      ],
      "aptitudes": [
        "Perception",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "The character reduces any penalty to Interaction skill tests for dealing with xenos or non-Imperial NPCs by 20. In addition, once per encounter, he can reroll a failed Interaction skill test when interacting with such an NPC",
      "source": "Enemies Without"
    },
    {
      "tier": 1,
      "name": "Ambidextrous",
      "id": "ambidextrous",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 30"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Ballistic Skill"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may use either hand equally well for any task, and does not suffer the -20 penalty for actions using his off hand. When combined with Two-Weapon Wielder talent, the penalty for making attacks with both weapons in the same turn drops to -10",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Ambush",
      "id": "ambush",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Stealth"
      ],
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "This character's attacks against Unaware Targets inflict 1 additional Damage for every 2 Degrees of Success on the Weapon Skill or Ballistic Skill Test beyond the first.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Ancient Warrior",
      "id": "ancient_warrior",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35",
        "Willpower 35"
      ],
      "aptitudes": [
        "General",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "Though the character does not need to be a Chaos Space Marine to take this talent it is rare for those outside their ranks to possess it. This Talent must be taken at Character Creation. The character can command special respect from other veterans of the Long War and gains a +10 to all Fellowship Tests and Skill Tests based on Fellowship when dealing with such NPCs. In addition, Chaos Space Marine Minions of the character increase their loyalty by +10. Long War weaponry is also easier for him to obtain and all weapons with the word “Legion” in the title count as one Availability category easier than normal (i.e. Rare becomes Scarce, Scarce becomes Average, etc.). Finally, veterans of the Long War are despised by the Imperium and the Adeptus Astartes especially, and should the character's past become known by these powers it is likely to end in blood...",
      "source": "Black Crusade"
    },
    {
      "tier": 2,
      "name": "Archivator",
      "id": "archivator",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 40"
      ],
      "aptitudes": [
        "Perception",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "When making a Scholastic Lore or Forbidden Lore test utilising sources of recorded information of any sort, such as cogitators, tomes, info-nets, and data-slates, the character can reroll a failed test once with a -10 penalty. In addition, tests to perform research or find information in these circumstances take half the usual time",
      "source": "Enemies Without"
    },
    {
      "tier": 2,
      "name": "Armour of Contempt",
      "id": "armour_of_contempt",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Defence"
      ],
      "alignment": "Imperial",
      "benefit": "The Explorer's hatred of all the impure armours his soul against malign influence. Whenever the Explorer gains Corruption Points, reduce the total by 1, to a minimum of 0. With a successful Willpower Test, taken as a Free Action, he may ignore the effects of accumulated Corruption Points for 1 Round.",
      "source": "Rogue Trader"
    },
    {
      "tier": 2,
      "name": "Armour-Monger",
      "id": "armour_monger",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35",
        "Tech-Use",
        "Trade (Armourer)"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character gains an extra amount of Armour points equal to his Intelligence bonus, which he can distribute to any locations that his armour would normally cover, as long as he has at least an hour each day to clean and repair it or make minor modifications. This bonus applies only to armour when the Acolyte is wearing it, as it combines his training with his skill at armoury.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Arms Master",
      "id": "arms_master",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40",
        "Ballistic Skill 40",
        "Weapon Training (any two)"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Ballistic Skill"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character uses a weapon he is untrained in, he only suffers a -10 penalty, rather than a -20. The only exception to Arms Master are exotic weapons, which are so unusual or rare that they always require their own weapon training Talents to use without penalty, and gain no bonus when combined with this Talent.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Aspect of the Emperor",
      "id": "aspect_of_the_emperor",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 40",
        "Adeptus Ministorum or Adeptus Sororitas Background"
      ],
      "aptitudes": [
        "Fellowship",
        "Knowledge"
      ],
      "alignment": "Imperial",
      "benefit": "The character selects one of the options below. \n\n* __Voice of the Emperor:__ When dealing with the faithful of the Emperor (the true faithful of the Imperial Creed), the character gains a +30 to all Interaction Skill Tests. In addition, if he has the Master Orator talent, then the character can now affect anyone that can hear and draw line of sight to him with Interaction Skills. \n\n* __Wrath of the Emperor:__ Melee attacks made by the character, and by those within 4 metres of him, count as holy and blessed attacks when applying damage. Note that this power does not affect, and is not affected by, any Faith powers the character may have. Instead, this ability exists in addition to any Faith ability. \n\n* __Mercy of the Emperor:__ The character can perform a faith healing a number of times per day equal to his Fellowship Bonus. To perform this miracle, he must lay both his hands on the subject and make a Routine (+20) Fellowship Test. This restores 2 wounds to the subject plus an additional 2 wounds for each degree of success. This counts as a Full Action if performed in combat. This healing may only be performed once per person per injury. Note that this power does not affect and is not affected by any Faith powers the character may have. Instead, this ability exists in addition to any Faith ability ",
      "source": null
    },
    {
      "tier": 2,
      "name": "Aspire to Vengeance",
      "id": "aspire_to_vengeance",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40",
        "Willpower 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "Whenever a Player Character, Comrade, or allied NPC within 50 metres is slain by an enemy, this character enters a hateful fury. Until the end of the encounter, he increases any Critical Damage that he inflicts because of Righteous Fury by 3.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Assassin Strike",
      "id": "assassin_strike",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 40",
        "Acrobatics"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Fieldcraft"
      ],
      "alignment": "Slaanesh",
      "benefit": "After making a melee attack, a successful Challenging (+0) Acrobatics skill test allows the Acolyte to move at half rate as a Free Action. He may only make this move once per round, and the character's opponent does not receive a free attack resulting from this move.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Astartes / Legion Weapon Specialization",
      "id": "astartes_legion_weapon_specialization",
      "specialist": true,
      "specialisations": [
        "Any Weapon Group"
      ],
      "prerequisites": [
        "Space Marine",
        "Astartes / Legion Weapon Training"
      ],
      "aptitudes": [
        "Ballistic Skill/Weapon Skill",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When this Talent is taken, a weapon group must be specified, such as bolt or chain. The type must match the aptitude used to determine cost. This Talent may be taken multiple times for different weapon groups. When using the specified type of weapon, the character never suffers a penalty greater than -30 when using the weapon.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Astartes / Legion Weapon Training",
      "id": "astartes_legion_weapon_training",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Space Marine"
      ],
      "aptitudes": [
        "Offence",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "Space Marines are proficient with all weapons of the Bolt, Chain, Melta, Plasma, Power, Flame, Primitive, Las, Solid Projectile, Thrown, and Launcher categories. In essence the only weapons that a Space Marine is not proficient with are Exotic Weapons; for these he must acquire individual Talents as normal.",
      "source": "Black Crusade"
    },
    {
      "tier": 3,
      "name": "Baleful Dirge",
      "id": "baleful_dirge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Disturbing Voice",
        "Rank 2 Intimidate"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Nurgle",
      "benefit": "Singing the dirge takes some concentration and requires a Half Action each round to maintain. All creatures which can hear the character within a 30-metre radius must make a Willpower Test or suffer a -10 on their next roll. As long as the dirge is maintained, all those affected by it must test each turn to see if they suffer its effects. Once a creature passes a Willpower Test however, it has completely overcome the dirge and is not affected by it for the remainder of the encounter",
      "source": "Black Crusade"
    },
    {
      "tier": 3,
      "name": "Bastion of Iron Will",
      "id": "bastion_of_iron_will",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating",
        "Strong Minded",
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Tzeentch",
      "benefit": "He adds 5 x his psy rating to any Opposed test he makes when defending against psychic powers.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Battle Rage",
      "id": "battle_rage",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Frenzy"
      ],
      "aptitudes": [
        "Strength",
        "Defence"
      ],
      "alignment": "Khorne",
      "benefit": "The Acolyte can Parry while Frenzied, and can re-roll a failed test to snap out of Frenzy or resist entering Frenzy if he so chooses.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Battlefield Tech Wright",
      "id": "battlefield_tech_wright",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 in an Essential Repair Skill",
        "Willpower 35"
      ],
      "aptitudes": [
        "Willpower",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character no longer suffers any penalties to Tech-Use or Repair Tests due to external distractions and reduces all penalties from poor tools or working conditions by a total of 10 (so a Hard (-20) Repair Test to fix a tank mired in a swamp would become Difficult (-10) instead)",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Beloved Leader",
      "id": "beloved_leader",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Charm",
        "Fellowship 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "This Character's Minions are extraordinarily dedicated to completing tasks to his satisfaction, whether through fear of punishment or a desire to please. The character increases the Loyalty of all his Minions by +10.",
      "source": "Tome of Excess"
    },
    {
      "tier": 1,
      "name": "Berserk Charge",
      "id": "berserk_charge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "If the character uses the Charge Action, his Weapon Skill Test is Easy (+30) instead of Routine (+20).",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Best of the Best",
      "id": "best_of_the_best",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 3 Operate (Aeronautica and Voidship)"
      ],
      "aptitudes": [
        "Agility",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever making an Opposed Operate Test, if the character and his opponent both make the same number of degrees of success, this character counts as winning the Test (in essence, he wins ties). They also win ties when making any opposed Interaction Skill Tests with members of the Imperial Navy or equivalent faction.",
      "source": "Into the Storm"
    },
    {
      "tier": 2,
      "name": "Bestial Companion",
      "id": "bestial_companion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 1 Survival"
      ],
      "aptitudes": [
        "Fellowship",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "This character gains a bestial companion in the form of some cyber-creature bonded to his will or a wild beast that he has tamed with the Wrangling use of the Survival Skill. This creature follows his basic commands, and takes its Turn immediately after each of his Turns during combat. If he somehow loses this creature, through its untimely death or another unfortunate separation, he can acquire a new one at the Game Master's discretion after a suitable period of time spent arranging for its replacement (or mourning its loss). The character may take this Talent up to three times, each time gaining a new bestial companion.\n\nThis creature does not count as a Minion for purposes of Talents, Traits, or any other rules.\n\nSee Bestial Companions for more details.",
      "source": "Faith and Coin"
    },
    {
      "tier": 2,
      "name": "Betrayer",
      "id": "betrayer",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Cold Hearted",
        "Intimidate"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per game session the character may kill either an allied NPC (i.e. an NPC which is openly friendly toward the PC and trusts him) or one of his own Minions. Such calculated cruelty boosts the Heretic's reputation, granting him a +10 bonus on his next Infamy Test if the victim was an NPC and +20 if it was a Minion (and harder to replace). Killing NPCs and Minions usually has consequences as well which should be determined by the GM.",
      "source": "Black Crusade"
    },
    {
      "tier": 1,
      "name": "Binary Chatter",
      "id": "binary_chatter",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character receives a +10 bonus to any attempt to instruct, program, or communicate with servitors. This ability increases the loyalty of all minions who are servitors or other cybernetic constructions by 10.",
      "source": null
    },
    {
      "tier": 3,
      "name": "Blademaster",
      "id": "blademaster",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 30",
        "Weapon Training (any Melee)"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Khorne",
      "benefit": "When attacking with any bladed weapon, including chainswords, axes, and power swords, he can re-roll one missed attack per round",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Blasphemous Incantation",
      "id": "blasphemous_incantation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating"
      ],
      "aptitudes": [
        "Intelligence",
        "Psyker"
      ],
      "alignment": "Tzeentch",
      "benefit": "Using a power with an incantation increases the Focus Power Test by a Half Action, as the psyker requires a few moments to speak the required words. Powers for which the Focus Power Test takes a Reaction cannot be used with an invocation. Using a power with an invocation grants the psyker a +1 bonus to his Psy Rating, after determining Psychic Strength. This bonus to PR does not influence the Psychic Strength in any way; their benefit is applied after determining a power's Psy Rating level. However, the psyker must add +20 to any roll on the Psychic Phenomena table. Finally, any result of 91 or higher on the Focus Power Test is an automatic failure that results in Perils of the Warp",
      "source": "Black Crusade"
    },
    {
      "tier": 3,
      "name": "Blessed Radiance",
      "id": "blessed_radiance",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Pure Faith",
        "any other Faith Talent"
      ],
      "aptitudes": [
        "Willpower",
        "Social"
      ],
      "alignment": "Imperial",
      "benefit": "When spending a Fate Point to activate the Pure Faith Talent, the Explorer extends the immunity to daemonic presence to a number of targets equal to twice his Willpower Bonus. As a free action, he may bestow a single Fate Point to an ally. If the Fate Point is unspent, it returns at the end of the encounter. Upon burning a Fate Point, the Explorer and a number of allies equal to twice his Willpower Bonus become immune to the effects of daemonic presence, Fear Tests, and Corruption Points. In addition, all affected targets gain a +10 bonus on Tests made to resist psychic attack or any other form of psychic manipulation. In addition, affected targets take only half Damage from psychic and warp sources. These benefits last for the duration of the encounter.",
      "source": "Rogue Trader"
    },
    {
      "tier": 3,
      "name": "Blessing of Flame",
      "id": "blessing_of_flame",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 45",
        "Rank 3 Scholastic Lore (Imperial Creed)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Knowledge"
      ],
      "alignment": "Imperial",
      "benefit": "As a Full Action, this character may make a Challenging (+0) Scholastic Lore (Imperial Creed) Test to bless a single weapon with the Flame Quality. A weapon so blessed automatically sets Daemons aflame when it strikes them and gains the Sanctified Quality for a number of Rounds equal to this character's Willpower Bonus or until the Clip is depleted (if it has one)",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Blind Fighting",
      "id": "blind_fighting",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 30"
      ],
      "aptitudes": [
        "Perception",
        "Fieldcraft"
      ],
      "alignment": "Tzeentch",
      "benefit": "He ignores all penalties for fighting with a melee weapon while suffering from obscured vision, permitting him to fight in fog, smoke, or darkness more effectively. Note this talent only improves his chances to hit with melee weapons, and has no effect on ranged weapon attacks",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Bodyguard",
      "id": "bodyguard",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 35"
      ],
      "aptitudes": [
        "Agility",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "After an enemy makes a successful attack against an ally, the character may use a Reaction to move up to his Half Move distance in order to interpose himself between the attacker and target. The attack is then resolved against the character instead of the original target. In the case of a melee attack, the character may also attempt to Parry the attack as part of his Reaction",
      "source": "Enemies Beyond"
    },
    {
      "tier": 3,
      "name": "Bolter Drill",
      "id": "bolter_drill",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Training (Bolt)",
        "Ballistic Skill 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "When firing any class of Bolt weapon on full or semi-auto the character may score one additional Degree of Success (provided the Test is successful) if he does not take a Move Action in his turn",
      "source": "Black Crusade"
    },
    {
      "tier": 3,
      "name": "Bombardier",
      "id": "bombardier",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40",
        "Tech-Use",
        "Weapon Training (Launcher)"
      ],
      "aptitudes": [
        "Offence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "This character may make ranged attacks with weapons with the Indirect Quality targeting locations he cannot see as a Half Action instead of a Full Action as normal. When firing a weapon with the Indirect Quality or throwing a grenade, this character rolls twice to determine the direction that his attacks scatters and may choose either result.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Brute of Burden",
      "id": "brute_of_burden",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 45"
      ],
      "aptitudes": [
        "Strength",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "This character adds an amount equal to the value of his Size Trait to the total of his Strength Bonus and Toughness Bonus for the purposes of lifting, carrying, or pushing heavy loads. In addition, he gains a +20 bonus on Toughness Tests to avoid gaining Fatigue from a forced march",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Bulging Biceps",
      "id": "bulging_biceps",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 45"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Nurgle",
      "benefit": "He can fire a heavy weapon using Semi Auto Burst or Full Auto Burst without bracing the weapon, and does not suffer the -30 penalty for failing to brace it. In addition, whenever he uses the Heft special use of the Athletics skill he can add +20 to his Athletics skill test to reflect his powerful musculature.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Bulwark of Faith",
      "id": "bulwark_of_faith",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 45",
        "Iron Faith"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Imperial",
      "benefit": "When the character passes a Fear test caused by a Daemon, the Daemon suffers 1 Energy damage ignoring armour and Toughness bonus for each degree of success on the Fear test",
      "source": "Enemies Beyond"
    },
    {
      "tier": 1,
      "name": "Calculated Barrage",
      "id": "calculated_barrage",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character or his Comrade fires a weapon with the Indirect Quality, if at least one hit lands within a number of metres equal to his Intelligence Bonus of an enemy, that target must make a Routine (+20) Pinning Test.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Call to Vengeance",
      "id": "call_to_vengeance",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Adeptus Astartes",
        "Fellowship 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "When another member of the unit is killed or taken out of action, the character may take a Full Action and spend a Fate Point to call his remaining brothers to revenge the fallen. The character may raise his weapon in defiance and speak an oath of hatred, or recite one of the canticles of vengeance. No matter how it is embodied, his action restores the character and all those in Support Range of him to their starting Cohesion.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Catfall",
      "id": "catfall",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 30"
      ],
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Slaanesh",
      "benefit": "He automatically reduces the effective distance of all falls by a number of metres equal to his Agility bonus, ignoring this distance as if it did not exist. He also adds +20 to his Acrobatics skill tests when using the Jump special skill use, as it pertains to reducing damage from falling",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Chain Weapon Expertise",
      "id": "chain_weapon_expertise",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40",
        "Weapon Training (Chain)"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When using a chain weapon with the Tearing Quality, this character rolls two additional dice for Damage (rather than the usual one die that the Tearing Quality grants) and discards the two lowest Damage dice results.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Child of the Warp",
      "id": "child_of_the_warp",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Unaligned",
      "benefit": "This grants greater connection to the warp and increases the character's Psy Rating by +1 when he chooses to Push. The downside, however, is that the warp is always partially manifest in his presence and he generates constant psychic phenomena. At the start of each game session the character should roll 1d10 on the below list to determine the nature of these persistent effects which follow him for the duration of the session. Alternatively, with the GM's consent the player may select one phenomena from the following list that always effects him, eliminating the need to roll each session. Note that the character still suffers from Psychic Phenomena and Perils of the Warp as normal\n\n__1 - Warp Echo:__ All noises cause echoes regardless of the surroundings.\n\n__2 - Unholy Stench:__ The air around the psyker is permeated with a bizarre and foul smell.\n\n__3 - Hoarfrost:__ A thin coating of frost covers everything within 10 metres.\n\n__4 - Aura of Taint:__ Animals within 30 metres become spooked and agitated.\n\n__5 - Memory Worm:__ People who see the psyker forget something trivial.\n\n__6 - Spoilage:__ Food and drink go bad in a 10 metre radius.\n\n__7 - Haunting Breeze:__ Winds Surround the psyker blowing light objects about within 10 metres\n\n__8 - Distorted Reflections:__ Mirrors and other reflective surfaces within 10 metres are Distorted\n\n__9 - Unnatural Decay:__ Plant life within 10 metres of the psyker withers and dies\n\n__10 - Bloody Tears:__ Blood weeps from stone and wood within 10 metres of the psyker",
      "source": "Black Crusade"
    },
    {
      "tier": 3,
      "name": "Chosen Representative",
      "id": "chosen_representative",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Space Marine"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "When the character is dealing with other Imperial factions he gains the right to speak for his organisation and make dealings on their behalf. In addition to the role-playing benefits of this special dispensation, the character gains +10 to all Fellowship Tests when dealing with Imperial Authorities and can (with the GM's consent) spend a Fate point to gain the instant and total support of a local NPC or military force.",
      "source": "Rites of Battle"
    },
    {
      "tier": 2,
      "name": "Cleanse and Purify",
      "id": "cleanse_and_purify",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 35",
        "Weapon Training (Flame)"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Tzeentch",
      "benefit": "When this character hits an enemy with an attack from a weapon with the Flame Quality, that enemy suffers a -20 penalty on his Agility Test to avoid catching fire. Additionally, when this character inflicts Righteous Fury on an attack with a weapon with the Flame Quality, the target is automatically set on fire. When used against an enemy with the Horde trait, the number of hits on the Horde is increased by +1d5.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Clues from the Crowds",
      "id": "clues_from_the_crowds",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 30"
      ],
      "aptitudes": [
        "General",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Once per day, he can re-roll a test made to gather information from a group of people",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Cogs Within Cogs",
      "id": "cogs_within_cogs",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants",
        "Intelligence 35"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Interfacing with a machine, the character can set it to activate, deactivate, or follow some other simple command at either a given time within 24 hours or at their remote command by making a Challenging (+0) Tech-Use (after any other tests required to access it, such as Security or Forbidden Lore (Archeotech)).",
      "source": "The Lathe Worlds"
    },
    {
      "tier": 1,
      "name": "Cold Hearted / Chem Geld",
      "id": "cold_hearted_chem_geld",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "Seduction attempts against him automatically fail and Charm Tests increase their Difficulty by one level. Taking this Talent causes one Insanity Point. When in a Social Conflict any attempt to Charm the character gives him a +20 to the Opposed Test in addition to any other modifiers.",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Cold Reading",
      "id": "cold_reading",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Deceive and Rank 2 Scrutiny "
      ],
      "aptitudes": [
        "Perception",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Prior to making a Commerce or Charm Test, the Charlatan may make a Deceive Test opposed by the target's Willpower or Scrutiny. If the Deceive Test is a success, the Charlatan has hooked the target into giving up some vital information and the Charlatan may then make a Challenging (+0) Scrutiny Test to assess the importance of the information gained. If successful, the Charlatan gains a +5 bonus to his next Commerce or Charm Test against the target for each point of Perception Bonus. He has ascertained information about the target, which will aid him in his pitch, negotiations, or diplomacy.",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 3,
      "name": "Cold Soul",
      "id": "cold_soul",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "20 Insanity"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "This Talent grants a +30 bonus when opposing any Fellowship or Interrogation Test, and suffer -20 to any Fellowship based Tests they make, due to their unnerving countenance. The character removes any current Mental Disorders and also never rolls on the Mental Trauma table—such feelings are beyond him now—but must pay double normal Experience Points when attempting to remove Insanity Points. Should a player's Insanity Points drop below 10, then he may remove this Talent at the GM's discretion.",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 2,
      "name": "Combat Flair",
      "id": "combat_flair",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Blademaster",
        "Rank 2 Charm",
        "Weapon Skill 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Slaanesh",
      "benefit": "This Talent allows the character to make an opposed Challenging (+0) Charm versus Willpower Test as a Half Action against any foes in close combat each combat round. Should he win, he imposes a -10 penalty to his foes' Weapon Skill, increasing by 5 for every degree of success. This penalty applies for one full Round. Multiple characters may use this Talent with a cumulative effect. At the GM's discretion, opponents with the Bestial, Daemonic, From Beyond, or Machine Trait are immune to this Talent.",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 1,
      "name": "Combat Formation",
      "id": "combat_formation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 40"
      ],
      "aptitudes": [
        "Leadership",
        "Fieldcraft"
      ],
      "alignment": "Tzeentch",
      "benefit": "All members of the group (including the character) add +1 to their Initiative rolls. Any member of the group may also choose to use the Intelligence Bonus of this character for their Initiative roll rather than their own Agility Bonus.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Combat Master",
      "id": "combat_master",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 30"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Defence"
      ],
      "alignment": "Khorne",
      "benefit": "Opponents fighting him in hand-to-hand combat gain no bonuses for Ganging Up",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Commanding Presence",
      "id": "commanding_presence",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 35"
      ],
      "aptitudes": [
        "Strength",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "A character with this talent has both a knack for command and a naturally impressive presence that shrouds him in awe and demands respect. This presence has two effects: the first is that the character may use his Strength characteristic in place of Fellowship should his Strength be higher. The second is that the character never suffers more than -20 to any Fellowship Test (including when using his Strength as Fellowship as noted above) regardless of modifiers.",
      "source": "Rites of Battle"
    },
    {
      "tier": 1,
      "name": "Concealed Cavity",
      "id": "concealed_cavity",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Finesse",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Discovering this compartment requires success on a Difficult (-10) Search Test. If using a medicae scanner or auspex, the Difficulty is reduced to Ordinary (+10).",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Confessor",
      "id": "confessor",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35",
        "Adeptus Ministorum background",
        "Willpower 35"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Imperial",
      "benefit": "The character may hear the confessions of his squad mates between missions, and grant them a reprieve from their concerns. Whenever a character in the Squad spends XP to remove Insanity Points, he may remove an additional Insanity Point for each 100 XP spent. Characters in the Squad still cannot reduce any Degrees of Madness gained prior to spending XP—such trauma has already become too much a part of them for remedy",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Constant Vigilance",
      "id": "constant_vigilance",
      "specialist": true,
      "specialisations": [
        "Perception",
        "Intelligence"
      ],
      "prerequisites": [
        "Intelligence 35 or Perception 35",
        "Awareness +10"
      ],
      "aptitudes": [
        "Perception",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "When this talent is taken, the character selects the Specialisation that matches the prerequisite (Perception or Intelligence) used in purchase. He can use the characteristic that matches that Specialisation when rolling for Initiative instead of his Agility value, and rolls two dice for the roll (picking the highest of the two for his score).",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Contact Network",
      "id": "contact_network",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Cover-Up",
        "Intelligence 35"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "An Acolyte with this talent can use his Fellowship characteristic in place of his Influence when making Requisition tests.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Coordinated Interrogation",
      "id": "coordinated_interrogation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 40 or Willpower 40",
        "Clues from the Crowds"
      ],
      "aptitudes": [
        "Intelligence",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "He gains a +10 bonus to all Interrogation tests, and gains an additional +5 for each other character participating in the interrogation who also has Coordinated Interrogation. This counts as test assistance, and thus also gains the standard assistance bonuses as per page 25",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Coordinated Strike",
      "id": "coordinated_strike",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Survival",
        "Bestial Minion"
      ],
      "aptitudes": [
        "Offence",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "As a Reaction, after hitting with a ranged or melee attack, this character may make a Challenging (+0) Survival Test. If he succeeds, one creature he acquired with the Bestial Minion Talent gains a +20 bonus to the next Attack Action it makes against that target until the end of its next Turn.",
      "source": "Faith and Coin"
    },
    {
      "tier": 2,
      "name": "Corpus Conversion",
      "id": "corpus_conversion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating",
        "Not Space Marine"
      ],
      "aptitudes": [
        "Toughness",
        "Psyker"
      ],
      "alignment": "Nurgle",
      "benefit": "A psyker with the Corpus Conversion Talent gains access to this Path to Power, and may elect to use it before he attempts his Focus Power Test. The psyker may gain a number of bonus Degrees of Success no greater than his Toughness Bonus on his Focus Power Test. However, for every Degree of Success gained in this way, the psyker suffers 1d10 Toughness Damage (note, this is not permanent Toughness Damage) and one Corruption Point as the energies of the warp poison his body from within. Traitor Legion characters may not benefit from Corpus Conversion; the taint-resistant metabolism of the Astartes makes them incapable of burning away his flesh to fuel warp-based powers.",
      "source": "Black Crusade"
    },
    {
      "tier": 3,
      "name": "Corrupted Charge",
      "id": "corrupted_charge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 45",
        "2+ Integrated Psychically-Charged Xenos Artefacts"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Tzeentch",
      "benefit": "Damage from this character's Luminen Shock and Luminen Blast Talents gains the Force Quality. If the character fails his Focus Power Test to activate the Force Quality, however, he suffers 1d5 Energy Damage not reduced by Armour or Toughness Bonus.",
      "source": "The Navis Primer"
    },
    {
      "tier": 2,
      "name": "Counter Attack",
      "id": "counter_attack",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per turn, after successfully Parrying an opponent's attack, this character may immediately make a Standard Attack action as a Free Action against that opponent using the weapon with which he Parried. The character suffers a -20 penalty on the Weapon Skill test for this attack.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Cover-Up",
      "id": "cover_up",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "At the GM's discretion, the character can reduce his Influence to increase his group's Subtlety. For every point of Influence lost in this way, the Acolyte increases his warband's Subtlety by 1d5.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Crack Shot",
      "id": "crack_shot",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 50"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Tzeentch",
      "benefit": "When the character's ranged attack causes Critical Damage, add +2 to the Damage result.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Creative Killer",
      "id": "creative_killer",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Street Fighting"
      ],
      "aptitudes": [
        "Intelligence",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When this character attacks with an improvised weapon, it uses the following profile instead of the default profile: Melee; 1d10-1 I; Pen 0; Ogryn-Proof, Unbalanced.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Criminal Mastermind",
      "id": "criminal_mastermind",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35",
        "Agility 35"
      ],
      "aptitudes": [
        "Agility",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "The character selects one of the options below.\n\n* __Master of Coin:__ The character gains a +5 bonus on all Requisition tests they are personally involved in.\n\n* __Shady Reputation:__ The character may automatically succeed at any one Dodge Test (instead of rolling) once per game session. Should degrees of success be a factor, then the Desperado is considered to have rolled a 01 on this test.\n\n* __Master of Locks and Tricks:__ Once per gaming session, the Desperado can automatically pass a Deceive, Security, Stealth or Sleight of Hand Test. Should degrees of success be a factor, then the Desperado is considered to have rolled a 01 on this test.",
      "source": "Ascension"
    },
    {
      "tier": 2,
      "name": "Crippling Strike",
      "id": "crippling_strike",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 50"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Slaanesh",
      "benefit": "When the character's melee attack causes Critical Damage, add +2 to the Damage result",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Crushing Blow",
      "id": "crushing_blow",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "He adds half his Weapon Skill bonus (rounding up) to damage he inflicts with melee attacks.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Cursed Heirloom",
      "id": "cursed_heirloom",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Offence",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may choose any weapon (melee or ranged) or armour from Chapter V: Armoury with an Availability of Very Rare or less without the need to make an Acquisition Test. He must, however, roll 1d5 once for the item on list below giving it a permanent curse. He is now bonded to the item and even if it is lost, destroyed, or stolen it always somehow turns up in its original condition at the start of the next game session. Such items also usually come with a history of their own and the GM should feel free to have the item's past come back to haunt the character from time to time.\n\n__1 - Bloodthirsty:__ Whenever the character kills a living creature he must make a Willpower Test or use his action to put another round into - or make another swing at - the corpse.\n\n__2 - Unsettling:__ The first time in each game session that the character makes a Fellowship Test or a Skill Test using the Fellowship Characteristic he must reroll the result if it is a success.\n\n__3 - Jinxed:__ If the item is a ranged weapon, whenever it Jams all nearby ranged weapons also Jam. If the item is a melee weapon whenever the character rolls minimum damage, all other nearby melee weapons inflict minimum damage until the start of the characters next turn. If the item is a suit of armour whenever the character is hit by a weapon with a Pen equal or greater than his AP all other suits of armour have their APs reduced by half until the start of the next turn. Jinxed affects items within 20 metres of the character whether they can see him or not.\n\n__4 - Doomed:__ The first time in each game session the character spends an Infamy Point roll a die, on a result of 9 the Infamy Point has no effect but is still spent.\n\n__5 - Toxic:__ The first time in each game session that the character makes a Toughness Test or a Skill Test using Toughness Characteristic must reroll the result if it is a success",
      "source": "Black Crusade"
    },
    {
      "tier": 2,
      "name": "Cybernetic Boost",
      "id": "cybernetic_boost",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "1+ Cybernetic Limbs",
        "Tech-Use"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "As a Half Action, this character may spend a Fate Point and make a Challenging (+0) Tech-Use Test. If he succeeds, he gains either the Unnatural Agility (X) or Unnatural Strength (X) Trait, where X is equal to one, plus one for every two additional Degrees of Success he scores on the Test (or increases existing versions of those Traits by X). These Traits persist for a number of Rounds equal to his Intelligence Bonus. The character may end the effect at any time. At the end of each Round in which the character allows it to persist, he gains 1 level of Fatigue",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Cybernetic Calibrations",
      "id": "cybernetic_calibrations",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "2+ Cybernetics",
        "Rank 2 in Tech-Use",
        "Cybernetic Boost"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "All of this character's Cybernetics count as being one level of Craftsmanship higher than their base Craftsmanship (so, for instance, a Poor Craftsmanship bionic arm would become Common Craftsmanship, or a Good Craftsmanship limb would become Best Craftsmanship).",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Cyclopaedic Learning",
      "id": "cyclopaedic_learning",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 4 in any Lore skill"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character can choose a single Lore skill they have Rank 4 in to master. From now on, all tests against this skill automatically succeed. If degrees of success are required, the Sage is considered to have rolled a 01 on his test.",
      "source": "Ascension"
    },
    {
      "tier": 2,
      "name": "Daemonhunter",
      "id": "daemonhunter",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Forbidden Lore (Daemonology)",
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Imperial",
      "benefit": "The Acolyte may re-roll failed Awareness and Psyniscience tests to detect the presence of Daemons. In addition, his attacks against Daemons gain the Proven (3) quality",
      "source": "Enemies Beyond"
    },
    {
      "tier": 2,
      "name": "Daemonologist",
      "id": "daemonologist",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating 3",
        "Willpower 45",
        "Forbidden Lore (Daemonology)"
      ],
      "aptitudes": [
        "Psyker",
        "Willpower"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character takes the Focus Power action and the target of the psychic power is a Daemon, he gains a +10 bonus to the Focus Power test. At the GM's discretion, this bonus may apply to other tests, such as rituals to summon or bind a Daemon",
      "source": "Enemies Beyond"
    },
    {
      "tier": 3,
      "name": "Dark Soul",
      "id": "dark_soul",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Hardened Soul",
        "20 Corruption"
      ],
      "aptitudes": [
        "Toughness",
        "Willpower"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character would test to gain a mutation as a result of increasing Corruption, he may choose to automatically pass the test. If he does, he also gains a Malignancy and increases his Corruption total by 1d10",
      "source": "Enemies Beyond"
    },
    {
      "tier": 2,
      "name": "Death Cult Assassin",
      "id": "death_cult_assassin",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40",
        "Agility 30"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "The character selects one of the Cults below.\n\n* __Cult of Blood:__ The Death Cult Assassin may achieve Righteous Fury on any melee weapon's damage dice result of a 7 or higher. In addition, the Penetration of all melee weapons the Assassin uses in combat are increased by 1. \n\n* __Cult of Death:__ Once per combat, the Death Cult Assassin may achieve Righteous Fury on any melee weapon's damage dice result of a 7 or higher during one Round. In addition, all critical hits with melee weapons that the Assassin makes are increased by 1 \n\n* __Cult of Pain:__ Once per game session, the Death Cult Assassin may ignore all wounds from a single hit, including any special effects or damage it would have caused. In addition, all critical hits on the Assassin are reduced by 1 point.",
      "source": "Ascension"
    },
    {
      "tier": 3,
      "name": "Death Serves the Righteous",
      "id": "death_serves_the_righteous",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 50",
        "Deadeye Shot",
        "Sharpshooter"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Tzeentch",
      "benefit": "Once per Combat Encounter, this character may spend a Fate Point in order to change a result of 1 on a single Damage die from a ranged attack to a result of 10. This can inflict Righteous Fury as normal",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Deathdealer",
      "id": "deathdealer",
      "specialist": true,
      "specialisations": [
        "Melee",
        "Ranged"
      ],
      "prerequisites": [
        "Ballistic Skill 45 or Weapon Skill 45"
      ],
      "aptitudes": [
        "Perception",
        "Finesse"
      ],
      "alignment": "Khorne",
      "benefit": "When this talent is taken, the character selects the Specialisation that matches the prerequisite used in purchase (Melee with Weapon Skill, Ranged with Ballistic Skill). When the character's attack in that combat type inflicts Critical damage, he adds his Perception bonus to the damage result",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Deathwatch Training",
      "id": "deathwatch_training",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Adeptus Astartes",
        "member of the Deathwatch"
      ],
      "aptitudes": [
        "General",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "All attacks from Deathwatch Space Marines against alien enemies gain Vengeful (9) or increase an existing Vengeful quality by 1",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Decadence",
      "id": "decadence",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 30"
      ],
      "aptitudes": [
        "Toughness",
        "Social"
      ],
      "alignment": "Nurgle",
      "benefit": "When drinking alcohol or similar beverages, he does not pass out until he has failed a number of Toughness Tests equal to twice his Toughness Bonus. The character also gains a +10 bonus to resist the effects of addiction.",
      "source": "Rogue Trader"
    },
    {
      "tier": 2,
      "name": "Deflect Shot",
      "id": "deflect_shot",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 50"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character is armed with a readied melee weapon, they add their Weapon Skill Bonus to their Armour Points on all locations (even unarmoured locations) when calculating Damage from hits from ranged weapons with the Primitive Special Quality or Thrown weapons.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Delicate Interrogation",
      "id": "delicate_interrogation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 50",
        "Coordinated Interrogation"
      ],
      "aptitudes": [
        "Intelligence",
        "Finesse"
      ],
      "alignment": "Slaanesh",
      "benefit": "Whenever the Acolyte would decrease his warband's Subtlety due to an interrogation, the amount of Subtlety lost is reduced by 1d5. If this results in a negative number, the Acolyte's skilled efforts increase the warband's Subtlety by 1",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Deny the Witch",
      "id": "deny_the_witch",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 35"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Khorne",
      "benefit": "The character may use his Willpower characteristic when making an Evasion Reaction against ranged or melee attacks against him made with psychic powers. When successfully evading an attack with an area of effect, the character does not move but instead is simply unaffected by the psychic power.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Desperate Strength",
      "id": "desperate_strength",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 50",
        "Frenzy"
      ],
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Khorne",
      "benefit": "While the character is Heavily Damaged, he gains the Unnatural Strength (1) and Unnatural Toughness (1) Traits (or increases the value of each of these Traits by 1 if he already possess them). While the character is suffering from Critical Damage, he increases the value of each of these Traits by an additional 1. The character still determines his threshold for being Heavily Damaged based on his Toughness Bonus before this Trait is applied.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Detestation",
      "id": "detestation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Hatred (Any)"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Social"
      ],
      "alignment": "Khorne",
      "benefit": "When attacking an enemy to whom one or more of the character's Hatred Talents applies, the attack deals additional Damage equal to one-half the character's Weapon Skill Bonus rounding up.",
      "source": "Honour the Chapter"
    },
    {
      "tier": 2,
      "name": "Devastating Assault",
      "id": "devastating_assault",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 35"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "Once per turn, after resolving an All Out Attack action that successfully hits, the character may make a second All Out Attack action against the same target as a Free Action, with the same bonuses and penalties as the first.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Devotion",
      "id": "devotion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Any Minion"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever the character would be hit by a ranged attack he can make an Agility Test for any of his Minions which are no further away from him than his Agility Bonus in metres. If he passes the test then they suffer the hit instead as they have thrown themselves in front of their master, and all the hits effects are worked out against the Minion. Provided they are close enough any number of Minions may try to protect the character in this way—forming a human shield against harm. This Talent only works with Minions and not allied NPCs no matter how favourably they view the character!",
      "source": null
    },
    {
      "tier": 1,
      "name": "Die Hard",
      "id": "die_hard",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "When this character would suffer a level of Fatigue due to the Blood Loss condition, he makes a Challenging (+0) Willpower test; if he succeeds, he does not suffer a level of Fatigue.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Disarm",
      "id": "disarm",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 30"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "As a Full Action, the character may make an Opposed Weapon Skill test against one target with whom he is engaged. If the Acolyte wins the test, the enemy drops his weapon to the ground. Should the Acolyte score three or more degrees of success, he can take the enemy's weapon from him.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Discerning Eye",
      "id": "discerning_eye",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 40",
        "Rank 2 Commerce"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "This Character may spend a Fate Point to automatically succeed when using the Evaluate special use of Commerce with a number of Degrees of Success equal to his Intelligence Bonus. Whenever he spends a Fate Point this way, he also gains some form of insight into the history of the item, either from relevant knowledge of his own, clues or signs hidden on the item itself, or some other source of the Game Master's discretion.",
      "source": null
    },
    {
      "tier": 1,
      "name": "Disturbing Voice",
      "id": "disturbing_voice",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Nurgle",
      "benefit": "The character gains a +10 bonus to all Intimidate Skill Tests, but suffers a -10 penalty to Fellowship Tests when dealing with others in a non-threatening manner, such as animals, children, or the easily startled. In addition, the character is more adept as instilling fear in his followers and when using the Command Terrify Special Skill Use, and adds +10 to his Command Skill Test to counter the effects of Fear. In a Social Conflict this character will get +10 to the Opposed Test if he uses the Intimidate Skill. Using any other Skill or Fellowship incurs a -10 modifier.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Divine Ministration",
      "id": "divine_ministration",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Pure Faith"
      ],
      "aptitudes": [
        "Willpower",
        "Knowledge"
      ],
      "alignment": "Imperial",
      "benefit": "When testing Medicae, the Explorer may spend a Fate Point to restore an amount of Damage equal to his Willpower Bonus instead of the normal amount. This amount is then added to and multiplied in the normal way depending on the type of care (see the Medicae). In the case of first aid to a Lightly Wounded character, the character restores an amount of Damage equal to his Willpower Bonus plus his Intelligence Bonus. The character may spend a Fate Point to remove all Fatigue from a number of people equal to twice his Willpower Bonus. The character may burn a Fate Point to allow a character who has just died to have become Critically Wounded instead. This power has its limits though, (bullet in the chest—yes, decapitation—no) and it's subject to the GM's approval. If a use of the Divine Ministration fails to work in this way, the Fate Point is not lost.",
      "source": "Rogue Trader"
    },
    {
      "tier": 3,
      "name": "Divine Protection",
      "id": "divine_protection",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 45",
        "Willpower 35"
      ],
      "aptitudes": [
        "General",
        "Finesse"
      ],
      "alignment": "Tzeentch",
      "benefit": "When the Acolyte attacks using a weapon with the Spray quality, it only strikes enemies within the area of effect; the attack does not harm allies",
      "source": "Enemies Within"
    },
    {
      "tier": 3,
      "name": "Don't You Die on Me!",
      "id": "don_t_you_die_on_me",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Master Chirugeon",
        "Methodical Care"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Nurgle",
      "benefit": "Whenever an ally dies from Blood Loss or due to a failed Characteristic Test, this character has a chance to bring the fallen comrade back from the brink for a number of Rounds equal to his Intelligence Bonus. During this time, if he is close enough to treat his “dead” ally, this character may spend a Fate Point make a Very Hard (-30) Medicae Test in an attempt to revive him. This Test requires a Full Action, and he must spend a Fate Point each time he wishes to attempt it. If he succeeds on one of these Tests within a number of Rounds equal to his Intelligence Bonus, he manages to bring the fallen ally back from the edge. Resuscitating a character in this way does not reverse any other consequences of the injury that “killed” the character, such as lost limbs or Characteristic Damage",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Double Tap",
      "id": "double_tap",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Two-Weapon Wielder (Ranged)"
      ],
      "aptitudes": [
        "Finesse",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When making a second ranged attack action in the same turn against the same target, he gains a +20 bonus to the attack test if his first attack scored one or more successful hits.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Double Team",
      "id": "double_team",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "General",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When Ganging Up on an opponent, he gains an additional +10 bonus to Weapon Skill tests. If both the characters that outnumber the enemy have this talent, then both gain an additional +10 bonus, for a total of +20. This bonus is in addition to the normal bonus gained from Ganging Up on an opponent ",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Drop Trooper",
      "id": "drop_trooper",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Operate (Aeronautica)"
      ],
      "aptitudes": [
        "Agility",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "This character treats the default Operate (Aeronautica) Test to use a grav chute as Simple (+40) instead of Routine (+20). Additionally, on a Failed Test, the character counts as having fallen only 1 metre per Degree of Failure on the Test",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Dual Shot",
      "id": "dual_shot",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Two-Weapon Wielder (Ranged)",
        "Agility 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When armed with two pistols, the character may fire both simultaneously as a Full Action. A single Ballistic Skill Test is made, and if successful, the character hits his target with both shots. As the character is firing both guns as a single attack, he may take an Aim Action before firing to get a +10 or +20 bonus to the BS Test, and a red-dot laser sight mounted on any one of the weapons provides its +10 bonus. The character does not suffer from the normal -20 Ballistic Skill penalty for wielding two weapons. If the attack hits, the target's armour gets applied as normal to both hits individually, but Toughness only counts once against the combined damage rolls of both hits. A single successful Dodge Test from the target avoids both shots.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Dual Strike",
      "id": "dual_strike",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Two-Weapon Wielder (Melee)",
        "Agility 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When armed with two melee weapons, the character may attack with both simultaneously as a Full Action. Make a single Weapon Skill Test. If the test is successful, the character hits the target with both weapons. As the character is swinging both weapons as a single attack, he may take an Aim Action before attacking to get a +10 or +20 bonus to the WS Test. The character does not suffer from the normal -20 WS penalty for wielding two weapons. If the attack hits, the target's armour gets applied as normal to both hits individually, but Toughness only counts once against the combined Damage rolls of both hits. A single successful Dodge or Parry Test from the target avoids both blows.",
      "source": "Deathwatch"
    },
    {
      "tier": 3,
      "name": "Duty Unto Death",
      "id": "duty_unto_death",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 45"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "The character's will or faith can sustain him when his flesh fails. He ignores the effects of injury, Fatigue, and Stunning during combat. This Talent does not prevent the Damage, but allows the character to temporarily ignore its effects for the duration of the combat. Death still affects him normally.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Ears to the Ground",
      "id": "ears_to_the_ground",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 1 Commerce",
        "Perception 30"
      ],
      "aptitudes": [
        "Perception",
        "Social"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character has learned how to make the appropriate discreet inquiries to get involved in such trades. He gains +20 to Commerce Tests when trading or bartering excess gear. Furthermore, the character has learned to avoid official attention from the Commissars and other disciplinary bodies, and gains +10 to Deceive Tests to avoid or deflect such notice about these dealings",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Electrical Succour",
      "id": "electrical_succour",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character can channel the sacred flow of energy from his Potentia Coil or other energy source to replenish his flesh. Whilst in contact with a functioning, powered machine or fully charged battery or power cell, the character may make an Ordinary (+10) Toughness Test. Success removes one level of Fatigue plus one additional level of Fatigue for each additional Degree of Success. This takes one minute of meditation and ritual incantation.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Electro Graft Use",
      "id": "electro_graft_use",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may use his Electro Graft to access data ports and commune with machine spirits. This grants a +10 bonus to Common Lore, Inquiry, or Tech-Use Tests whilst connected to a data port.",
      "source": "Deathwatch"
    },
    {
      "tier": null,
      "name": "Enemy",
      "id": "enemy",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "GM Permission"
      ],
      "aptitudes": null,
      "alignment": null,
      "benefit": "The player and GM chooses a specialisation that matches an organisation (A general one listed in Organisations, or a more specific one). He suffers an additional -10 penalty to Fellowship and Influence tests when dealing with this group, and the GM can use them to complicate his life from time to time. Unlike other talents, Enemy does not cost any xp to purchase and cannot be taken as an advance. Instead the GM and player can agree to award it when appropriate to the adventure or campaign. It can be removed with the approval of the GM, if the character has redeemed himself with the group in question. The Enemy talent can be awarded multiple times for the same group, in which case it should be listed as Enemy (X), with X equaling the number of times the talent has been awarded. This can be used to represent groups who particularly hate the Acolyte and want to see him dead. In game terms, the penalty to Fellowship tests increases to -10 times X.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Enhanced Bionic Frame",
      "id": "enhanced_bionic_frame",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Machinator Array"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character's already impressive bionic body structure is steadied by a gyro-array guided by a targeting system linked to the machine-spirit. The character gains the Auto-stabilised Trait",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Eternal Vigilance",
      "id": "eternal_vigilance",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 35",
        "Paranoia"
      ],
      "aptitudes": [
        "Perception",
        "Ballistic Skill"
      ],
      "alignment": "Unaligned",
      "benefit": "The character's is well aware that his vigil never ends, and remains ready to smite those who stray from the Emperor's light at all times. Once per game session, an character with this Talent may nominate another single character within line of sight as the target of his vigil. He may only have one such character targeted this way at a time. Once per Encounter, he may make a Standard Attack Action against the target of his vigil as a Reaction. He gains the benefits of a Full Action Aim Action for this attack",
      "source": "The Navis Primer"
    },
    {
      "tier": 1,
      "name": "Excellent Cook",
      "id": "excellent_cook",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Trade (Cook)"
      ],
      "aptitudes": [
        "General",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per game session, this character may make a Challenging (+0) Trade (Cook) Test. This Action requires at least several minutes. At the Game Master's discretion, the character might gain a bonus to this Test for acquiring certain ingredients to truly enhance the meal. If he succeeds, all members of the Squad gain a +5 bonus to Willpower Tests to resist the effects of Fear and Pinning until the end of the next encounter. If the cook succeeds by five or more Degrees of Success, the first time each member of the Squad uses a Fate Point before the end of the next encounter, that character rolls 1d10. On a result of 10, that character still gains the benefit of using the Fate Point, but the Fate Point does not count as having been expended.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Exceptional Reputation",
      "id": "exceptional_reputation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Peer or Good Reputation"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Once per game session, the character may automatically succeed on any one Interaction Skill Test in the minimum time possible, provided the Skill Test involves any group for which the character possesses a Peer or Good Reputation Talent. Should degrees of success be a factor, then the character is considered to have rolled a 01 on this test.",
      "source": "Ascension"
    },
    {
      "tier": 1,
      "name": "Excessive Wealth",
      "id": "excessive_wealth",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Influence 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "The character gains a +10 bonus to his Infamy/Influence whenever he makes an Acquisition Test representing his increased ability to buy goods.",
      "source": null
    },
    {
      "tier": 2,
      "name": "Exemplar of Honour",
      "id": "exemplar_of_honour",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Adeptus Astartes"
      ],
      "aptitudes": [
        "Fellowship",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may spend a Fate Point as a Free Action to regain Cohesion equal to his Fellowship Bonus. He may do this once per Round.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Exotic Weapon Training",
      "id": "exotic_weapon_training",
      "specialist": true,
      "specialisations": [
        "Any specific Exotic Weapon"
      ],
      "prerequisites": null,
      "aptitudes": [
        "Intelligence",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "Gain proficiency with one exotic weapon type. Unlike other kinds of weapons training, this talent applies only to a single weapon type and not a class of weapons. Note that an Exotic weapon with the Heavy class would also require the Weapon Training (Heavy) talent as well as Exotic Weapon Training in that specific weapon.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Eye of Vengeance",
      "id": "eye_of_vengeance",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 50"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Tzeentch",
      "benefit": "Before making a ranged Standard Attack action, he can spend a Fate point. If he does so, he adds the number of degrees of success scored on the attack test to both his damage and penetration for the hit",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Fabricated Flesh",
      "id": "fabricated_flesh",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Fellowship",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character bears few of the usual marks of being a member of the Machine Cult, hiding their cyber-mantle beneath false flesh or even vat-grown skin, and their cybernetics appear to be part of their body, or those found commonly enough throughout the Imperium. It takes a Hard (-20)Scrutiny or Tech-Use test to notice any significantly off-putting signs of the character's mechanical nature. Mechadendrites and other large obviously mechanical components can be removed and reattached by the character in a ritual that takes 1d5 hours and causes 1 level of Fatigue, suffering no additional side effects. While their components are not distractingly obvious, the character gains +5 to all Fellowship-based tests with common Imperial citizens outside the Adeptus Mechanicus.",
      "source": "The Lathe Worlds"
    },
    {
      "tier": 2,
      "name": "Face in a Crowd",
      "id": "face_in_a_crowd",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35",
        "Clues from the Crowds"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "When employing the Shadowing special use of the Stealth skill, he can use his Fellowship characteristic instead of his Agility.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Faith Healing",
      "id": "faith_healing",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 1 Medicae",
        "Pure Faith"
      ],
      "aptitudes": [
        "Willpower",
        "Knowledge"
      ],
      "alignment": "Imperial",
      "benefit": "This character's holy fervour is such that it inspires confidence and trust from all of his allies. Even in the direst times, he stands as a beacon of the Emperor's light. Whenever this character successfully removes Damage from an ally with the Medicae Skill, that ally gains a +5 bonus to the next Test he makes before the end of the encounter for each point of Damage removed this way (to a maximum of +30).",
      "source": "Faith and Coin"
    },
    {
      "tier": 3,
      "name": "Favoured by the Warp",
      "id": "favoured_by_the_warp",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 35"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Tzeentch",
      "benefit": "Whenever this character rolls on Table Psychic Phenomena, so long as he does not receive the Perils of the Warp result, he may roll a second time and choose which result he receives.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Favoured of the Emperor",
      "id": "favoured_of_the_emperor",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Pure Faith"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Imperial",
      "benefit": "The character's faith is an actual shield against the denizens of the warp and the twisting influence of the anathema of man. Such is the potency of this protection that creatures with the Daemonic trait must pass a Challenging (+0) Willpower Test each Round to make melee attacks against the character. In addition, once per game session, the character can ignore a single increase to his Corruption Points regardless of its size or source. ",
      "source": null
    },
    {
      "tier": 3,
      "name": "Fearful Reputation",
      "id": "fearful_reputation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Good Reputation (Underworld)",
        "Rank 3 Intimidate"
      ],
      "aptitudes": [
        "Strength",
        "Social"
      ],
      "alignment": "Khorne",
      "benefit": "this advance grants the characters the Fear 1 Trait",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 3,
      "name": "Fearless",
      "id": "fearless",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Nerves of Steel"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "The character is immune to the effects of Fear and Pinning, but disengaging from combat or backing down from a fight is difficult for them to stomach, and as such requires a successful Willpower Test.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Feat of Strength",
      "id": "feat_of_strength",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 45",
        "Bulging Biceps"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Nurgle",
      "benefit": "This character may spend a Fate Point to gain the Unnatural Strength (X) Trait or increase his Unnatural Strength Trait by X until the end of his Turn, where X is a number up to his Strength Bonus. At the end of his Turn, he gains a number of levels of Fatigue equal to the amount he chose for X.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Feedback Screech",
      "id": "feedback_screech",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Offence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character can scramble his vox synthesizers, causing a hideous blast of noise that shocks and distracts others. All unprotected creatures within a 30-meter radius who have the ability to hear must make a Willpower Test or lose a Half Action on their next turn as they involuntarily react to the cacophonous shriek.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Ferric Summons",
      "id": "ferric_summons",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ferric Lure Implants",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Willpower",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "He can summon to his hand an unsecured metal object weighing up to 2 kilograms per point of his Willpower bonus, and can summon such objects up to 40 metres distant.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Field Vivisection",
      "id": "field_vivisection",
      "specialist": true,
      "specialisations": [
        "Ballistic Skill",
        "Weapon Skill"
      ],
      "prerequisites": [
        "Ballistic Skill 40 or Weapon Skill 40",
        "Rank 1 Forbidden Lore (Xenos - Any)",
        "Rank 2 Medicae"
      ],
      "aptitudes": [
        "Ballistic Skill/Weapon Skill",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "Each time this talent is taken, the character selects the Specialisation that matches the Characteristic and Aptitude pair (Ballistic Skill or Weapon Skill) used in purchase. When using the Called Shot action with a melee or ranged attack (depending on the Specialisation) against a target for which the character has the appropriate Forbidden Lore (Xenos) skill, he makes a Medicae (WS) or Medicae (BS) test in place of the normal Weapon Skill or Ballistic Skill test.",
      "source": "Enemies Without"
    },
    {
      "tier": 3,
      "name": "Final Judgement",
      "id": "final_judgement",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 45",
        "Air of Authority",
        "Deadeye Shot"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "Once per Combat Encounter after killing a target with a Ranged Attack, this character may spend a Fate Point and make a Challenging (+0) Command Test. If he succeeds, each of his allies within 10 metres gains a bonus equal to 5 times his Degrees of Success to the next Ballistic Skill or Weapon Skill Test he makes before the end of the encounter and each of his foes within 10 metres suffers a penalty equal to 5 times his Degrees of Success to the next Ballistic Skill or Weapon Skill Test he makes before the end of the encounter.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Firebrand's Call",
      "id": "firebrand_s_call",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Inspire Wrath",
        "Purity of Hatred"
      ],
      "aptitudes": [
        "Fellowship",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "Whenever this character inflicts Righteous Fury upon a foe, he may spend a Fate Point and make a Challenging (+0) Fellowship Test. If he succeeds, allies within 30 metres inflict additional Damage equal to his Fellowship Bonus when attacking that foe until the beginning of the character's next Turn.",
      "source": "Faith and Coin"
    },
    {
      "tier": 1,
      "name": "Flagellant",
      "id": "flagellant",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 30"
      ],
      "aptitudes": [
        "Offence",
        "Toughness"
      ],
      "alignment": "Imperial",
      "benefit": "As a Full Action, the character can inflict some suitable punishment on his own body, suffering 1d5-2 levels of Fatigue (to a minimum of 1). He then gains a +10 bonus on Willpower tests to resist Fear, Pinning, psychic powers, or suffering Corruption, for one hour or until the end of the current encounter. If the character also possesses the Frenzy talent, he can enter a Frenzied state as a Free Action while under the effects of this talent.",
      "source": "Enemies Within"
    },
    {
      "tier": 3,
      "name": "Flash of Insight",
      "id": "flash_of_insight",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 40",
        "Contact Network",
        "Coordinated Interrogation"
      ],
      "aptitudes": [
        "Perception",
        "Knowledge"
      ],
      "alignment": "Slaanesh",
      "benefit": "When stuck in an investigation, he can spend one Fate point to reveal a single clue or lead to aid in the progression of his efforts.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Foresight",
      "id": "foresight",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 30"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "By spending ten minutes studying or analysing a problem, the character gains a +10 bonus to his next Intelligence Test or a Skill Test based on Intelligence.",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Forging the Bond",
      "id": "forging_the_bond",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Adeptus Astartes",
        "Deathwatch"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "The Space Marine is gifted at adapting to the fighting styles and traditions of other Chapters, and while serving in the Deathwatch has forged strong bonds of brotherhood with his Kill-team. \n\n* At Rank 1-3, the Space Marine may benefit from the Squad Mode abilities specific to any other Chapter. When members of the Kill-team activate a Chapter-specific Squad Mode ability, the activating character can choose to allow any Space Marines from a different Chapter possessing this Talent to benefit from the ability as well. If he chooses to do so, activating the Squad Mode ability costs an additional 3 Cohesion (total, not per character). \n\n* At Rank 4-5, the Talent functions as above, but the cost is reduced to 2 additional Cohesion. \n\n* At Rank 6-8, the Talent functions as above, but the cost is reduced to 1 additional Cohesion.",
      "source": "Rites of Battle"
    },
    {
      "tier": 1,
      "name": "Frenzy",
      "id": "frenzy",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "If he spends one full round fueling his anger—by flagellation, drugs, or other means—on the next round, he goes into an uncontrolled rage, gaining a +10 bonus to Weapon Skill, Strength, Toughness, and Willpower, but suffering a -20 penalty to Ballistic Skill, Intelligence, and Fellowship. Note that characteristic penalties are different from characteristic damage , and cannot reduce a characteristic below 1. While Frenzied, the character must attack the nearest enemy in melee combat if possible. If he is not engaged with the nearest enemy, he must move towards that enemy and engage it if possible. He will not take obviously suicidal actions such as leaping off a building in order to engage someone on the ground, but he will take any actions that offer a reasonable opportunity to engage in melee with the nearest enemy. While Frenzied, he is immune to Fear, Pinning, Stunning effects, and the effects of Fatigue; he cannot Parry, retreat, or flee. He remains Frenzied for the duration of the combat, and cannot use psychic powers while Frenzied. After combat ends, or if there are no more eligible enemy targets for the character to attack, he can make a Willpower test to snap out of his Frenzy. If he fails, he must continue to attack, favouring NPCs over PCs. Each successive round, however, he can make another Willpower test, with a cumulative +10 bonus to return to a stable state of mind and come out of Frenzy. After Frenzying, he cannot Frenzy again for at least an hour, as he recovers his mental and physical strength.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Giantkiller",
      "id": "giantkiller",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 50",
        "The Bigger They Are"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Tzeentch",
      "benefit": "When firing at a target with a Size Trait with a value greater than his own, this character adds the difference in the values of their Size Traits to the Damage of the attack.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Good Reputation",
      "id": "good_reputation",
      "specialist": true,
      "specialisations": [
        "Any Organisation"
      ],
      "prerequisites": [
        "Fellowship 50",
        "Peer",
        "GM Permission"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "The character is well respected within a social group or organisation. The player/GM chooses a specialisation that matches an organisation (A general one listed in Organisations, or a more specific one). The character gains an additional +10 bonus to Fellowship Tests when dealing with this group. This Talent is cumulative with Peer, for a total of a +20 bonus. This bonus also applies to Influence Tests when dealing with this particular group. The GM and player may agree to award this Talent when appropriate to the adventure or campaign",
      "source": "Deathwatch"
    },
    {
      "tier": 3,
      "name": "Greater Minion",
      "id": "greater_minion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 55",
        "Influence 50"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "Though various means the character has acquired a Greater Minion. Such a Minion may almost be as powerful as the character themselves. This talent may be taken more than once, each time adding another Greater Minion to the character's retinue",
      "source": "Black Crusade"
    },
    {
      "tier": 1,
      "name": "Grenadier",
      "id": "grenadier",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 35"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character misses with a thrown weapon or weapon with the Blast quality, he may reduce the distance it scatters by a number of metres up to half his BS bonus.",
      "source": "Enemies Without"
    },
    {
      "tier": 2,
      "name": "Gun Blessing",
      "id": "gun_blessing",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ferric Lure Implants",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Utilising his sacred ability to subtly affect ferrous materials, the character may un-jam a number of weapons equal to his Intelligence Bonus, so long as they are within a 10-meter radius. A successful Intelligence Test indicates the character has appeased the spirits of the weapons. This blessing requires a Full Action.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Gun It",
      "id": "gun_it",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 1 Operate (Any)",
        "Technical Knock"
      ],
      "aptitudes": [
        "Agility",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per Round as part of a Vehicle Movement Action, the character may choose to add a +10 bonus to the associated Test. However, if he fails the Test, his vehicle loses 1 point of Structural Integrity (ignoring Armour) per Degree of Failure",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Halo of Command",
      "id": "halo_of_command",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 40",
        "Willpower 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "When targeting friendly NPCs through skills that have either the Social or Leadership Aptitudes (such as Charm, Command, and Intimidate), he can affect those within 100 times his Fellowship bonus in metres rather than 10 times that number.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Hammer Blow",
      "id": "hammer_blow",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Crushing Blow"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When he uses an All Out Attack action to make a single melee attack, he can add half his Strength bonus (rounded up) to the weapon's penetration. The attack also counts as having the Concussive (2) weapon quality, to represent the shocking force of the blow's impact",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Hard Bargain",
      "id": "hard_bargain",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Profit Factor"
      ],
      "aptitudes": [
        "Fellowship",
        "Intelligence"
      ],
      "alignment": "Slaanesh",
      "benefit": "Whenever Profit Factor is awarded for completing an Endeavour, you gain a bonus of +1 Profit Factor to the group's total.",
      "source": "Rogue Trader"
    },
    {
      "tier": 2,
      "name": "Hard Target",
      "id": "hard_target",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 40"
      ],
      "aptitudes": [
        "Agility",
        "Defence"
      ],
      "alignment": "Slaanesh",
      "benefit": "When he performs a Charge or Run action, opponents suffer a -20 penalty to Ballistic Skill tests made to hit him with ranged attacks. This penalty continues until the start of his next turn.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Hardened Soul",
      "id": "hardened_soul",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 35",
        "10 Corruption"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever the character would gain Corruption points, he may reduce the amount gained by half (rounded up) and gain Insanity points equal to the amount reduced",
      "source": "Enemies Beyond"
    },
    {
      "tier": 2,
      "name": "Hardy",
      "id": "hardy",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40"
      ],
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "When undergoing medical treatment or healing from injuries, he always recovers damage as if Lightly Damaged, regardless of the level of damage he sustained.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Hatred",
      "id": "hatred",
      "specialist": true,
      "specialisations": [
        "Chaos Space Marines",
        "Daemons",
        "Mutants",
        "Psykers",
        "Any specific Xenos",
        "Any Organisation"
      ],
      "prerequisites": null,
      "aptitudes": [
        "Weapon Skill",
        "Social"
      ],
      "alignment": "Khorne",
      "benefit": "When fighting opponents of that group in close combat, the Acolyte gains a +10 bonus to all Weapon Skill tests made against them. He also finds it difficult to back down from a fight with his hated foe, and must make a Challenging (+0) Willpower test to retreat or surrender when fighting them, unless suicidally outnumbered or outclassed",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Heightened Senses",
      "id": "heightened_senses",
      "specialist": true,
      "specialisations": [
        "Sight",
        "Hearing",
        "Taste",
        "Touch",
        "Smell"
      ],
      "prerequisites": null,
      "aptitudes": [
        "Perception",
        "Fieldcraft"
      ],
      "alignment": "Tzeentch",
      "benefit": "When the character gains this Talent, select one of the five senses: The character gains a +10 bonus to any Tests specifically involving this sense. Thus, Heightened Senses (Sight) would apply to an Awareness Test to see a distant flock of Shale Crows, but not to a Ballistic Skill Test or a Weapon Skill Test because the character is not just using their eyes. This Talent may be taken more than once, each time with a different specialisation.",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Heroic Inspiration",
      "id": "heroic_inspiration",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35",
        "Command"
      ],
      "aptitudes": [
        "Leadership",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Once per Turn, this character can use the Inspire Special Use of the Command Skill as a Half Action instead of a Full Action.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Hip Shooting",
      "id": "hip_shooting",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40",
        "Agility 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "As a Full Action, he can both move up to his Full Move rate and make a single attack with a ranged weapon. This attack can only be a single shot, and so cannot be a semi- or full-automatic ranged attack for example. Characters with the Two-Weapon Fighting talent can use this talent with Hip Shooting to make two single shots, if they are armed with a ranged weapon in each hand.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Horde Minion",
      "id": "horde_minion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 45",
        "Influence 50"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has attracted a large gathering of followers, subordinates, or hangers-on, and gains a Horde Minion. See Minions for more information.",
      "source": "Tome of Excess"
    },
    {
      "tier": 2,
      "name": "Hotshot Pilot",
      "id": "hotshot_pilot",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Survival or Rank 2 Operate (any)",
        "Agility 35"
      ],
      "aptitudes": [
        "Agility",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "When the Acolyte succeeds on an Operate test (or Survival test in the case of a living steed), he may voluntarily suffer 1 level of Fatigue to add a number of degrees of success equal to half of his Agility bonus. When the Acolyte fails an Operate test (or Survival test in the case of a living steed), he may voluntarily suffer 1 level of Fatigue in order to reduce the degrees of failure by an amount equal to his Agility bonus, to a minimum of 1.",
      "source": "Enemies Without"
    },
    {
      "tier": 3,
      "name": "Hull Down",
      "id": "hull_down",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 in Survival or Rank 2 in Operate (any)"
      ],
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character takes a vehicle combat action with the Movement subtype, his vehicle or steed counts the value of its Size trait as being one lower for purposes of attack modifiers and the benefits of cover until the start of his next turn.",
      "source": "Enemies Without"
    },
    {
      "tier": 2,
      "name": "Hunter of Aliens",
      "id": "hunter_of_aliens",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Must not possess the 'Scourge of Heretics' or 'Slayer of Daemons' Talents"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Social"
      ],
      "alignment": "Khorne",
      "benefit": "The character gains +10 to his Weapon Skill and +2 to melee weapon Damage when combating aliens.",
      "source": "Deathwatch"
    },
    {
      "tier": 3,
      "name": "Icon of Duty",
      "id": "icon_of_duty",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Space Marine Chaplain or Adeptus Ministorum Background"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Imperial",
      "benefit": "At any point during a game session a Chaplain may spend a Fate Point to gain one of the following effects on himself and all characters within Support Range of him. \n\n* __Hardened Will:__ The Chaplain and his allies steel themselves against mental and spiritual assault gaining a +10 to all Willpower Tests. \n\n* __Fearsome Assault:__ While this ability is active, the Chaplain and all characters in his Kill-team gain the Fear (1) Trait. If the Chaplain or any of the characters already possess the Fear Trait, it is instead increased by one level to a maximum of 3. \n\n* __Extreme Prejudice:__ The Chaplain whips his fellow Battle- Brothers into rage against a single type of foe. The Chaplain and any characters of his Kill-team in support range may re-roll a failed Weapon Skill Test against a foe during a charge. To gain this bonus, the Chaplain must possess a Hatred Talent against this enemy. \n\nAll of these benefits last for the duration of single encounter once activated and only one effect may be active at any one time; should the Chaplain use a different ability it will immediately end the effects of the previous one.",
      "source": "Rites of Battle"
    },
    {
      "tier": 3,
      "name": "Imperial Authority",
      "id": "imperial_authority",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Adeptus Arbites Background",
        "Influence 50"
      ],
      "aptitudes": [
        "Willpower",
        "Leadership"
      ],
      "alignment": "Imperial",
      "benefit": "A Judge can issue orders that Imperial citizens are conditioned to obey. If this takes place during combat, it counts as a free action that a Judge may perform once per turn. When the Judge issues this order, a number of targets equal to his Willpower Bonus must make an Easy (+30) Willpower Test or obey the order. The targets must be Imperial citizens, must be able to hear and understand the order, and the order must be simple (able to be accomplished during a single round). Some possible orders are “halt,” “get into cover,” or “stop that man!” In addition, the Judge must be carrying something to identify himself as Arbites (this could be a badge, power maul with an Arbites logo, etc.). The GM may determine that certain targets (such as long-time cultists or hardened recidivist criminals) are immune from this ability. If the Judge is wearing a full set of Arbites Judge's regalia (Arbites carapace armour and Arbites badge) and the target can see the Judge issuing the order (this can include a pict-caster screen!), the test becomes Challenging (+0) instead. If the Judge has the Air of Authority Talent, he can affect a number of targets equal to 10x his Willpower Bonus instead.",
      "source": "Ascension"
    },
    {
      "tier": 3,
      "name": "Imperial Commander",
      "id": "imperial_commander",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 45",
        "Willpower 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "The character never suffers penalties due to unfamiliarity or outsider status to Interaction Tests with soldiers serving in the Imperial Guard. This includes all auxiliary forces sworn to the Imperial Guard from the Adeptus Mechanicus, Adeptus Ministorum, and elsewhere. When commanding a combined force of multiple different elements (such as Guardsmen and Ogryns, or the Crimson Guard and a Ministorum detachment), the character gains a +20 bonus to any Command Tests to maintain order in the ranks.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Independent Targeting",
      "id": "independent_targeting",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When firing two weapons as part of a single action (using the Two Weapon Fighting talent, for example), the character does not need his targets to be within 10 metres of each other.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Inescapable Attack",
      "id": "inescapable_attack",
      "specialist": true,
      "specialisations": [
        "Melee",
        "Ranged"
      ],
      "prerequisites": [
        "Ballistic Skill 40 or Weapon Skill 40",
        "Perception 35"
      ],
      "aptitudes": [
        "Weapon Skill/Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Khorne",
      "benefit": "This talent applies to Melee or Ranged attacks, depending on the Speciality chosen. After making a successful attack test of the appropriate type as part of an All Out Attack, Called Shot, Charge, Standard Attack, or Stun action, the character imposes a penalty on all evasion attempts (Dodge or Parry tests) made against this attack equal to 10 times the total degrees of success scored on the attack test.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Infused Knowledge",
      "id": "infused_knowledge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 40",
        "Lore (any one)"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "He counts as having all Common Lore and Scholastic Lore skills at rank 1 (Known). Essentially, he knows something about everything. If he wishes to later improve his Lore skills, these advances must be bought using experience points (from rank 1) as normal. He also adds one degree of success to any successful Common or Scholastic Lore tests, due to his ingrained training",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Initiated Maintenance",
      "id": "initiated_maintenance",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Common Lore (Adeptus Mechanicus)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Weapons this character wields only Jam on a result of 100, and weapons with the Overheat Quality that he wields only Overheat on a result of 96-100.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Inspire Wrath",
      "id": "inspire_wrath",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Air of Authority"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "As a Full Action, the character can make a Charm Test to grant the effects of the Hatred Talent to their Squad, or any people in their immediate vicinity. Success on the Test grants the Hatred Talent to the listeners (with the object of hate chosen by the character) for the duration of an encounter. Listeners can resist the effects of the character's speech (and therefore not be burdened with his chosen hatred) by passing an Opposed Willpower Test against the character's Charm Skill Test. Inspire Wrath affects a number of people up to 10 times the character's Fellowship, which can be increased with the use of the talent as normal. Both players and GMs should bear in mind, however, that once a crowd has been inspired to hatred or mindless anger, the effects can be unpredictable and are seldom exactly as the character intends. In a Social Conflict this character gives all other Heretics on the same side an additional 10 Infamy into their reserves for this encounter only.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Inspired Intuition",
      "id": "inspired_intuition",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 50"
      ],
      "aptitudes": [
        "Perception",
        "Social"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character may spend a Fate point to gain exceptional insight into his immediate status. This is represented by the player asking the GM a question about the current situation the character faces, which the GM should answer as helpfully as possible.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Inspiring Aura",
      "id": "inspiring_aura",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Halo of Command"
      ],
      "aptitudes": [
        "Willpower",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "The character can affect allies of any kind—not only subordinates—with the Terrify special use for the Command skill. This need not represent threats and intimidation, but might represent inspiring words, encouragement, or sheer steadfastness in the face of terrifying foes.",
      "source": "Enemies Beyond"
    },
    {
      "tier": 3,
      "name": "Instrument of His Will",
      "id": "instrument_of_his_will",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 50"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Imperial",
      "benefit": "After making a successful attack against a Daemon (this can include striking it with a psychic power), the character may spend a Fate point to increase the damage of the first hit he inflicts as part of that attack by an amount equal to twice his Willpower bonus. This additional damage ignores armour and Toughness bonus.",
      "source": "Enemies Beyond"
    },
    {
      "tier": 2,
      "name": "Integrated Weapon Expertise",
      "id": "integrated_weapon_expertise",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40",
        "Implanted Potentia or Mechanicus Implants"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character succeeds on a Ballistic Skill Test with an Integrated Weapon he may choose to gain 1 Level of Fatigue. If he does so, he scores an additional two Degrees of Success on that Test.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Integrated Weapon Mastery",
      "id": "integrated_weapon_mastery",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40",
        "Willpower 40",
        "Implanted Potentia or Mechanicus Implants",
        "Integrated Weapon Expertise"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "As a Free Action, the character may choose to gain a number of Levels of Fatigue up his Toughness Bonus. For each level of Fatigue the character gains in this way, he increases the Damage and Penetration of each of his integrate weapons by 1 for a number of Rounds equal to his Willpower Bonus",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Into the Breach",
      "id": "into_the_breach",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Iron Discipline",
        "Fellowship 50"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "Followers (Minions, Comrades, etc.) become immune to the effects of Fear and Pinning as long as they are within 10 metres of the character. Players cannot benefit from this talent. While the character is known to be on board a ship in which he serves, the ship has a +5 bonus to its Morale.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Iron Discipline",
      "id": "iron_discipline",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 30"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "If the character is visible to his followers, either in person or via vox- or pict-caster, they may reroll failed Willpower Tests made to resist Fear and Pinning. If the Player Character fails a Fear or Pinning Test, any Comrades only fail if the roll was a double. Players cannot benefit from this talent unless the character with this Talent is the official group leader If the character is leading a boarding action, he gains a +10 bonus to his Command Tests.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Iron Faith",
      "id": "iron_faith",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Iron Resolve"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "The character is immune to the effects of the Baneful Presence trait.",
      "source": "Enemies Beyond"
    },
    {
      "tier": 1,
      "name": "Iron Jaw",
      "id": "iron_jaw",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40"
      ],
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "Whenever this character becomes Stunned, he may make a Challenging (+0) Toughness test as a Free Action to ignore the effects.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Iron Resolve",
      "id": "iron_resolve",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Resistance (Fear)",
        "Jaded"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "After failing a Fear or Pinning test, the character can re-roll the test with a -10 modifier.",
      "source": "Enemies Beyond"
    },
    {
      "tier": 1,
      "name": "It Not So Dark",
      "id": "it_not_so_dark",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ogryn",
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "The character no longer suffers a penalty to act in confined spaces from the “But It Dark in Dere!” Trait. In addition, the Ogryn may make a Hard (-20) Willpower Test to enter a confined space of his own accord if his duties demand it. If he fails, he must still be ordered into such a space as normal.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Jaded",
      "id": "jaded",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "Mundane events, from death's horrific visage to xenos abominations, do not force him to gain Insanity points or make Fear tests. Daemons, Warp manifestations, and other unnatural effects still affect him normally.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Judge's Quarry",
      "id": "judge_s_quarry",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Adeptus Arbites Background",
        "Rank 2 Intimidate or Rank 2 Interrogate"
      ],
      "aptitudes": [
        "Willpower",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "The character selects one of the options below.\n\n* __Hammer of Heretics:__ Many judges specialise against a particular menace, learning everything they can about their adversaries so that they might be more adept at bringing it to justice. Heretics are a common foe who represent a constant threat to law and order. The Judge gains a bonus of +20 when making Intimidate or Interrogate Skill Tests against heretics.\n\n* __Master of Mutants:__  Mutants form a large proportion of the population of many Imperial worlds, where they are used as cheap and plentiful labour. As any Judge will tell you, however, mutants are nothing but trouble. The Judge gains a bonus of +20 when making Intimidate or Interrogate Skill Tests against mutants. ",
      "source": "Ascension"
    },
    {
      "tier": 1,
      "name": "Keen Intuition",
      "id": "keen_intuition",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35"
      ],
      "aptitudes": [
        "Perception",
        "Social"
      ],
      "alignment": "Tzeentch",
      "benefit": "After failing an Awareness skill test, the character can re-roll the test with a -10 modifier.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Killer's Eye",
      "id": "killer_s_eye",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 35",
        "Precision Killer"
      ],
      "aptitudes": [
        "Perception",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "The character can find the weaknesses of his prey with only a few moments of observation. When he makes a Called Shot attack and scores a number of Degrees of Success on the attack roll equal to or greater than the target's Agility Bonus, he immediately inflicts Righteous Fury on the target. This does not count as triggering Righteous Fury for any other effects",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 2,
      "name": "Killing Strike",
      "id": "killing_strike",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 50"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "At the beginning of each of his turns, the character may spend a Fate point to make his melee attacks unavoidable with the Dodge and Parry skills until the end of the round. Other means of avoiding or stopping attacks (such as displacer fields or alien protective devices) are unaffected.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Knowledge Is Power",
      "id": "knowledge_is_power",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 50"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character's mind is an incredible thing, always working, always in motion, as it considers countless possibilities and outcomes. Once per session, they may automatically pass an Intelligence Test or a Skill Test based on Intelligence. This automatic pass is only considered a standard success and does not grant any additional degrees of success.",
      "source": "Ascension"
    },
    {
      "tier": 2,
      "name": "Las Weapon Expertise",
      "id": "las_weapon_expertise",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 35",
        "Weapon Training (Las)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character attacks with a las weapon (such as a lasgun, lascarbine, laspistol, or lascannon), he imposes a -5 penalty on Dodge Tests to avoid the attack for every Degree of Success he scores beyond the first (to a maximum of -30)",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Las Weapon Mastery",
      "id": "las_weapon_mastery",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 45",
        "Las Weapon Expertise"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character makes an attack with a las weapon (such as a lasgun, lascarbine, laspistol, or lascannon), he deals +1 additional Damage for every two Degrees of Success he scores on the Ballistic Skill Test beyond the first",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Lasgun Barrage",
      "id": "lasgun_barrage",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Training (Las)",
        "Ballistic Skill 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When firing any class of Las weapon on full or semi-auto, the character may score one additional Degree of Success (provided the Test is successful) if he does not take a Move Action in his Turn.",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Lasgun Volley",
      "id": "lasgun_volley",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 30",
        "Weapon Training (Las)",
        "Comrade"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "For each Comrade who is part of any Ranged Volley Order this character issues, this character deals +1 additional Damage (to a maximum of +3 Damage) with any attack he makes with a las weapon (such as a lasgun, lascarbine, laspistol, or lascannon) for that Round in addition to the normal benefit.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Last Man Standing",
      "id": "last_man_standing",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Nerves of Steel"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "The character is immune to Pinning by pistols and Basic Weapons, and he adds +1 AP to the value of any cover protecting him from ranged attacks.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Leap Up",
      "id": "leap_up",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 30"
      ],
      "aptitudes": [
        "Agility",
        "General"
      ],
      "alignment": "Slaanesh",
      "benefit": "Stand as a Free Action.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Leaping Dodge",
      "id": "leaping_dodge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 35",
        "Rank 2 Dodge"
      ],
      "aptitudes": [
        "Agility",
        "Defence"
      ],
      "alignment": "Slaanesh",
      "benefit": "When he would make an Agility test to avoid attacks from weapons with the Spray quality, he may make the test using his Dodge (Ag) skill instead",
      "source": "Enemies Without"
    },
    {
      "tier": 3,
      "name": "Legendary",
      "id": "legendary",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Influence 70 or Profit Factor 70 or Logistics 70",
        "GM Permission"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "Any successful Influence Tests the character makes using Profit Factor automatically gain an additional two 'bonus' degrees of success. In a Social Challenge, any successful Interaction Skill Tests made by the character automatically gain an additional two 'bonus' degrees of success. In Combat, the character counts as having the Fear (1) Trait.",
      "source": "Into the Storm"
    },
    {
      "tier": 1,
      "name": "Lesser Minion",
      "id": "lesser_minion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "Though various means the character has acquired a Lesser Minion. Such a Minion is considerably less powerful than the character, though useful nevertheless. This Talent may be taken more than once, each time adding another Lesser Minion to the character's retinue.",
      "source": "Black Crusade"
    },
    {
      "tier": 2,
      "name": "Lexographer",
      "id": "lexographer",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 3 in Linguistics (any)"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character can attempt any Linguistics skill in which he is not trained as an untrained skill test as if it were not a Specialist skill. In a Social Conflict the character gains +20 to all Opposed Tests when going against an opponent who is speaking in a different language.",
      "source": "Enemies Without"
    },
    {
      "tier": 1,
      "name": "Light Sleeper",
      "id": "light_sleeper",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 30"
      ],
      "aptitudes": [
        "Perception",
        "Fieldcraft"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character is always assumed to be awake, even when asleep, for the purposes of Awareness Tests or surprise. Unfortunately, the character's sleep is not deep and can be frequently interrupted, resulting in a less-than-cheery disposition when awake.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Lightning Attack",
      "id": "lightning_attack",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Swift Attack"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Khorne",
      "benefit": "He can make the Lightning Attack action.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Lightning Charge",
      "id": "lightning_charge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Swift Attack",
        "Preternatural Speed"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Slaanesh",
      "benefit": "The character may use the Swift Attack Talent (or Lightning Attack Talent, if they also possess it) during a Charge.",
      "source": "Ascension"
    },
    {
      "tier": 1,
      "name": "Lightning Reflexes",
      "id": "lightning_reflexes",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Slaanesh",
      "benefit": "When making an Initiative roll, the character may roll twice and add the higher of the two dice results to his Agility Bonus.",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Litany of Condemnation",
      "id": "litany_of_condemnation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40",
        "Rank 2 Scholastic Lore (Imperial Creed)"
      ],
      "aptitudes": [
        "Willpower",
        "Social"
      ],
      "alignment": "Imperial",
      "benefit": "This character scores an additional three Degrees of Success whenever he succeeds on a Command Test to use the Terrify Special Use of the Command Skill to counteract the presence of Daemons, mutants, and the unnatural effects of the Warp.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Little 'Un",
      "id": "little_un",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 30",
        "Non-Ogryn"
      ],
      "aptitudes": [
        "Fellowship",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "This character scores an additional two Degrees of Success whenever he succeeds on a Fellowship-based Test directed at an Ogryn. Furthermore, he is able to inspire a fierce loyalty in the large abhumans, who may re-rolled any failed Tests to resist coercion or other inducement to betray or turn against him.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Lock On",
      "id": "lock_on",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 40",
        "Vigilant"
      ],
      "aptitudes": [
        "Perception",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may make Dodge Reactions while maintaining an Aim Action or Overwatch Action without losing the benefits of the Action",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Logis Implant",
      "id": "logis_implant",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Offence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character's logis processors work with preternatural speed, filtering sensory input and allowing the character to analyse and anticipate the actions of those around him. By using the character's Reaction for the Round, the character may make a Tech-Use Test to make use of this Talent. The character gains a +10 bonus to all Weapon Skill and Ballistic Skill Tests until the end of his next turn. The character must pass a Toughness Test when he uses this Talent or gain a level of Fatigue.",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Loyal Demeanour",
      "id": "loyal_demeanour",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ogryn"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "This character never suffers penalties to Fellowship Tests for not being taken seriously or due to being an Ogryn, and may re-roll one failed Charm Test per game session.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Luminen Blast",
      "id": "luminen_blast",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Luminen Shock",
        "Luminen Capacitors",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character always counts as being equipped with a Pistol weapon with a 10m range. This can only be used in single shot mode, and deals 1d10 plus twice his Willpower bonus in Energy damage, with Pen 0 and the Shocking quality. The character always counts as having Weapon Training for this weapon and after making an attack with it, he must pass a Toughness test or suffer 1 level of Fatigue.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Luminen Desecration",
      "id": "luminen_desecration",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Luminen Capacitors",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "A successful Challenging (+0) Ballistic Skill Test allows him to direct the energy against a single target within 10 metres. This is a ranged attack and can be Dodged but not blocked by Fields or other protective devices. If the target is carrying any electrical devices—including energy weapons and bionic systems—then they cease to operate for 1d5 rounds, as if their power had run out. If the target is a vehicle, then it immediately suffers a Critical Hit as if the user had scored Righteous Fury, subtracting one to the Critical Hit result (a result of zero results in no Critical Hit). The character always counts as having Weapon Training for this weapon and after making an attack with it, he must pass a Toughness test or suffer 1 level of Fatigue.",
      "source": null
    },
    {
      "tier": 2,
      "name": "Luminen Shock",
      "id": "luminen_shock",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Luminen Capacitors",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character always counts as being equipped with a melee weapon that inflicts 1d10 plus his WPB in Energy damage, with Pen 0 and the Shocking quality. He always counts as having Weapon Training for it and after making this attack, he must pass a Toughness test or suffer 1 level of Fatigue.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Machinator Array",
      "id": "machinator_array",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has returned to the crèches of the Mechanicus so the Priesthood of Mars may bring him closer to the most holy of forms by adding an extensive machinator array to the character's existing augmetics. The character's Strength and Toughness Characteristics are increased by +10. Reduce the character's Agility and Fellowship by -5. The character's mass increases to three times that of a normal person, and the character may no longer stay afloat or swim in water or similar liquids. The character may mount a single pistol or close combat weapon on any Servo-Arm or Servo-Harness he possesses. The character must still have the proper Talent to use the mounted weapon.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Maglev Transcendence",
      "id": "maglev_transcendence",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Maglev Coils",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The Acolyte has learned how to better use his implanted maglev coils, and can hover for a number of minutes equal to 1d10 plus twice his Toughness bonus. He can move his Run speed when making a Half Move action and suffers no damage from falling if the coils are active. Each use drains half the power stored in the coils (therefore he can use the coils twice before recharging them)",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Marksman",
      "id": "marksman",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 35"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "Distance is no protection against the character's marksmanship, and he suffers no penalties for making Ballistic Skill tests at Long or Extreme range",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Master & Commander",
      "id": "master_commander",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35",
        "Fellowship 35"
      ],
      "aptitudes": [
        "Intelligence",
        "Fellowship"
      ],
      "alignment": "Unaligned",
      "benefit": "There can be only one commander of a vessel, and the character's guiding hand, stern judgment, and sage leadership have captained his crew through countless conflicts. By spending a Half Action in combat to direct the efforts of his allies, none of them suffer the penalties for ganging up until his next Turn. If defending against a boarding action, a Half Action directs the efforts of his armsmen, granting them a +10 bonus in combat",
      "source": "Rogue Trader"
    },
    {
      "tier": 3,
      "name": "Master Chirurgeon",
      "id": "master_chirurgeon",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 in Medicae skill"
      ],
      "aptitudes": [
        "Intelligence",
        "Fieldcraft"
      ],
      "alignment": "Nurgle",
      "benefit": "The character gains a +10 bonus on all Medicae Skill Tests. If the character fails his Medicae Test while performing Extended Care, he reduces the amount of Damage suffered by his patience due to his failure by an amount equal to his Intelligence Bonus. If their patient is in danger of losing a limb from a Critical Hit, the character provides the patient with a +20 bonus to the Toughness Test to prevent limb loss.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Master Enginseer",
      "id": "master_enginseer",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 3 Tech Use",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character gains a +10 bonus on Tech-Use Skill Tests. The character may spend a Fate Point to automatically succeed on a Tech-Use Skill Test for enhancement, repair, or upgrade of a machine's system, taking the minimum amount of time possible on the task. In addition, at the GM's discretion, the character may repair objects without all the parts to hand, jury-rigging a working device as good as the original",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Master Orator",
      "id": "master_orator",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Inspire Wrath or Air of Authority"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "When the character uses the Charm or Intimidate Skill to affect more than one person, they may affect a number of people up to a 100 times their Fellowship Bonus rather than just 10. In addition such is the character's natural magnetism and charisma that he adds +10 to the loyalty of all his Minions. When in a Social Conflict against more than one opponent, including crowds, the character saps 1d10 instead of 1d5 Willpower against all foes if he used Charm or Intimidate in the Opposed Test.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Master Questioner",
      "id": "master_questioner",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 3 Interrogation"
      ],
      "aptitudes": [
        "Willpower",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per game session, the character may automatically pass one Interrogation test, even if penalties would normally make passing such a test impossible. Should degrees of success be a factor, then the character is consider to have rolled a 01 on this test. In addition, the GM may allow the character to use the Interrogation skill on subjects normally immune to its effects.",
      "source": "Ascension"
    },
    {
      "tier": 3,
      "name": "Mastermind",
      "id": "mastermind",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 30",
        "Willpower 30",
        "Implanted Colchite Device"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Implanted with a Stryxis psy-motivator at the base of his cerebellum, this character can control specifically fitted servitors as though they were extensions of his own body. When actively controlled, the servitors use the character's WS and BS and can perform more complicated actions that might otherwise be beyond their normal mental capabilities (a battle servitor could open a door or a drone could pick up a delicate object without breaking it, for instance). The character can control one servitor for each time this Talent is taken, but is limited to controlling one servitor for every 10 points of his Intelligence Characteristic (rounded up), up to a maximum of 5 servitors. For instance, a character with an Intelligence of 36 could only ever control 3 servitors at once, even if he takes this Talent a fourth time. The range of control extends 20m x the character's Willpower Bonus (so a character with Willpower 23 could control his servitors up to 40m away); if the servitor goes beyond the maximum control range or the psychic link is broken (such as by the presence of an Untouchable), the servitor reverts to its normal routines. Only servitors that have been fitted with Colchite implants attuned to the character can be thus controlled. While actively controlling one or more servitors, the character must concentrate intently and can only take a Half Action on each of his Turns. If the character stops concentrating or his concentration is broken, the servitors merely resume their normal routine and follow the last instructions given to them.",
      "source": "The Navis Primer"
    },
    {
      "tier": 3,
      "name": "Mastery",
      "id": "mastery",
      "specialist": true,
      "specialisations": [
        "Any Skill"
      ],
      "prerequisites": [
        "Rank 4 in selected skill"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "He can spend a Fate point to automatically pass a skill test with his chosen skill, provided the final modifier to his skill test is Challenging (+0) or better. He scores a number of degrees of success equal to the characteristic bonus of the skill's associated characteristic. This talent may be taken more than once, each time for a different skill.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Mechadendrite Use",
      "id": "mechadendrite_use",
      "specialist": true,
      "specialisations": [
        "Weapon",
        "Utility"
      ],
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Gain ability to use certain Mechadendrites.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Meditation",
      "id": "meditation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Willpower",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "Success on a Willpower Test and ten minutes without interruptions removes one level of Fatigue.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Melta Weapon Expertise",
      "id": "melta_weapon_expertise",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40",
        "Weapon Training (Melta)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When firing any melta weapon (such as an inferno pistol, meltagun, and multi-melta), this character counts its Range as being increased by a number of metres equal to two times his Ballistic Skill Bonus.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Melta Weapon Mastery",
      "id": "melta_weapon_mastery",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 50",
        "Melta Weapon Expertise"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character makes an attack with a melta weapon (such as an inferno pistol, meltagun, and multi-melta), he deals +2 additional Penetration for every two Degrees of Success he scores on the Ballistic Skill Test beyond the first. This bonus applies after the doubling of Penetration for the Melta Quality whenever that Quality takes effect",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Mental Maze",
      "id": "mental_maze",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35",
        "Strong Minded"
      ],
      "aptitudes": [
        "Intelligence",
        "Defence"
      ],
      "alignment": "Tzeentch",
      "benefit": "Whenever this character succeeds on a Willpower Test made as part of an Opposed Test for a Psychic Power (either his opponent's or his own), he may spend a Fate Point. If he does, he gains a number of additional Degrees of Success equal to his Intelligence Bonus.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Mental Rage",
      "id": "mental_rage",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Frenzy",
        "Psy Rating"
      ],
      "aptitudes": [
        "Psyker",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "The character's madness and hate open his mind to the warp, allowing the character to use its power with little conscious thought. While in a Frenzied state, the character may use his Psychic Powers normally.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Metal Fatigue",
      "id": "metal_fatigue",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Willpower",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "A small bionic implant gifted to agents of the Lords Dragon is an item much feared by hereteks and more radical adherents to the Cult Mechanicus. This insidious interrogation device painfully dissolves the target's cybernetics. To use the device, the agent needs to make an Opposed Tech-Use test against the target's Toughness. For every degree of success, the victim suffers 1 damage and -10 to the subsequent Interrogation test. Once the subject suffers their Toughness bonus in damage, they permanently lose one randomly chosen cybernetic. The device requires the target to have cybernetics to function.",
      "source": "The Lathe Worlds"
    },
    {
      "tier": 2,
      "name": "Methodical Care",
      "id": "methodical_care",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 40",
        "Swift Suture"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Nurgle",
      "benefit": "Whenever one of this character's patients would suffer Damage from a failed Test made as part of the Extended Care Special Use of the Medicae Skill, this character may reduce that Damage by an amount equal to his Intelligence Bonus.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Mighty Shot",
      "id": "mighty_shot",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Nurgle",
      "benefit": "He adds half his Ballistic Skill bonus (rounded up) to damage he inflicts with ranged weapons.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Mimic",
      "id": "mimic",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Vox synthesisers, training, or innate abilities allow the character to accurately mimic the voice of another. For proper imitation, the character must study the voice patterns of their intended target for at least one hour and speak the same language. The character cannot accurately copy the voice of a xenos due to the difference in physiology and the subtle complexities of most alien languages. Listeners must succeed on a Scrutiny Skill Test with a -10 penalty to penetrate the deception. If the character's study used vox recordings or comm-link conversations rather than in-person observation, then there is no penalty to the Scrutiny Skill Test to see through it. The character's deception automatically fails if the listener can clearly see them. In a Social Conflict if this character mimics his foe to ridicule and disparage in the Verbal Contact stage, then the opponent loses 1d10 rather than 1d5 Willpower should the character win the round.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Mind Sight",
      "id": "mind_sight",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psyniscience"
      ],
      "aptitudes": [
        "Perception",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "This character may spend a Fate Point to automatically succeed on a Psyniscience Test with a number of Degrees of Success equal to his Perception Bonus.",
      "source": "Faith and Coin"
    },
    {
      "tier": 2,
      "name": "Mindtrap Maze",
      "id": "mindtrap_maze",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40",
        "Intelligence 40"
      ],
      "aptitudes": [
        "Intelligence",
        "Defence"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character may add twice his Intelligence Bonus to any Opposed Willpower Test that he must make because of another creature's psychic power. If he wins this Opposed Test, the psyker attempting to tamper with his mind gains one level of Fatigue.",
      "source": "The Navis Primer"
    },
    {
      "tier": 2,
      "name": "Minion",
      "id": "minion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 45",
        "Influence 30"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "Though various means the character has acquired a Minion. Such a Minion is less powerful than the character, though tougher than most. This talent may be taken more than once, each time adding another Minion to the character's retinue.",
      "source": "Black Crusade"
    },
    {
      "tier": 2,
      "name": "Minion Improvement",
      "id": "minion_improvement",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Superior Minion"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "The Character's Superior Minion gains 500 xp to spend on Advancements, as detailed in Minions. This Talent may be selected any number of times, but the Superior Minion's total xp can never exceed 50% of the Character's total. Note additional purchases on the Character's sheet as Minion Improvement (X), where X is the number of times the Talent has been purchased.",
      "source": "Tome of Excess"
    },
    {
      "tier": 3,
      "name": "Minion Master",
      "id": "minion_master",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 40",
        "Influence 60",
        "Air of Authority"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "Through dint of his fearsome reputation, prophesied destiny, or even a daemonic pact, the character can attract—and keep—a considerably larger retinue than his peers. The character may have a number of Minions equal to one and a half times his Fellowship Bonus, rounded down.",
      "source": "Tome of Excess"
    },
    {
      "tier": 3,
      "name": "Mnemonic Purging",
      "id": "mnemonic_purging",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 45",
        "Willpower 45"
      ],
      "aptitudes": [
        "Willpower",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character has been conditioned and trained so that he is able to deliberately remove his memories. Such an ability may be used to prevent others extracting dangerous information from the character by torture or psychic violation of his mind. It might also be used by the character to protect himself from insanity or the corrupting touch of Chaos by removing the memories of past events. \n\nTo use this Talent, the character must specify a particular memory he wants to remove. The character must then make a Willpower test, modified by the GM for the approximate size of the memory involved using the guidelines below. If the test is passed, the memory is removed. The character is no longer able to recall any part of it, and it is inaccessible using any effect that allows access to others' memories. \n\nIn addition, any Insanity points acquired during the period of memory that has been removed are lost, along with any attendant disorders that the character has acquired as a result. Half of any Corruption points acquired (rounding up) during the remembered period are also lost. \n\nIf the character fails the test, the memory is not removed and he acquires an additional Insanity point for every degree of failure up to a maximum of five. The character also requires an amount of uninterrupted time to purge a memory. The approximate time required to purge memories of different sizes is listed below. If the character is interrupted during this time his attempt automatically fails and he gains 1d5 insanity points.\n\n\n\nSize of Memory | Modifier | Time Required\n\n---|---|---An instant          | +30                   | 5 minutes\n\nA few seconds   | +20                   | 10 minutes\n\nA few minutes   | +10                   | 15 minutes\n\nAn hour               | +0                    | Half an hour\n\nA day                   | -10                 | One hour\n\nA year                  | -20                 | A day\n\nSeveral Years      | -30                 | A day per year of memory",
      "source": "Ascension"
    },
    {
      "tier": 1,
      "name": "Modify Payload",
      "id": "modify_payload",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Tech-Use"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "When preparing a grenade, missile, or round that has the Blast or Smoke Quality, this character may make a Challenging (+0) Tech-Use Test using the Demolitions Special Use of the Skill. If he succeeds, the weapon increases Damage (if it deals Damage normally) and its Blast or Smoke Quality by 1, plus 1 for every three additional Degrees of Success beyond the first that he scores on the Test. If he fails by a number of Degrees of Failure greater than his Intelligence Bonus, however, he accidentally triggers the device, causing it to detonate immediately.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Mounted Warrior",
      "id": "mounted_warrior",
      "specialist": true,
      "specialisations": [
        "Melee",
        "Ranged"
      ],
      "prerequisites": [
        "Rank 2 Operate (any) or Rank 2 Survival",
        "Ballistic Skill 30 or Weapon Skill 30"
      ],
      "aptitudes": [
        "Weapon Skill/Ballistic Skill",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When a character purchases this talent, he selects the specialisation that matches the characteristic prerequisite and aptitude used in purchase. He then reduces any penalty for making corresponding attacks (Melee or Ranged) from a moving vehicle or mount by 10 for each time the talent has been purchased in that specialisation. This applies to both ordinary attack actions and vehicle combat actions, such as Hit and Run.",
      "source": "Enemies Within"
    },
    {
      "tier": 2,
      "name": "Munitorum Influence",
      "id": "munitorum_influence",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Logistics Rating or Profit Factor"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "The group's Logistics Rating/Profit Factor increases by +5. This bonus is permanent, and is not removed even if the character who purchased this Talent is killed or removed from play. Purchasing this Talent costs an additional amount of XP equal to 5 times the group's current Logistics Rating/Profit Rating",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Nerves of Steel",
      "id": "nerves_of_steel",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "The character may re-roll failed Willpower Tests to avoid or recover from Pinning. In addition, he is seldom impressed by the aggressive displays of his enemies and gains a +10 to Willpower Tests when resisting the effects of enemy Intimidation Skill attempts. In a Social Conflict the character gains +20 in the Opposed Test if his opponent uses the Intimidate Skill.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Never Die",
      "id": "never_die",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 50",
        "Toughness 50"
      ],
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "He may spend one Fate point to ignore the effects of injury (such as those from Critical damage), Fatigue, and Stunning for a single combat, so long as they would not kill him immediately. This talent does not prevent the damage, but allows him to temporarily ignore its effects for the duration of the combat. Once the encounter ends, the effects trigger as normal.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Nowhere to Hide",
      "id": "nowhere_to_hide",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 30"
      ],
      "aptitudes": [
        "Perception",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When he damages cover, the character adds his degrees of success from the attack to the reduction of the cover's Armour value. If using a weapon that does not require a skill test, he adds 1 instead.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "One-on-One",
      "id": "one_on_one",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Slaanesh",
      "benefit": "When fighting a single enemy in melee combat, the character scores extra degrees of success on successful Weapon Skill tests equal to half of his Weapon Skill bonus (rounded down)",
      "source": "Enemies Beyond"
    },
    {
      "tier": 2,
      "name": "Operative Conditioning",
      "id": "operative_conditioning",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Cold Hearted",
        "Orthoproxy"
      ],
      "aptitudes": [
        "Perception",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may utilise an interrogator's questions and techniques to garner detailed information about the nature, aims, and motivations of the interrogator himself and those he works for. If the character is subjected to interrogation, and wins the opposed Interrogation versus Willpower Test, he may immediately make a Challenging (+0) Scrutiny Test. On a success and for every additional degree of success, he can learn one detail about his captors (what he can and cannot learn is ultimately up the GM, but it should be something valuable).",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 1,
      "name": "Orthoproxy",
      "id": "orthoproxy",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Willpower",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character receives a +20 bonus to Willpower Tests made to resist mind control or interrogation. However, he tends not to get jokes.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Overkill",
      "id": "overkill",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 45",
        "Bulging Biceps"
      ],
      "aptitudes": [
        "Perception",
        "Offence"
      ],
      "alignment": "Nurgle",
      "benefit": "When this character hits with a ranged attack, he may make a Challenging (+0) Perception Test as a Reaction. If he succeeds, he adds his Degrees of Success on this Perception Test to the Degrees of Success he scored on the original Ballistic Skill Test for the attack.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Overlooked",
      "id": "overlooked",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 35",
        "Unremarkable"
      ],
      "aptitudes": [
        "Perception",
        "Defence"
      ],
      "alignment": "Slaanesh",
      "benefit": "Any enemy who this character has not already attacked this encounter must pass a Routine (+20) Intelligence Test to attack this character so long as there is a friendly character with a Size Trait with a higher value within 5 metres. If a foe fails this Test, he ignores this character in favour of a larger nearby target.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Paranoia",
      "id": "paranoia",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Perception",
        "Fieldcraft"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character gains a +2 bonus on Initiative rolls and the GM may secretly Test using the character's Perception to notice hidden threats. The price of this eternal vigilance is a twitchy disposition and the inability to relax.",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Peer",
      "id": "peer",
      "specialist": true,
      "specialisations": [
        "Any Organisation"
      ],
      "prerequisites": [
        "Fellowship 30",
        "GM Permission"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "The player/GM chooses a specialisation that matches an organisation (A general one listed in Organisations, or a more specific one). He gains a +10 bonus to all Fellowship and Influence tests when interacting with this chosen group, and at the GM's discretion can sometimes call upon them for favours. The GM and player may agree to award this talent when appropriate to the adventure or campaign, though the character must still pay the experience cost for the Talent as normal. This talent can be awarded multiple times for the same group, in which case it should be listed as Peer (X), with X equaling the number of times the talent has been awarded. This can be used to represent groups who particularly like the character and may even be staunch allies. In game terms, the bonus to Fellowship tests increases to +10 times X. Additionally, when the character acquires this talent, he increases his Influence by 1. In a Social Conflict involving a member of the group the character has ties with, he gains an additional 20 to his Infamy reserve for this encounter only.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Penitent Psyker",
      "id": "penitent_psyker",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating",
        "Strong Minded",
        "Willpower 40"
      ],
      "aptitudes": [
        "Psyker",
        "Defence"
      ],
      "alignment": "Tzeentch",
      "benefit": "When the psyker or an ally within 10 metres becomes the target of a psychic power, the psyker may voluntarily suffer any number of levels of Fatigue. Each level of Fatigue suffered grants the target a +10 bonus on any Opposed test to resist the power or Evasion test to avoid its effects. If the target's test to resist or avoid the power results in a roll of doubles, the psyker generates Psychic Phenomena, just as if he had used the Focus Power action",
      "source": "Enemies Within"
    },
    {
      "tier": 2,
      "name": "Perfected Maintenance",
      "id": "perfected_maintenance",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Common Lore (Adeptus Mechanicus) +20",
        "Initiated Maintenance"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per game session, this character may make a Challenging (+0) Tech-Use Test as a Full Action to substantially improve the functioning of one piece of his personal equipment. If he succeeds, the chosen item counts as being one level of Craftsmanship higher the end of the game session, plus one additional level per Degree of Success he scores beyond the first (to a maximum of Best Craftsmanship).",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Persuasive Charm",
      "id": "persuasive_charm",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 35",
        "Charm"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Once per game session, before the Squad makes a Logistics Test, this character can make a Difficult (-10) Charm Test in an attempt to convince the regimental quartermaster or other distributor of supplies to assist the Squad. If he succeeds, the Squad gains a +5 bonus on the Logistics Test for every Degree of Success this character scores on the Charm Test, to a maximum of +30. At the Game Master's discretion, the Charm Test might be harder, especially if the Squad has earned the ire of this particular representative in the past.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Pity the Weak",
      "id": "pity_the_weak",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 35",
        "Willpower 35"
      ],
      "aptitudes": [
        "Strength",
        "Willpower"
      ],
      "alignment": "Khorne",
      "benefit": "The character has nothing but contempt for those less powerful than himself and gains a +10 on Command, Commerce, Deception, and Intimidation Skill Tests when opposed by someone with either a Strength or Willpower Characteristic lower than themselves. Unfortunately, the character also has trouble hiding his contempt from such people and suffers a -10 to Charm Skill Tests when dealing the same people. These bonuses and penalties also apply in Social Conflicts.",
      "source": "Black Crusade"
    },
    {
      "tier": 2,
      "name": "Plasma Weapon Expertise",
      "id": "plasma_weapon_expertise",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40",
        "Weapon Training (Plasma)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character wields a plasma weapon (such as a plasma pistol, plasma gun, or plasma cannon) with the Overheats Quality, that weapon only Overheats on a roll of 96 or higher or on a Jam.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Plasma Weapon Mastery",
      "id": "plasma_weapon_mastery",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 50",
        "Plasma Weapon Expertise"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "When this character fires a plasma weapon (such as a plasma pistol, plasma gun, or plasma cannon) with the Maximal Quality on the Maximal setting, the weapon adds an additional +2 bonus to Damage, its Penetration, and its Blast Quality (to a total of an additional 1d10+2 Damage, +4 Penetration, and +4 to its Blast Quality).",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Potentia Coil Induction",
      "id": "potentia_coil_induction",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Implanted Potentia or Mechanicus Implants",
        "Toughness 35"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has learned to feed additional power to his potentia coil through electoo inductors and eliminate any weariness or strain he suffers from. When in the presence of a suitable power source, such as a portable generator or the power plant of one of his regiment's fighting vehicles, he may make an Ordinary (+10) Toughness Test and recover from a number of levels of Fatigue equal to the Degrees of Success achieved on the Test.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Precision Killer",
      "id": "precision_killer",
      "specialist": true,
      "specialisations": [
        "Ballistic SKill",
        "Weapon Skill"
      ],
      "prerequisites": [
        "Ballistic Skill 40 or Weapon Skill 40"
      ],
      "aptitudes": [
        "Ballistic Skill/Weapon Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When this talent is taken, the character selects the Specialisation that matches the Characteristic and Aptitude pair (Ballistic Skill or Weapon Skill) used in purchase. When making a Called Shot with a melee or ranged attack (depending on the Specialisation), he does not suffer the usual -20 penalty.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Preternatural Grace",
      "id": "preternatural_grace",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 50",
        "Rank 3 Dodge or Rank 3 Parry",
        "Rank 3 Acrobatics or Rank 3 Athletics"
      ],
      "aptitudes": [
        "Agility",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "This character's physical superiority grants them two main benefits. The first is a re-roll on any Acrobatics or Athletics check. The second is allows the character a number of extra Reactions equal to their Agility Bonus. These bonus reactions may only be used to make Dodge or Parry tests. The Assassin may still only attempt a single Dodge or Parry against each attack made against him. Additionally, they may attempt to Dodge any attack, including attacks that are not normally eligible for a Dodge Test, such as massive explosions, a descending titan's foot, or an invisible psychic attack (The GM should make the final decision on which attacks may not be Dodged, and at his discretion, this ability may not apply).",
      "source": "Ascension"
    },
    {
      "tier": 3,
      "name": "Preternatural Speed",
      "id": "preternatural_speed",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40",
        "Agility 50"
      ],
      "aptitudes": [
        "Agility",
        "Offence"
      ],
      "alignment": "Slaanesh",
      "benefit": "Double speed when charging.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Profane Symbols",
      "id": "profane_symbols",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating"
      ],
      "aptitudes": [
        "Psyker",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "Any power with a range of Self can be cast upon an ally, painting arcane symbols upon his flesh or armour. The normal duration of the Focus Power Test does not apply—it instead takes six rounds to manifest the power, at the end of which the Focus Power Test is made, with an additional -10 penalty. If this is successful, the power takes effect, though all the power's normal effects are applied to the ally rather than the sorcerer. The recipient must spend the actions to sustain the power's effect, though all other effects of sustaining a power affect the sorcerer.\n\nAny power with a radius centred on the sorcerer may be cast upon a location, marking the ground or another fixed, immovable point in some blasphemous manner. The normal duration of the Focus Power Test does not apply; it instead takes six rounds to manifest the power, at the end of which the Focus Power Test is made, with an additional -20 penalty. If this is successful, the power takes effect, though all the power's normal effects are instead centred upon the chosen point. The sorcerer must sustain the power as normal.",
      "source": "Black Crusade"
    },
    {
      "tier": 1,
      "name": "Profit by the Witch",
      "id": "profit_by_the_witch",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35",
        "Profit Factor"
      ],
      "aptitudes": [
        "Intelligence",
        "Social"
      ],
      "alignment": "Tzeentch",
      "benefit": "Whenever the character completes an Endeavour directly involving a psyker or group of psykers from outside of the crew, increase the group's Profit Factor by an additional 1 point.",
      "source": "The Navis Primer"
    },
    {
      "tier": 2,
      "name": "Prosanguine",
      "id": "prosanguine",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Autosanguine Implants",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Nurgle",
      "benefit": "He must spend 10 minutes in meditation and make a Tech-Use test. If he succeeds, he removes 1d5 points of damage. If he rolls a 96 or higher, he loses the ability to use his Autosanguinator for one week",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Pugilist",
      "id": "pugilist",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 30"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "This character may make a Feint Action as a Free Action when making an unarmed All-Out Attack Action or Standard Attack Action. Additionally, he may make Called Shot Actions as a Half Action when making unarmed attacks.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Pure Faith",
      "id": "pure_faith",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Adeptus Ministorum or Adeptus Sororitas Background"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Imperial",
      "benefit": "The character's faith in the God Emperor of Mankind, his divine power and grace, is total and complete. This faith wraps around him and suffuses his soul, armouring him against the foul influences and weapons of the heretic. Pure Faith provides all of the following benefits: The character is always immune to the effects of Daemonic Presence including the negative modifiers to his Willpower. The character may spend a Fate Point to not take Fear Tests, not acquire Insanity Points, and not gain any Corruption Points. These safeguards remain for the duration of the encounter. The character may burn a Fate Point to resist the effects of any single daemonic or psychic attack, effectively allowing him to emerge unscathed as if by a miracle.",
      "source": "Rogue Trader"
    },
    {
      "tier": 3,
      "name": "Purge the Unclean",
      "id": "purge_the_unclean",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Pure Faith"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Imperial",
      "benefit": "The character can focus his faith through words, gestures, and force of will such that a daemon may be cowed or cast out by the power of the Emperor. As a half action, the character may spend a Fate Point to intone holy words to repel a warp entity. Make an opposed Willpower Test against the warp entity. If the Test succeeds, the warp creature is repelled a distance of metres away equal to twice the character's Willpower Bonus. It cannot approach closer than this distance for 2d5 Rounds. As a full action, the character may spend a Fate Point to speak the rites of exorcism and force out a possessing warp entity from its host. Make an opposed Willpower Test against the warp entity. If the Test succeeds, the warp entity is driven out of the thing it was possessing and manifests in an adjacent space to its former host. The warp entity may not possess the host again for a number of hours equal to twice character's Willpower Bonus. As a full action, the character may burn a Fate Point to chant the litanies of detestation to purge a warp entity from reality. He must be actually confronting the thing and not just thinking about it. Test the character's Willpower; if successful, he deals Damage equal to his Willpower Bonus, plus his Willpower Bonus for each Degree of Success. On a failed Test, the warp creature takes damage equal to the character's Willpower Bonus. Damage inflicted by this method is not reduced by the creature's Toughness or Armour.",
      "source": "Rogue Trader"
    },
    {
      "tier": 2,
      "name": "Purity of Hatred",
      "id": "purity_of_hatred",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Hatred (Any)"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When selecting this talent, the character chooses one specific group for which he possesses the Hatred talent. Against opponents of this group, the Acolyte's attacks gain the Vengeful (9) quality. If the Acolyte's weapon or attacks already possess this quality, decrease the value by one (to a minimum of 1)",
      "source": "Enemies Within"
    },
    {
      "tier": 3,
      "name": "Push the Limit",
      "id": "push_the_limit",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Survival or Rank 2 Operate (any)",
        "Tech-Use"
      ],
      "aptitudes": [
        "Perception",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per round, the character may add +20 to an Operate test (or Survival test in the case of living steeds); however, if he fails the test by 4 or more degrees of failure, immediately roll 1d5 on Table Motive Systems Critical Hit Effects and apply the result. If he is riding a living mount, roll 1d5 on Impact Critical Effects - Leg and apply the result.",
      "source": "Enemies Without"
    },
    {
      "tier": 3,
      "name": "Putrescence Within, Putrescence Without",
      "id": "putrescence_within_putrescence_without",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Death Priest background",
        "Toughness 40",
        "10 Corruption"
      ],
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "Death Priests exude all manner of corruption and filth from the many contagions and parasites that fester within their distended guts. The Death Priest's Toxic trait improves to Toxic(CB). In addition, whenever an enemy strikes the Death Priest with a melee attack, the Death Priest may spend an Infamy/Fate Point to destroy the weapon that struck him after the attack is resolved. Whether or not the weapon can later be restored through cleansing, devotion, and sacrifice is left to the GM.",
      "source": "Tome of Decay"
    },
    {
      "tier": 1,
      "name": "Quick Draw",
      "id": "quick_draw",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Agility",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "As a Free Action, the character may draw and ready a Pistol or Basic weapon, or a one-handed Melee weapon.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Rabbit Punch",
      "id": "rabbit_punch",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 35",
        "Weapon Skill 35"
      ],
      "aptitudes": [
        "Agility",
        "Finesse"
      ],
      "alignment": "Slaanesh",
      "benefit": "This character has learned how to match finesse to brutality and hit any enemy exactly where it hurts the most. When making an Unarmed Attack, this character adds his Agility Bonus to Damage instead of his Strength Bonus.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Radiant Presence",
      "id": "radiant_presence",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Slaanesh",
      "benefit": "Everyone within 20 metres that can see the character feels inspired just by being near them and suffers lessened effects from things that would upset or distress them. Those affected gain a +10 to Willpower Tests to resist Fear or against Intimidation attempts. This ability affects all allies close to the character, though not the character himself",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Ranged Weapon Expert",
      "id": "ranged_weapon_expert",
      "specialist": true,
      "specialisations": [
        "Any Weapon Group"
      ],
      "prerequisites": [
        "Ballistic Skill 50",
        "Weapon Training (Match specialization)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per combat encounter, this character may take an Aim Action as a Free Action before making an attack with a weapon of the chosen group. A character must possess the corresponding Weapon Training in order to select this Talent. A character can select this Talent more than once, each time with a different specialisation.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Rapid Reaction",
      "id": "rapid_reaction",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 40"
      ],
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Slaanesh",
      "benefit": "When surprised or ambushed, a successful Agility Test allows the character to act normally",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Rapid Reload",
      "id": "rapid_reload",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Slaanesh",
      "benefit": "He halves all reload times, rounding down. Thus, a Half Action reload becomes a Free Action, a Full Action reload becomes a Half Action, and so on",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Raptor",
      "id": "raptor",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Operate (Aeronautica)"
      ],
      "aptitudes": [
        "Agility",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character makes a Charge Action using a Jump Pack his melee attack deals an extra d10 of Damage for every two Degrees of Success he scores on his Weapon Skill Test to a maximum of two extra d10",
      "source": "Black Crusade"
    },
    {
      "tier": 2,
      "name": "Ratling Requisitions",
      "id": "ratling_requisitions",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 45",
        "Ratling"
      ],
      "aptitudes": [
        "Agility",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "When making Requisitions during after receiving Mission Assignment Gear, the character may spend a Fate Point to automatically acquire any single small item of Rare availability or less that might be reasonably held in the regiments stores. The item must be approximately the size of a laspistol or smaller, although larger items may be acquired with a plan or an Agility Test at the GM's discretion. The character is subject to severe punishments if his theft is discovered, but the GM should remember that quartermasters are busy men who can rarely find time to take a complete inventory (and so many authority figures may assume the character requisitioned the item normally). If the character wishes to return the item to stores after the mission, it can be assumed the return is just as successful as the acquisition",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Relic Bearer",
      "id": "relic_bearer",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Logistics Rating 40+",
        "Scholastic Lore (Imperial Creed) +20"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has earned this rare honour, and possesses a relic as part of his Standard Kit—perhaps the finger bone of a blessed Imperial saint, a scrap of the death shroud used to swaddle the remains of a valiant Lord General, or the shattered remains of a glorious hero's favoured weapon. While he displays this relic, all allies within 30 metres gain a +20 bonus on Tests to resist Fear and Pinning, as well as any Tests to avoid gaining Corruption or Insanity Points. However, the loss of a relic is a deep and terrible shame. If the character loses the relic or allows it to be destroyed, he immediately loses all remaining Fate Points for the session, and ceases to gain any benefit from this Talent. In order to benefit from this Talent again, the character must recover or restore the relic.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Resistance",
      "id": "resistance",
      "specialist": true,
      "specialisations": [
        "Cold",
        "Fear",
        "Heat",
        "Poisons",
        "Psychic Powers",
        "Radiation",
        "Vacuum"
      ],
      "prerequisites": null,
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "He gains a +10 bonus when making tests to resist effects of this type. The GM can require approval for certain choices, or justification based on the Acolyte's past.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Righteous Blow",
      "id": "righteous_blow",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 45 or Weapon Skill 45 or Willpower 45"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character inflicts Righteous Fury with an attack or Psychic Power for which he achieved three or more Degrees of Success on the attack roll or Focus Power Test, he rolls twice to determine the amount of Critical Damage he inflicts with Righteous Fury and takes the higher result.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Rigor Mentis",
      "id": "rigor_mentis",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "The Lords Dragon, a clandestine group within the Cult Mechanicus that investigates and avenges tech-heresies (both real and imagined), entrust a great deal of technology and information to their agents. To safeguard even their existence, the tech-priests place mental and technical blocks on evidence of their organization or their operations to withstand any interrogation. The character can reroll any interaction test to resist attempts to divulge information about the Lords Dragon, their Panoptical Orbital station, or their secretive Praecursator Grid using Interrogation, Charm, Deceive, or any other method an adversary may use.",
      "source": "The Lathe Worlds"
    },
    {
      "tier": 2,
      "name": "Ripper Charge",
      "id": "ripper_charge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 45",
        "Bulging Biceps"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "The character may spend a Full Action to make a Charge Move directly towards a distant enemy. As long as the Charge Move does not bring the character into melee range of the enemy, he may immediately make a Full Auto Burst Action with a ranged weapon as a Free Action. The difficulty of this attack is Challenging (+0) instead of Difficult (-10) as with a normal Full Auto Burst.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Rite of Awe",
      "id": "rite_of_awe",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Social",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The augmetic blessing of the Omnissiah on the character's voice box allows him to recite infrasonic liturgies that trigger awe and fear. All humans, regardless of their ability to hear, within a 50-meter radius feel a sense of dread and take a -10 penalty to their next Skill Test (including Weapon Skill and Ballistic Skill Tests). Player characters may ignore these effects with a successful Willpower Test. Whilst incanting the rite, the character may not talk or communicate with others. The rite requires one-Half Action speaking the litany in Techna-Lingua, and it is considered very bad form to break off the recitation before completion. Humans without auditory implants cannot hear infrasonic sounds, and though still affected do not know the character is speaking.",
      "source": "Deathwatch"
    },
    {
      "tier": 3,
      "name": "Rite of Fear",
      "id": "rite_of_fear",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Social",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character's infrasonic dirges cause terror in the weak. All humans, regardless of their ability to hear, within a 50-meter radius treat the character as if he had a Fear Rating of 1. While incanting the dirge, the character may not communicate in any other way. The rite requires one-Half Action chanting in Techna-Lingua, and most would not consider halting the incantations prior to their completion. Humans without auditory augmentation cannot hear infrasonic sounds, and though still affected do not know the character is speaking",
      "source": "Deathwatch"
    },
    {
      "tier": 1,
      "name": "Rite of Ignition",
      "id": "rite_of_ignition",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Tech-Use",
        "Strength 30"
      ],
      "aptitudes": [
        "Strength",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has their own, self-taught, 'Rite of Ignition', a form of prayer to the Machine-Spirit that involves striking the object in question several times, usually with sufficient force for activation. \n\nThe character may substitute their Strength for their Intelligence when making a Tech-Use test to start or activate machinery. More sophisticated or delicate machinery may not respond well to the Rite of Ignition, at the GM's discretion.",
      "source": "The Lathe Worlds"
    },
    {
      "tier": 3,
      "name": "Rite of Pure Thought",
      "id": "rite_of_pure_thought",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has replaced the creative half of his brain with sacred cranial circuitry. The character can no longer feel emotion, and instead embraces the crystal purity of logic. The character is immune to Fear, Pinning, and any effects that stem from emotional disturbance. The character's GM removes any Mental Disorders that no longer apply, and grant the character appropriate new ones of equal severity. The character's comrades may find the character somewhat cold, though other followers of the Omnissiah will rejoice in the character's newfound freedom.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Rite of Static Overload",
      "id": "rite_of_static_overload",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "1+ Cybernetic Limbs",
        "Rank 2 Tech-Use"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "This character may make a Challenging (+0) Tech-Use Test as a Half Action to attempt to channel the energies within one or more of his cybernetic limbs outward. If he succeeds, for a number of Rounds equal to his Intelligence Bonus, his attacks with these limbs (be they unarmed attacks with a bionic arm or leg, attacks with an inbuilt weapon, or attacks with a mechadendrite of some sort) gain the Shocking Quality. After a number of Rounds equal to his Intelligence Bonus or if he fails the Test by four or more Degrees of Failure, the cybernetic appendage shuts down until he can dedicate several minutes to fixing it with a Routine (+20) Tech-Use Test",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Rites of Banishment",
      "id": "rites_of_banishment",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Common Lore (Imperial Creed) or Rank 1 Forbidden Lore (Daemonology)"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Imperial",
      "benefit": "Once per round as a Half Action, the character may speak the litanies and invocations to disrupt Daemons. Until the beginning of his next turn, Daemons within a distance equal to twice the character's Willpower bonus in meters suffer a -10 penalty to Willpower tests",
      "source": "Enemies Beyond"
    },
    {
      "tier": null,
      "name": "Rival",
      "id": "rival",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "GM Permission"
      ],
      "aptitudes": null,
      "alignment": null,
      "benefit": "Essentially the opposite of Peer, this Talent represents aggressive competition and some animosity with a particular social group or organisation. The player/GM chooses a specialisation that matches an organisation (A general one listed in Organisations, or a more specific one). The Character suffers a -10 penalty to all Fellowship Tests when interacting with the group in question. The GM and player may agree to award this Talent when appropriate to the storyline. This Talent may be removed with an Elite Advance and the approval of the GM if the player has taken suitable actions to earn the trust of the group.",
      "source": null
    },
    {
      "tier": 3,
      "name": "Sacred Flame",
      "id": "sacred_flame",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40",
        "Cleanse and Purify"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Tzeentch",
      "benefit": "This character inflicts Righteous Fury on a result of 9 or 10 on Damage Rolls from weapons with the Flame Quality",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Sacrifice",
      "id": "sacrifice",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating"
      ],
      "aptitudes": [
        "Psyker",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "A psyker with the Sacrifice Talent may ritually prepare and slay a sacrificial victim (which must be a human or intelligent xenos). It takes a Forbidden Lore (Warp) Skill Test, taking 2d5 minutes to prepare and anoint a bound and helpless sacrificial victim. Once prepared, it takes a Full Round action to slay the victim. In the subsequent turn, the psyker gains a +5 bonus to his Focus Power Test for every Degree of Success scored on Forbidden Lore (Warp) Skill Test. In addition, should any Psychic Phenomena or Perils of the Warp occur, the effects are focused through the dying victim. Any effects that would normally affect the psyker instead cause the body to burn to ash in a blaze of iridescent warp-flame, dealing 1d10 Energy Damage to anyone within three metres of the victim (gaining the Warp Weapon trait and increasing the area to a five-metre radius if it was caused by Perils of the Warp).",
      "source": "Black Crusade"
    },
    {
      "tier": 3,
      "name": "Sanctic Purity",
      "id": "sanctic_purity",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Daemonologist",
        "Favoured by the Warp",
        "Willpower 50"
      ],
      "aptitudes": [
        "Psyker",
        "Willpower"
      ],
      "alignment": "Imperial",
      "benefit": "When the character triggers Psychic Phenomena when manifesting a power from the Sanctic Daemonology discipline, he may spend a Fate point in order to negate the result entirely.",
      "source": "Enemies Beyond"
    },
    {
      "tier": 2,
      "name": "Scholastica Psykana Failsafes",
      "id": "scholastica_psykana_failsafes",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Sanctioned Psyker",
        "Willpower 45"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Unaligned",
      "benefit": "Wards and psy-active micro-circuitry have been surgically grafted into the Psyker, granting him some manner of defence against the warp's predications. When the Psyker is required to roll on the Perils of the Warp Table (but not the Psychic Phenomena Table), he may modify the result rolled by 1d5 (either increasing it or decreasing it as he chooses). In addition, if the Psyker ever rolls a result on the Perils of the Warp Table that would result in him being possessed, he must make a Challenging (+0) Willpower Test. Success means his conditioning activates, and he kills himself with whatever weapon he has at hand (or his Psykana Mercy Blade). The Psyker may still permanently burn a Fate Point to avoid death; if he does so, he does not count as having suffered any of the listed effects from his Perils roll.",
      "source": "Ascension"
    },
    {
      "tier": 2,
      "name": "Scourge of Heretics",
      "id": "scourge_of_heretics",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Must not possess the 'Hunter of Aliens' or 'Slayer of Daemons' Talents"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Social"
      ],
      "alignment": "Khorne",
      "benefit": "The character gains a +10 to his Weapon Skill and +2 to melee weapon Damage when combating heretics. It is up to the GM to decide exactly which enemies count as heretics.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Servo-Harness Integration",
      "id": "servo_harness_integration",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants",
        "Mechadendrite Use (Utility)"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has had his implanted systems integrated with a many-armed servo harness, allowing him to use its pincer-arms and weapon arrays as if they were extra limbs of his body. The character may be fitted with and use a Servo-harness and may use weapons fitted to the harness in which he is proficient.",
      "source": "Deathwatch"
    },
    {
      "tier": 3,
      "name": "Shield Wall",
      "id": "shield_wall",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ambidextrous",
        "Weapon Skill 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "When armed with a shield, the character can re-roll one failed Evasion test to Parry an attack per round.",
      "source": "Enemies Beyond"
    },
    {
      "tier": 1,
      "name": "Siegecraft",
      "id": "siegecraft",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Intelligence",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "If he has time to prepare the battlefield (1d5 hours at a minimum), the character may improve the Armour Points of a piece of cover by a number equal to his Intelligence Bonus. At the GM's discretion, this effect may apply to a number of pieces of cover equal to the twice the character's Intelligence Bonus. This bonus stacks with that of the Siege Master ability, but the bonus points are added after any effect from Siege Master. The effects of this Talent cannot be applied more than once to any piece of cover, and the effects are permanent.",
      "source": "Rites of Battle"
    },
    {
      "tier": 1,
      "name": "Skilled Rider",
      "id": "skilled_rider",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Operate (any) or Rank 2 Survival"
      ],
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever the character would be thrown from or tossed about within his vehicle (or Mount)*, he makes an Ordinary (+10) Agility test. If he succeeds, the character may choose to either land safely on his feet or retain in his original position in the vehicle. In addition, once per round the character can attempt an Ordinary (+10) Agility test to Mount or Dismount a vehicle as a Free Action",
      "source": "Enemies Without"
    },
    {
      "tier": 2,
      "name": "Slayer of Daemons",
      "id": "slayer_of_daemons",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Must not possess the 'Scourge of Heretics' or 'Hunter of Aliens' Talents"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Social"
      ],
      "alignment": "Imperial",
      "benefit": "Vowing to battle the beyond, the character has marked the warp-spawned for death. The character gains a +10 to his Weapon Skill and +2 to melee weapon Damage when combating daemons.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Solid Projectile Weapon Expertise",
      "id": "solid_projectile_weapon_expertise",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 35",
        "Weapon Training (Solid Projectile)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When this character clears a jam from any Solid Projectile weapon (such as an autopistol, a shotgun, an autogun, or a vanquisher battle cannon), he may also reload the weapon as a Free Action as part of the Action to unjam it. Additionally, only one Round from the weapon's current clip is lost instead of the entire clip",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Solid Projectile Weapon Mastery",
      "id": "solid_projectile_weapon_mastery",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 45",
        "Solid Projectile Weapon Expertise"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When this character fires a Solid Projectile weapon (such as an autopistol, a shotgun, an autogun, or a vanquisher battle cannon), it gains the Proven (X) Quality, where X is equal to half of his Ballistic Skill Bonus (rounded up).",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Sound Constitution",
      "id": "sound_constitution",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Toughness",
        "General"
      ],
      "alignment": "Nurgle",
      "benefit": "The Acolyte gains an additional wound. He can purchase this talent additional times up to twice his Toughness bonus. When he gains this talent multiple times, note the number of times it has been taken after the talent, such as Sound Constitution (3).",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Special Operations Training",
      "id": "special_operations_training",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "The character selects one of the options below.\n\n* __Specialist:__ Field Command: All Storm Troopers are trained to use their initiative and be aggressive on the battlefield. Particularly talented Troopers are singled out for field commands and given the extra training and skills to lead men in battle. One per combat, the Storm Trooper may, as a Full Action, choose to direct allies within range of his voice (this could also include those who can hear his voice over a vox or via psychic means) with a successful Challenging (+0) Command Test. Those under his direction gain a +2 to their Initiative scores and may reroll failed Ballistic Skill Tests (for using personal weapons, not those on a vehicle or any other outside source) for that turn. \n\n* __Specialist:__ Drop Trooper: Storm Trooper regiments use a variety of vehicles to both carry them into battle and fight once there. Storm Troopers are especially skilled in aerial insertions and extractions using Valkyrie assault carriers. The Storm Trooper gains +10 to all Operate Skill Tests. When using a grav-chute, the Storm Trooper automatically passes all tests to manually deploy his chute. \n\n* __Specialist:__ Recon Storm: Troopers are frequently used as recon and covert assault troopers (one of the reasons they are favoured by the Inquisition). Often, entire Storm Trooper companies receive specialised training in the art of stealth and infiltration. The Storm Trooper gains +10 to Stealth, and +2 to Initiative. However, any armour with more than 7 AP negates these benefits.",
      "source": "Ascension"
    },
    {
      "tier": 3,
      "name": "Sprint",
      "id": "sprint",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Slaanesh",
      "benefit": "The Acolyte moves at great speeds, and when taking a Full Move action can move an extra number of metres equal to his Agility bonus. Additionally, whenever he takes a Run action, he may move double the normal distance. If he did so in the previous round however, he suffers 1 level of Fatigue.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Stalwart Defence",
      "id": "stalwart_defence",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "The Character may spend a Fate Point as a Full Action to adopt a Stalwart Defence. While adopting this condition, the character may not move and may not Dodge. He may make a Parry reaction against all successful strikes against him, and all Damage he suffers is reduced by -2. Furthermore, the character's enemies gain no benefits for outnumbering the character in close combat. These effects last until the character chooses to end his Stalwart Defence or until he is rendered incapable of fighting.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Stealth Sniper",
      "id": "stealth_sniper",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Stealth"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character makes a Standard Ranged Attack Action or Ranged Called Shot Action against an enemy while he is in Cover or otherwise Concealed, he may make a Challenging (+0) Opposed Stealth Test, opposed by the Awareness Skill of any foes who might hear or see the shot. If he succeeds, he remains hidden from his enemies. The GM should adjust the Difficulty of the character's Stealth Test or the enemy's Awareness Test depending on the noise made by the weapon the character uses and any other environmental factors.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Step Aside",
      "id": "step_aside",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 40",
        "Dodge or Parry"
      ],
      "aptitudes": [
        "Agility",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "He can make an additional Evasion attempt (either a Dodge or a Parry) once per round. In effect, this gives him a second Reaction that can only be used for Dodge or Parry attempts, allowing two Dodges, two Parries, or a Dodge and a Parry in each turn. However, he can still only attempt a single Dodge or Parry against each individual attack",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Stirring Rhetoric",
      "id": "stirring_rhetoric",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 45",
        "Heroic Inspiration"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Once per game session when using the Inspire Special Use of the Command Skill, this character may spend a Fate Point. If he does, the each character affected by his Command Test gains an additional +5 bonus to his next Skill or Characteristic Test for every Degree of Success this character scores on the Command Test (to a maximum of a +30 bonus in total)",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Storm of Iron",
      "id": "storm_of_iron",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 45",
        "Weapon Training (any ranged)"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When the character deals Damage to a target with a semi-auto burst or a full-auto burst, the character may allocate his extra hits to any other target within five metres, instead of the usual two metres. When the character deals Damage to a Horde with a semi-auto burst, a full-auto burst, or a weapon with the Spray or Blast Qualities, they deal additional Damage to the Horde equal to half his Ballistic Skill Bonus. This additional Damage is applied once per attack, not once per hit.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Storm Trooper Training",
      "id": "storm_trooper_training",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Las Weapon Expertise",
        "Ballistic Skill 50"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Defence"
      ],
      "alignment": "Unaligned",
      "benefit": "Storm Troopers train to proficiency with almost every weapon and piece of military equipment used in the Imperium's militant forces. However, they are especially proficient in their signature weapons and equipment; hellguns and carapace armour. When a Storm Trooper is firing a hellgun or hellpistol, these weapons gain the Tearing Quality as a result of constant practice with these guns. In addition, Storm Troopers wearing Imperial-issue carapace armour do not count that armour's weight against their carry limits. Storm Troopers are skilled with wearing and maintaining their carapace armour — therefore, a Storm Trooper's carapace armour always counts as one step higher in Craftsmanship. For example, a Storm Trooper that dons a set of common craftsmanship carapace armour gains the benefit of wearing good-craftsmanship carapace armour.",
      "source": "Ascension"
    },
    {
      "tier": 1,
      "name": "Street Fighting",
      "id": "street_fighting",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 30"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When armed with a knife (powered, chain or otherwise), similar small weapon, or simply armed with his bare hands, he adds half his Weapon Skill Bonus to any Critical Damage he inflicts.",
      "source": "Only War"
    },
    {
      "tier": 1,
      "name": "Strength in the Creed",
      "id": "strength_in_the_creed",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ministorum Priest (or Adeptus Ministorum background)* or 10+ Insanity Points"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Imperial",
      "benefit": "Whenever this character spends a Fate Point to gain a +10 bonus on a Test before rolling, he gains an additional +20 bonus (to a total of a +30 bonus) instead.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Strength of the Forge",
      "id": "strength_of_the_forge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40",
        "Willpower 35"
      ],
      "aptitudes": [
        "Toughness",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "Acclimation to oppressive conditions, homeworld genetics, or perhaps both have enabled to character to carry on when those of lesser constitution would collapse and give up. Whenever the character would gain a level of Fatigue, except from psychic powers, they may make a Challenging (+0) Toughness test. If successful, they do not gain a level of Fatigue. Additionally, the character takes half as long to recover from Fatigue as normal.",
      "source": "The Lathe Worlds"
    },
    {
      "tier": 2,
      "name": "Strong Minded",
      "id": "strong_minded",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 30",
        "Resistance (Psychic Powers)"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Tzeentch",
      "benefit": "He can re-roll failed Willpower tests to resist any psychic powers that affect his mind. This talent does not affect psychic powers that have a physical effect, such as Smite or Assail.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Subversive Programming",
      "id": "subversive_programming",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "As a Half Action, the character may attempt to command a creature with the Machine Trait and an Intelligence of 20 or less. Make an Opposed Challenging (+0) Tech-Use vs. Willpower Test. If he succeeds, the creature must follow the character's commands for the following Round. The character may continue to maintain control by spending a Half Action in subsequent Rounds. If he chooses to do this, he must make another opposed Test after four Rounds to maintain the link. The commands must be simple and achievable in one round. Some examples include “Flee,” “Fall,” and “Attack the closest target.”",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 3,
      "name": "Suffer Not the Work of Heretics",
      "id": "suffer_not_the_work_of_heretics",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Hatred (any one)",
        "Adeptus Ministorum background or 20+ Insanity Points"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Imperial",
      "benefit": "When attacking an enemy for whom he possesses an appropriate Hatred Talent, or a vehicle, structure or object crafted by such an enemy, he increases the Penetration of all attacks by an amount equal to his Willpower Bonus. If the character possesses the Inspire Wrath Talent, he passes this benefit along with any Hatred Talents when using it. Characters so affected gain benefits based on the Willpower Bonus of the character who inspired them.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "Superior Chirurgeon",
      "id": "superior_chirurgeon",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Medicae skill"
      ],
      "aptitudes": [
        "Intelligence",
        "Fieldcraft"
      ],
      "alignment": "Nurgle",
      "benefit": "He gains a +20 bonus on all Medicae skill tests. When providing first aid, he ignores the penalties for Heavily Damaged patients and only suffers a -10 penalty for those suffering Critical damage.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Superior Minion",
      "id": "superior_minion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 55",
        "Influence 60"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "Through various means, the character has acquired a Superior Minion. Such a Minion may be almost as powerful as the character, and is capable of improving as its abilities are tested in the pursuit of the character's designs. The character must be wary, for such creatures may be loath to accept orders. See Minions for details.",
      "source": "Tome of Excess"
    },
    {
      "tier": 2,
      "name": "Surefoot Wayfinder",
      "id": "surefoot_wayfinder",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Survival"
      ],
      "aptitudes": [
        "Perception",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "The character ignores penalties to his Movement Rate due to thick terrain, although particularly dangerous environments, such as burning buildings, can still penalise him at the GM's discretion. He may also re-roll one failed Test for the Tracking Special Use of the Survival Skill per Game Session.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Survival Master",
      "id": "survival_master",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40"
      ],
      "aptitudes": [
        "Perception",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "The character may re-roll all failed Survival tests",
      "source": "Into the Storm"
    },
    {
      "tier": 3,
      "name": "Survivor",
      "id": "survivor",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Special",
        "Knowledge"
      ],
      "alignment": "Nurgle",
      "benefit": "When the character takes this Talent he chooses a single Characteristic from: Strength, Toughness, Agility, Intelligence, Perception, Willpower or Fellowship. This represents some situation in which the character was tested, such as surviving a virulent poison with Toughness or solving an alien riddle with Intelligence. Once per game session the character may call on his experience to remove all negative modifiers from a test associated with his chosen Characteristic, in effect making it a Challenging (+0) Test plus any bonuses that might apply.\n\nAptitude 1 matches the Characteristic chosen.",
      "source": "Rites of Battle"
    },
    {
      "tier": 2,
      "name": "Swift Attack",
      "id": "swift_attack",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 30"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Khorne",
      "benefit": "He can make the Swift Attack action.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Swift Suture",
      "id": "swift_suture",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 1 Medicae"
      ],
      "aptitudes": [
        "Intelligence",
        "Finesse"
      ],
      "alignment": "Nurgle",
      "benefit": "Whenever this character succeeds on a Test to use the First Aid Special Use of the Medicae Skill, he also ends the Blood Loss Condition if the patient is suffering it.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Tainted Psyker",
      "id": "tainted_psyker",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating",
        "Rank 2 Psyniscience",
        "10 Corruption"
      ],
      "aptitudes": [
        "Psyker",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "When making a Focus Power test, the character may gain a number of Corruption points up to his psy rating. For each point he gains in this way, he gains a +10 bonus to the Focus Power test but adds +5 to rolls on Table 6-2: Psychic Phenomena",
      "source": "Enemies Within"
    },
    {
      "tier": 2,
      "name": "Take Them Alive",
      "id": "take_them_alive",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 35",
        "Precision Killer"
      ],
      "aptitudes": [
        "Perception",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When the character makes a Called Shot attack against an enemy, he may choose to reduce the damage he inflicts after reduction by the target's Armour or Toughness Bonus by a number equal to his Perception Bonus, and inflict a level of Fatigue for each point of damage reduced in this way. In addition, the character's familiarity with nonlethal weaponry means that enemies do not gain the usual bonuses from armour to resist the stunning effect of Shocking weapons, and suffer a -10 penalty to avoid or escape any attack with the Snare quality.",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 1,
      "name": "Takedown",
      "id": "takedown",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "Weapon Skill",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When making a Standard Attack or Charge action, the Acolyte can declare that he is attempting a takedown his target. He then rolls to hit (using his Weapon Skill) as normal, applying all the regular modifiers for the attack action. If the character hits and would have done at least 1 point of damage (after reduction for Armour and Toughness), no wounds are caused. Instead, the opponent must make a Challenging (+0) Toughness test or be Stunned for 1 Round and knocked Prone. In addition, when performing a Stun Action, the character does not suffer the normal -20 penalty to his Weapon Skill.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Talented",
      "id": "talented",
      "specialist": true,
      "specialisations": [
        "Any Skill"
      ],
      "prerequisites": [
        "Rank 1 in Skill"
      ],
      "aptitudes": [
        "General",
        "Knowledge"
      ],
      "alignment": "Unaligned",
      "benefit": "Choose any one of the character's Skills, and gain a +10 bonus to tests made using the Skill.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Tank Hunter",
      "id": "tank_hunter",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When making a ranged attack against a vehicle, the character adds his Ballistic Skill Bonus to the Penetration value of his weapon",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Target Selection",
      "id": "target_selection",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 50"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "He can shoot into melee with no penalty. If he also makes an Aim action beforehand, he prevents any chance of hitting friendly targets as well",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Tear 'em Ter Bits!",
      "id": "tear_em_ter_bits",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ogryn",
        "Strength 50"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per encounter, when this character inflicts Critical Damage on an enemy by dealing Damage in excess of the enemy's Wounds, he may spend a Fate Point to instantly slay his foe in an exceptionally gruesome manner. The enemy may be literally pulled apart by the Ogryn's blows, cleaved into bits, or dismembered in some other terrifying display of might. He gains the Fear (2) Trait against all foes who witnessed this savage display until the end of the encounter.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Tech-Tinker",
      "id": "tech_tinker",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35",
        "Tech-Use"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per day as a Full Action, the character can increase the power of a piece of technology which is neither a weapon nor protective device. This, in effect, increases its function by 50%, be it the range of the signal it can broadcast or the amount of items it can fabricate. This boost only lasts for the duration of a single scene or encounter (this amount of time may be extended at the GM's discretion). The GM always has final say in the exact effects of a boosted piece of tech.",
      "source": "Ascension"
    },
    {
      "tier": 1,
      "name": "Technical Knock",
      "id": "technical_knock",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 30"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per round, he may attempt to unjam a gun as a Half Action rather than a Full Action. He must touch the weapon to make use of this talent.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Telepathica Conditioning",
      "id": "telepathica_conditioning",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Sanctioned Psyker",
        "Willpower 40"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Unaligned",
      "benefit": "The character selects one of the options.\n\n* __Psychic Soldier:__ Once per combat, the Psyker may use a psychic power that normally requires either a Full Action or a Half Action as a Free Action. He is still limited to only one action with the Attack subtype and one action with the Concentration subtype \n\n* __Untainted Core:__ Once per turn, the Psyker may ignore the effects from a single source that affects either his chances of invoking the perils of the warp or rolls he makes on the perils of the warp table (including psychic phenomena). If affected by multiple sources of disruption, the Psyker must choose which to ignore at the start of his turn. Note that this ability does not overcome sources that block psi powers, such as Untouchables, but only those that disrupt them and make them more unstable. \n\n* __A Ghost in the Warp:__ Once per game session, the Psyker can leave no signature or trace when using psychic powers and can choose for his powers to have no visual or auditory effects (unless these would be required for the power to function). In all other respects, his powers function as normal. At the GM's discretion, he may decide that some powers are so potent or destructive that they cannot be hidden by this ability.",
      "source": "Ascension"
    },
    {
      "tier": 3,
      "name": "Temple Assassin",
      "id": "temple_assassin",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 40",
        "Willpower 30"
      ],
      "aptitudes": [
        "Agility",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "The character selects one of the options below as this talent's specialization. A character may NOT select this talent more than once, even if choosing a different specialization. \n\n* __Killing Sprint:__  Assassins are taught to kill swiftly and without mercy. Unlike Death Cultists, a Temple Assassin does not revel in the blood and pain of his victims, but only cares that they are dead. If the Assassin kills (reduces to 0 wounds or less) an opponent in his turn, then he gains either a +10 to WS (if the kill was made with a melee weapon) or +10 to BS (if the kill was made with a ranged weapon) in his following turn against a new target. This can continue if the Assassin continues to make a kill each turn up to a maximum of +30 to either WS or BS. \n\n* __Conditioning:__  An Assassin's mind is his fortress, shielded against those that would try and subvert him from his mission. Fellowship Tests and Skill Tests based on Fellowship have no effect on a Assassin. In addition, any attempt to control or influence the Assassin using tech, psychic powers, or drugs either imposes a -20 penalty to the aggressor or a +20 bonus to the Assassin to resist. The GM has the final say in what powers and effects can be affected by this trait.",
      "source": "Ascension"
    },
    {
      "tier": 2,
      "name": "The Bigger They Are",
      "id": "the_bigger_they_are",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ballistic Skill 40"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When making a single-shot ranged attack against a target with a Size Trait with a value greater than his own, the character may modify his Hit Location result by an amount up to twice the value of the target's Size Trait.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 3,
      "name": "The Emperor Protects",
      "id": "the_emperor_protects",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Pure Faith"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Imperial",
      "benefit": "The power of the Emperor flows through the character, protecting the faithful and emboldening them to heroism in the face of terrible things. By spending a Fate Point, the character grants himself and a number of allies equal to his Willpower Bonus immunity to the effects of Fear and Pinning. Additionally all ranged or close combat acts made against the character and the specified allies are at a -10 modifier. These benefits last for the duration of the encounter. By burning a Fate point, the character may allow an ally (never himself ) to resist the effects of any single attack, effectively allowing the ally to emerge unscathed as if by a miracle. The Fate point must be burnt once the attack has hit but before Damage has been rolled.",
      "source": "Rogue Trader"
    },
    {
      "tier": 3,
      "name": "The Flesh is Weak",
      "id": "the_flesh_is_weak",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "2+ Cybernetics",
        "Rank 2 in Tech-Use"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "This character gains the Machine (X) Trait, where X is equal to half of the number of Cybernetics he possesses (rounded up), to a maximum of an amount equal to his Toughness Bonus. If he gains a new Cybernetic, the value of the Trait increases to reflect the new Cybernetic. Note that this only applies to Cybernetics such as bionic replacement limbs and organ replacements, sub-systems, and mechadendrites, and not to Traits and Talents that grant similar effects.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Thunder Charge",
      "id": "thunder_charge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 50"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When he makes a Charge action, he can barrel through enemies to get to his target. The character makes an Opposed Strength test against each foe in his way (those who his movement would take him past or through). Each foe that loses the Opposed test is knocked Prone. After resolving these Opposed tests, the character's Charge action resolves against his original target as normal",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Thunderous Castigation",
      "id": "thunderous_castigation",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 3 Command",
        "Rank 3 Scholastic Lore (Imperial Creed)"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Imperial",
      "benefit": "The character may choose to orate against his enemies as a Free Action immediately after rolling for Initiative by making a Hard (-20) Command Test. If he succeeds, enemies treat the character as if he possess the Fear (1) Trait for the remainder of the combat. The value of the Fear Trait granted to the character is increased by 1 for every three degrees of success scored on the Command Test beyond the first, to a maximum of Fear (3).",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Tireless",
      "id": "tireless",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40",
        "Willpower 35"
      ],
      "aptitudes": [
        "Willpower",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "This character ignores the -10 penalty to all Tests from Fatigue. He still suffers any other effects of Fatigue as normal.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Total Recall",
      "id": "total_recall",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 30"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "Mental conditioning or cranial augmentation enables the character to record and recall great amounts of information, effectively granting them a perfect memory. The character can automatically remember trivial facts or pieces of information the character might feasibly have picked up in the past. When dealing with more detailed, complex, or obscure facts, such as the exact layout of a defence network, the GM may require a successful Intelligence Test to recall the information",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Trademark Item",
      "id": "trademark_item",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 40",
        "Rank 2 Command"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "When this Talent is taken, the character must select an item to be his trademark item. This can be an item already in the character's possession, or, with the GM's permission, the character can obtain a new item of otherwise trifling significance with no Requisition Test required. As long as the character's Trademark Item is prominently displayed, he gains an additional Degree of Success all successful Interaction Tests when dealing with members of his regiment, and possibly with other Imperial forces, at the GM's discretion. If the character is able to issue Sweeping Orders, once per encounter, he may make Difficult (-10) Command Test to issue one additional Sweeping Order during his Turn. The second Sweeping Order must be a different Order from the first. The character is quite attached to his Trademark Item, and must pass a Challenging (+0) Willpower Test in order to willingly abandon it, even in the face of life-threatening danger. If the character's Trademark Item is somehow lost or destroyed, the character can select a new Trademark Item after a suitable mourning period, as determined by the GM.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "True Grit",
      "id": "true_grit",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Toughness 40"
      ],
      "aptitudes": [
        "Toughness",
        "Defence"
      ],
      "alignment": "Nurgle",
      "benefit": "Whenever he suffers Critical damage (after reduction for Armour and Toughness), reduce the amount by his Toughness bonus (to a minimum of 1 damage)",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Two-Handed Weapon Expertise",
      "id": "two_handed_weapon_expertise",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 50",
        "Strength 50"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Strength"
      ],
      "alignment": "Khorne",
      "benefit": "When wielding any two-handed melee weapon, the character ignores the Unbalanced Quality and treats weapons with the Unwieldy Quality as being Unbalanced instead. This Talent may be purchased twice; if a Character does so, then the character ignores the Unwieldy Quality and treats weapons with the Unbalanced Quality as having the Balanced Quality instead.",
      "source": "Honour the Chapter"
    },
    {
      "tier": 3,
      "name": "Two-Weapon Master",
      "id": "two_weapon_master",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 45",
        "Ambidextrous",
        "Ballistic Skill 40 or Weapon Skill 40",
        "Two-Weapon Wielder (Melee, Ranged)"
      ],
      "aptitudes": [
        "Finesse",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When armed with two single-handed weapons (such as a pistol or sword in either hand), he ignores the -20 penalty for Two-Weapon Fighting",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Two-Weapon Wielder",
      "id": "two_weapon_wielder",
      "specialist": true,
      "specialisations": [
        "Melee",
        "Ranged"
      ],
      "prerequisites": null,
      "aptitudes": [
        "Weapon Skill/Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When armed with two one-handed weapons (ether melee or ranged weapons), after making a Half Action attack (this can be a Single Attack, a Swift Attack, or a Lightning Attack with a melee weapon, or it can be a single shot, semi-auto burst, or full auto burst with a ranged weapon), he can make a single additional Half Action attack following the same restrictions with the other weapon as a Free Action. In effect, this allows him to attack twice in a round, once from each of his weapons. Both of these attacks count as being part of the same Half Action, and both tests made to attack with the weapons suffer a -20 penalty. This talent can be taken twice, each time with a different specialisation (melee or ranged). If he possesses both talents, then he can fight with one melee and one ranged weapon. When this talent is taken with the melee focus it counts as having the Weapon Skill and Finesse aptitudes, and when it is taken with the ranged focus it counts as having the Ballistic Skill and Finesse aptitudes",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Tyranid Hunter",
      "id": "tyranid_hunter",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Hatred (Tyranids)",
        "Hunter of Aliens"
      ],
      "aptitudes": [
        "Offence",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "The character gains a bonus degree of success on all Forbidden Lore (Xenos) and Tactics (any) Tests that pertain specifically to fighting the Tyranids, and when in combat with Tyranid creatures, any Fate Point the character spends grants two of the possible benefits (which must be different benefits—you cannot select the same benefit twice).",
      "source": "The Jericho Reach"
    },
    {
      "tier": 2,
      "name": "Tyrant",
      "id": "tyrant",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Any Minion Talent",
        "Fellowship 35"
      ],
      "aptitudes": [
        "Fellowship",
        "Leadership"
      ],
      "alignment": "Unaligned",
      "benefit": "The Character ensures Loyalty through a fearful reputation and the actions to back it up. The base Loyalty of the Character's Minions is equal to the Character's Influence, rather than his Fellowship. This value can be modified by Traits and Talents as usual.",
      "source": "Tome of Excess"
    },
    {
      "tier": 2,
      "name": "Unarmed Specialist",
      "id": "unarmed_specialist",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Ambidextrous",
        "Agility 35",
        "Weapon Skill 35"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "He gains the Deadly Natural Weapon trait, and counts as armed even when facing weapon-wielding opponents while barehanded. While fighting barehanded, he can also re-roll the damage he inflicts.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Unbowed and Unbroken",
      "id": "unbowed_and_unbroken",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Willpower"
      ],
      "alignment": "Nurgle",
      "benefit": "Choose any one of the character's Skills, and gain a +10 bonus to tests made using the Skill.",
      "source": "Deathwatch"
    },
    {
      "tier": 3,
      "name": "Underfoot Assault",
      "id": "underfoot_assault",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 40",
        "Weapon Skill 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Khorne",
      "benefit": "When making a melee attack against a foe with a Size Trait with a value greater than his own, this character imposes a penalty to any Parry or Dodge Tests made to avoid his melee attacks equal to ten times the difference in the value of their Size Traits.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Unfaltering Redemption",
      "id": "unfaltering_redemption",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Willpower 30"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "When the Explorer spends a Fate Point to re-roll a Weapon Skill, Ballistic Skill, or Opposed Willpower Test against a psyker, he adds a bonus equal to his Willpower Bonus multiplied by five (to a maximum of +30) to the result of the re-roll.",
      "source": "The Navis Primer"
    },
    {
      "tier": 2,
      "name": "Unfazeable",
      "id": "unfazeable",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35",
        "Forbidden Lore (any one)"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "In his studies, a Sage often comes across things that can break the minds of mortal men. For this reason, many Sages become adept at “reading without reading” and gleaning knowledge from texts without looking too closely at the writings. The Sage no longer gains any Insanity Points or Corruption Points from indirect sources, such as reading books or similar texts. The GM, of course, may still rule that particularly vile or warp-touched tomes have other effects on the Sage.",
      "source": "Ascension"
    },
    {
      "tier": 3,
      "name": "Unhallowed Discovery",
      "id": "unhallowed_discovery",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 40",
        "Integrated Psychically-Charged Xenos Artefact"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character gains Psy Rating 1 (or his Psy Rating increases by 1 if he already has a Psy Rating), acting as an Unbound psyker. When a character gains this Talent, he immediately learns a single Psychic Power (this power should be based on the nature of the artefact. Player and GM should work together to choose an appropriate power). The character may ultimately incorporate as many as three such Artefacts into his body, each giving access to a particular Power as determined by the player and the GM. If the artefact is ever removed, the Explorer loses the psychic power until such time as the artefact is returned to him (provided he survives having it torn out of his cyber-mantle). Each time he acquires or replaces an artefact, however, and each time he rolls Perils of the Warp, he gains 1d5 Corruption Points and suffers 1d5 Energy Damage not reduced by Armour or Toughness Bonus in addition to any other results as the strange device gains an ever greater hold over his augmented mind and body.",
      "source": "The Navis Primer"
    },
    {
      "tier": 3,
      "name": "Unknown and Unnamed",
      "id": "unknown_and_unnamed",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Infused Knowledge",
        "Intelligence 50",
        "Forbidden Lore (any one)"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "Such is the vast amount of data the character has gathered during their studies that they are likely to know at least a little about almost anything. The character may apply the bonus from Infused Knowledge to Forbidden Lores as well (including counting as having rank 1 in them all)",
      "source": "Ascension"
    },
    {
      "tier": 1,
      "name": "Unremarkable",
      "id": "unremarkable",
      "specialist": false,
      "specialisations": null,
      "prerequisites": null,
      "aptitudes": [
        "General",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Something about the character's face just doesn't stick in people's memories. The character can more easily blend into crowds or pass themselves off as a nobody. Any attempts to recall the character's face or spot him in a crowd suffer a -20 penalty. In addition, the character gains a +20 when using the Deceive Skill to either convince someone they have never seen or met him before or if he is trying to appear harmless and ordinary. Naturally, this Talent doesn't work if the character wears distinctive clothes, armour, or carries unique weaponry. In a Social Conflict the character gains +20 in addition to any other modifiers when he is using the Deceive Skill in the Opposed Test. However, a character with this Talent must halve his Infamy reserve before the Social Conflict begins.",
      "source": "Only War"
    },
    {
      "tier": 2,
      "name": "Unstoppable Charge",
      "id": "unstoppable_charge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40",
        "Rank 2 Survival"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Fieldcraft"
      ],
      "alignment": "Khorne",
      "benefit": "When the character makes a melee attack as part of a Charge Action or a Crushing Charge Mounted Special Action, his attack gains the Felling (X) Quality, where X is equal to half of his Weapon Skill Bonus (rounded up). In addition, whenever this character makes a melee attack as part of a Crushing Charge Mounted Special Action, he deals additional Damage equal to his mount's Strength Bonus.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Unusual Companion",
      "id": "unusual_companion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 30"
      ],
      "aptitudes": [
        "General",
        "Social"
      ],
      "alignment": "Unaligned",
      "benefit": "Whenever this character receives a Comrade, he can choose for that Comrade to be a standard human Comrade, or to be an Ogryn Comrade, Ratling Comrade, or Servitor Comrade. Other requirements for acquiring Servitor Comrades still apply as normal",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Urge the Penitent",
      "id": "urge_the_penitent",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 Command",
        "Scholastic Lore (Imperial Creed)"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Imperial",
      "benefit": "The character gains a +10 bonus whenever he re-rolls a Test with a Fate Point after failing his initial attempt. He may spend a Reaction to pass this benefit to any ally spending Fate Points to re-roll a Test, as long as the ally is within line of sight and communication range",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Vengeful Protector",
      "id": "vengeful_protector",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 45",
        "Strength 45"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "Whenever an ally within 10 metres suffers Critical Damage because of an enemy, this character increases the Damage he inflicts with melee attacks by +X until the end of the encounter, where X is equal to the value of his Size Trait.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Versatile Pilot",
      "id": "versatile_pilot",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Agility 40",
        "Operate (any one)"
      ],
      "aptitudes": [
        "Agility",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "The character counts as having all Operate Skills at Rank 1 (Known) (basically they can drive or fly anything). If they wish to later improve their Operate Skills, these Advances must be bought using Experience Points (from Rank 1) as normal. Such is their skill they also add one Degree of Success to any successful Operate Tests.",
      "source": "Only War"
    },
    {
      "tier": 3,
      "name": "Versatile Shooter",
      "id": "versatile_shooter",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Sharpshooter",
        "Target Selection"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "When firing a single shot from a single Pistol, Heavy, or Vehicle weapon with the Accurate Quality and while benefitting from an Aim Action, this character treats that weapon as if it was a Basic weapon for the purposes inflicting additional Damage for additional Degrees of Success on his Ballistic Skill Test ",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 3,
      "name": "Veteran Comrade",
      "id": "veteran_comrade",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Comrade"
      ],
      "aptitudes": [
        "Leadership",
        "General"
      ],
      "alignment": "Unaligned",
      "benefit": "When a character selects this Talent, he must select one of his Comrades. That Comrade grants the character an additional +5 bonus to Ballistic Skill Tests when he participates in the Ranged Volley Order and an additional +5 bonus to Weapon Skill Tests when he participates in the Close Quarters Order. Additionally, this Comrade can participate in Veteran Orders. If the original Comrade for whom the character purchased this Talent perishes, its effects can be applied to another Comrade (be that a new Comrade or a current one) when the character has a chance to request reinforcements and observe a suitable period of mourning.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 1,
      "name": "Vigilant",
      "id": "vigilant",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 35"
      ],
      "aptitudes": [
        "Perception",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "When using the Overwatch Action, this character may use his Perception Characteristic instead of his Agility Characteristic when determining whether he or his triggering target takes an Action first, as well as for any Opposed Agility Tests that Overwatch calls for him to make",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Vile Intrusion",
      "id": "vile_intrusion",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Electro Graft Use",
        "Mechanicus Implants"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character is skilled at gaining access to the knowledge of the most sophisticated machine spirits, assailing them with scrap-code and malicious spirits of his own creation, until they break under the strain. The character gains a +20 bonus on all Tech-Use and Security Tests made to gain unauthorised access to an electronic system such as a Cogitator or an electronic lock, so long as the character can connect directly to it using his implants.",
      "source": "Hostile Acquisitions"
    },
    {
      "tier": 3,
      "name": "Vitality Coils",
      "id": "vitality_coils",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Implanted Potentia or Mechanicus Implants",
        "Potentia Coil Induction",
        "Toughness 45"
      ],
      "aptitudes": [
        "Toughness",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "The character has learned to feed additional power to his potentia coil through electoo inductors, and can supercharge it to maximum capacity to restore lost Wounds. Once per game session when in the presence of a suitable power source, such as a portable generator or the power plant of one of his regiment's fighting vehicles, he may make a Challenging (+0) Toughness Test as a Full Action. If he succeeds, he removes 1d5 Wounds, plus 1 Wound per additional Degree of Success he scores on the Test. He cannot remove Critical Damage this way. However, the restoration process is potentially volatile, and any irregularities in the power feed can have deadly consequences. If he fails the Test, he suffers 1 Damage ignoring armour and Toughness Bonus, plus 1 additional Damage for every three Degrees of Failure he scores on the Test.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 1,
      "name": "Void Tactician",
      "id": "void_tactician",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 35"
      ],
      "aptitudes": [
        "Ballistic Skill",
        "Offence"
      ],
      "alignment": "Unaligned",
      "benefit": "The character's ability to conceptualise three-dimensional space gives him an advantage in starship combat, granting a +10 bonus to Ballistic Skill Tests made to fire a starship's guns in combat.",
      "source": "Rogue Trader"
    },
    {
      "tier": 3,
      "name": "War Cry",
      "id": "war_cry",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 50",
        "Willpower 50",
        "Disturbing Voice"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Nurgle",
      "benefit": "The character may declare at the start of any of his turns that he is making a war cry as a Free Action. All creatures within a 50-metre radius treat the character as if he had a Fear Rating of 1 provided they can hear him (though they do not need to be able to see him) until the start of his next turn. While screaming his bloodcurdling war cry, the character may not communicate in any other way. Making a war cry is taxing however and at the end of any encounter in which it is used (even if only for a single turn) the character suffers a level of Fatigue",
      "source": "Black Crusade"
    },
    {
      "tier": 1,
      "name": "Warp Affinity",
      "id": "warp_affinity",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating",
        "Unsanctioned Psyker"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Tzeentch",
      "benefit": "When rolling for Psychic Phenomenon, the character may discard the die roll, gaining 1d5 Corruption Points, and then re-roll with no modifiers.",
      "source": "Deathwatch"
    },
    {
      "tier": 2,
      "name": "Warp Conduit",
      "id": "warp_conduit",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating",
        "Strong Minded",
        "Willpower 50"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Tzeentch",
      "benefit": "When Pushing, before rolling his Focus Power test the character may spend one Fate Point to add an additional 1d5 to the effective psy rating of the power. Channeling such vast amounts of power is dangerous, however, and so he adds +30 to rolls on Table 6-2: Psychic Phenomena when he makes as a result of this talent",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 3,
      "name": "Warp Lock",
      "id": "warp_lock",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Psy Rating",
        "Strong Minded",
        "Willpower 50"
      ],
      "aptitudes": [
        "Willpower",
        "Psyker"
      ],
      "alignment": "Tzeentch",
      "benefit": "Once per game session, he may ignore the Psychic Phenomena he has rolled (including the Perils of the Warp result on Table 6-2: Psychic Phenomena), completely negating its effects. Such rapid dislocation from the Warp, though, is stressful and traumatic to his mind. He suffers 1d5 Energy damage to the Head location (not reduced by Armour or Toughness) as a result, and cannot make any Focus Power tests or sustain other psychic powers until the beginning of his next turn.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Warp Sense",
      "id": "warp_sense",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Navigator Trait or Psy Rating",
        "Psyniscience",
        "Perception 30"
      ],
      "aptitudes": [
        "Perception",
        "Psyker"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character can use the Psyniscience Skill as a Free Action instead of as a Half Action. He can also passively detect psychic effects and entities without the need to actively seek them out. Whenever the character could detect such a Warp signature or a creature, the GM can allow him to make a Psyniscience skill test to detect it, in the same way he could use Awareness to spot an ambush without knowing it is there.",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Watchful for Betrayal",
      "id": "watchful_for_betrayal",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Perception 40",
        "Rank 1 Awareness",
        "Light Sleeper",
        "Paranoia"
      ],
      "aptitudes": [
        "Perception",
        "Fieldcraft"
      ],
      "alignment": "Unaligned",
      "benefit": "As long as you are conscious and your senses are not impaired (such as by drugs or a blindfold, the GM has final arbitration of this), you cannot be Surprised.",
      "source": "Into the Storm"
    },
    {
      "tier": 3,
      "name": "Weapon Intuition",
      "id": "weapon_intuition",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Exotic Weapon Training (Any)"
      ],
      "aptitudes": [
        "Intelligence",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "The character reduces the penalty for using a weapon without the proper training by 10.",
      "source": "Enemies Without"
    },
    {
      "tier": 1,
      "name": "Weapon Training",
      "id": "weapon_training",
      "specialist": true,
      "specialisations": [
        "Any Weapon Group",
        "Heavy"
      ],
      "prerequisites": null,
      "aptitudes": [
        "General",
        "Finesse"
      ],
      "alignment": "Unaligned",
      "benefit": "Use Weapon Group without penalty. The character can only use weapons with Class: Heavy without suffering the -20 penalty if he has both Weapon Training in the appropriate group and Weapon Training (Heavy). This talent can be taken more than once, each time with a different Specialisation. Note that a character without the Weapon Training (Low-Tech) talent operating a weapon that functions as a Low-Tech weapon in certain circumstances does not suffer this penalty, so long as he has the applicable Weapon Training talent for the weapon (Power for a power sword, for example)",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 1,
      "name": "Weapon-Tech",
      "id": "weapon_tech",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 in Tech Use",
        "Intelligence 40"
      ],
      "aptitudes": [
        "Intelligence",
        "Tech"
      ],
      "alignment": "Unaligned",
      "benefit": "Once per combat encounter, as a Free Action, this character may enhance any Melta, Plasma, Power, or Exotic weapon he is personally wielding. This increases the weapon's damage and penetration by an amount equal to the character's Intelligence bonus until the end of the round",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Web of Peers",
      "id": "web_of_peers",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Fellowship 40"
      ],
      "aptitudes": [
        "Fellowship",
        "Social"
      ],
      "alignment": "Slaanesh",
      "benefit": "Whenever the character meets an NPC for the first time he should roll 1d10. If the roll is equal or less than his Fellowship Bonus then the NPC has heard of him (for better or worse) and the character gains a +10 on all Fellowship Tests when dealing with the NPC or his organisation. At the GM's discretion this reputation might also have other consequences depending on the character's past actions. This bonus is cumulative with other Fellowship bonuses from talents such as Peer and Good Reputation.",
      "source": "Rites of Battle"
    },
    {
      "tier": 2,
      "name": "Whirlwind of Death",
      "id": "whirlwind_of_death",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Weapon Skill 40"
      ],
      "aptitudes": [
        "Weapon Skill",
        "Finesse"
      ],
      "alignment": "Khorne",
      "benefit": "As a Half Action, the character may make one Standard Attack action  with a melee weapon against a foe, plus one additional Standard Attack action with the same weapon targeting each other foe also engaged in melee combat with the character beyond the first (to a maximum number of attacks up to his Weapon Skill bonus).",
      "source": "Dark Heresy 2e"
    },
    {
      "tier": 2,
      "name": "Whispers",
      "id": "whispers",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Intelligence 45",
        "Fellowship 35"
      ],
      "aptitudes": [
        "Intelligence",
        "Fellowship"
      ],
      "alignment": "Tzeentch",
      "benefit": "Such is the character's reputation for having ears everywhere aboard the ship and a finely tuned network of invisible informants that the crew no longer even bothers to keep secrets from him. The character receives a +10 bonus to any Skill Test for Investigation or the Interview special use of the Inquiry Skill.",
      "source": "Rogue Trader"
    },
    {
      "tier": 2,
      "name": "Wild Charge",
      "id": "wild_charge",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 45",
        "Berserk Charge"
      ],
      "aptitudes": [
        "Strength",
        "Offence"
      ],
      "alignment": "Khorne",
      "benefit": "Whenever this character makes a Charge Action against a target with a Size Trait with a value smaller than his own, he may make a Challenging (+0) Opposed Strength Test against the target as a Free Action. If he wins the Opposed Test, his target suffers a -30 penalty to Tests to Dodge or Parry his attack.",
      "source": "Shield of Humanity"
    },
    {
      "tier": 2,
      "name": "Witch Finder",
      "id": "witch_finder",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 2 in Forbidden Lore (Psykers)",
        "Willpower 45"
      ],
      "aptitudes": [
        "Perception",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character counts as possessing the Psyniscience skill at Rank 1 (Known), even though he is not a psyker. Note that he cannot spend experience to gain additional ranks in the skill.",
      "source": "Enemies Within"
    },
    {
      "tier": 3,
      "name": "Wrath of the Righteous",
      "id": "wrath_of_the_righteous",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Pure Faith"
      ],
      "aptitudes": [
        "Willpower",
        "Offence"
      ],
      "alignment": "Imperial",
      "benefit": "The character is a killing angel, and he visits the Emperor's righteous fury on those who deny His dominion over the stars, or who profane that which is sacred. When making an attack, the character may spend a Fate Point to deal an additional 1d5 points of Damage. At any time while the Explorer is attacking, he may burn a Fate Point to trigger Righteous Fury on a single successful attack. The attack automatically deals the maximum Damage and triggers Righteous Fury",
      "source": "Rogue Trader"
    },
    {
      "tier": 1,
      "name": "Wrestler",
      "id": "wrestler",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Strength 30",
        "Athletics"
      ],
      "aptitudes": [
        "Strength",
        "General"
      ],
      "alignment": "Khorne",
      "benefit": "The character use his Athletics Skill in place of his Strength Characteristic for any Strength Test he is called to make as part of a Grapple. When he successfully uses the Damage Opponent Grapple Option, he deals additional Damage equal to the number of Degrees of Success by which he won the Opposed Test.",
      "source": "Hammer of the Emperor"
    },
    {
      "tier": 2,
      "name": "Xenosavant",
      "id": "xenosavant",
      "specialist": false,
      "specialisations": null,
      "prerequisites": [
        "Rank 3 in Forbidden Lore (Xeno - Any)"
      ],
      "aptitudes": [
        "Intelligence",
        "Knowledge"
      ],
      "alignment": "Tzeentch",
      "benefit": "The character can attempt any Forbidden Lore (Xenos) test in which he is not trained as an untrained skill test as if it were not a Specialist skill.",
      "source": "Enemies Without"
    }
  ]
}
