[
  "Addict: Whether it be Departmento Munitorum issue stimulants or deadly contraband substance, the character is addicted. If they go for long without their fix, they become irritable and irrational, and will go to extreme means to sate their addiction. ",
  "Affable: Ever willing to offer a hand to even the surliest of their squad mates, this character makes a point of trying to understand and assist their comrades. ",
  "Backwater: While they hail from the same planet as their squad mates, the character is from a location relatively separate from the main society on their homeworld. They do not quite fit in with many of their comrades, often misunderstanding idioms the others readily grasp. ",
  "Heroic: This character is known for their deeds of unfailing heroism. Tales of their exploits have spread throughout the entire regiment and beyond, and their reputation almost inevitably precedes her. ",
  "Bilious: Caustic and spiteful, this character reacts to most things in the same way: with cutting remarks, and not a trace of sympathy. This character is rarely liked by their squad-mates, but few wish to incite their impressive ire. ",
  "Boisterous: Loud and energetic, the character is always talking and joking with the other members of their squad, even when it might not be entirely appropriate. ",
  "Braggart: Arrogant and self-centred, the character cannot resist boasting to their squad-mates. They have told so many grandiose tales of their own accomplishments, no one can tell what is true and what is pure exaggeration. ",
  "Cocky: The character is incredibly confident in their own abilities, often to their detriment. They are quick to volunteer for a task, and is personally offended when people don't share the same confidence in their abilities. ",
  "Cook: Loved by everyone in their squad for their talents, the cook is always attempting to make new and interesting food, despite the constraints of Departmento Munitorum issue rations. ",
  "Coward: The character was not bred for the battlefield, and is unable to handle the incredible pressures of war. They are jumpy, and ducks and covers at the first sign of danger. ",
  "Death-Wish: Either because of guilt, trauma, or the constant and unrelenting emotional wear and tear of life in the Imperial Guard, this character has developed a desire for personal annihilation. This does not extend so far as suicidal tendencies, and the character might or might not even be consciously aware of their wish to die, but it drives their actions nonetheless. ",
  "Dissenter: Contrary and argumentative, the character commonly disagrees with the decisions of their commander. If they aren't brave enough to speak out directly, they are often heard grumbling to their squad-mates about their problems with the commander. ",
  "Dreamer: The character's imagination often gets away from her, wandering off into daydreams and away from reality. They are an idealist, and seems slightly disconnected from the horror of the reality that surrounds her. ",
  "Gambler: To find this character in the camp, merely find the nearest group of guardsmen playing Tarot. This character is addicted to games of chance, and whether they are a perennial winner or loser, they will rarely pass up a chance to gamble. ",
  "Green: The character is young and optimistic, not yet prepared for the horrors that await her on the battlefield. They are blissfully naive, often asking obvious questions of their more experienced squad-mates. ",
  "Incompetent: Inept and bumbling, the character seems to always screw up any task they are given. ",
  "Jaded: The character has seen the horrors of war, and will never be the same. they see their companions as nothing more than numbers on Departmento Munitorum forms, waiting to die on the battlefield. ",
  "Joker: Ready with a wisecrack for every situation, the character is always telling jokes, even in the most grim of situations. Their squad mates have become so used to their constant quips and puns that all they get in response are groans. ",
  "Lateral Thinker: Capable of impressive feats of ingenuity, especially under pressure, this character often offers unexpected solutions to the problems of the squad. Of course, some of their unorthodox ideas are better than others. ",
  "Loner: Quiet and introverted, the character prefers their own company to that of their squad-mates. ",
  "Loose Cannon: This character is always on the edge of behaving in ways that others deem “rash” or “unpredictable” in the name of success, and frequently ignores protocol in their pursuit of results. ",
  "Loyal: Dedicated to their friends, sometimes to a fault, this character places the utmost trust in one or more of their squad-mates, and gladly risks their life for their cause or well-being. ",
  "Lucky: This character has always been constantly (and sometimes infuriatingly) fortunate in at least one aspect of life. Whether this luck manifests itself in the character miraculously dodging falling shells, or merely in depriving their comrades of their lho sticks in games of Tarot, it has always been very consistent—at least so far. ",
  "Mentor: This character regards one or more members of the squad as their charges, and generally takes a parental, or at least supportive attitude towards those with less experience on the battlefield. ",
  "Leech: First to ask for a spare lho stick, last to offer one to a dying comrade, this character is a sponge, who leeches off of the rest of their squad for their material needs. ",
  "Never Bathes: Standards of cleanliness may vary from one contingent to another, but this character's personal hygiene is consistently below that stipulated by the official regulations of any known regiment of the Imperial Guard.",
  "Nihilist: This character embraces the emptiness that the Imperial Guard has worn in their soul. They care little for whether they or their squad mates live or die, overwhelmed by their insignificance in the face of an uncaring universe. ",
  "Numb: Accumulated suffering has left this character unable or unwilling to feel intense highs and lows of emotion, instead seeking inner peace in quiet acceptance of the fickle hand of destiny. ",
  "Oblivious: The more obvious something is to the rest of their squad, the less likely this character is to notice it. From basic social cues to rampaging Orks, this character has a real gift for overlooking what is right in front of her. ",
  "Obsessive: This character is possessed of a keen attention to some sort of detail, and frequently becomes fixated on things that others find trivial. Whether this manifests in a need to keep their kit pristine, clean every part of their lasgun three extra times per day, or constantly check the ceiling for incoming Genestealers, this character's squad-mates know her for one or more signature obsessions. ",
  "Old: This character has been around the block a few times, and, impressively, survived the trip. They may be a veteran of the regiment or merely a late recruit, but they have experiences (and likely complaints) not shared by the younger members of the squad. ",
  "Optimist: This character has an unshakeable, positive outlook on life. They are quick to reassure their squad mates that the trials they face are not so terrible or insurmountable (even if they actually are). ",
  "Pessimist: The flask of amasec is always half empty for this character, for bitter experience has taught her that the Emperor rarely has pleasant tasks for those who do their holy work on the battlefield. ",
  "Pious: The Emperor is not some distant deity to this character, but a guiding beacon whose presence they see everywhere they go. This character makes no distinction between their religious and their military duties, and has little tolerance for the vices or doubts of their squad-mates. ",
  "Psycho: This character is, simply put, violently deranged. Whether they spend their idle hours speaking lovingly to their knives, or is known through the regiment for hacking off an Ork's arm and clubbing the xenos to death with its own limb, their squad-mates all worry that one day, they might cease to distinguish between friends and foes... ",
  "Quiet: This character speaks very infrequently. Whether this is stoicism or shyness, nobody is quite sure, and they have remained silent on the matter. ",
  "Reckless: No risk is too great for this character. They might be driven by their love of the Emperor, a desire for glory, or a love of adrenaline coursing through their veins, but whatever the reason, this character often takes unnecessary risks. ",
  "Sarcastic: This character is possessed of a biting wit, and for better or for worse, makes little effort to contain it. They rarely offer a direct answer when a snide remark will do. ",
  "Sensible: This character consistently makes quick, no-nonsense decisions, usually to their benefit and that of the squad. their squad-mates often seek their advice for their personal and practical problems.",
  "Shell-Shocked: The trauma of war takes its toll on everyone, but some characters are more affected than others. Some past event left this character emotionally shattered, and while they might maintain a facade of normality, certain memories or triggers may cause their instability to bubble back to the surface. ",
  "Slacker: Hard work is anathema to this character, and despite the difficulty of maintaining a lazy lifestyle on the battlefield, this character is willing to try. While they cannot usually derelict their duties for fear of reprisal, this character is eager to pass on hard or unpleasant tasks to any squad-mates willing to take them up in their stead. ",
  "Slow: This character is does not jump to decisions quickly, and often spends a long time processing problems or challenges before taking any action. In the end, their decisions may be wise or they may be foolish, but their plodding pace might make their squad-mates wish they would simply make their choices faster. ",
  "Smooth: This character is more refined than many of their squad-mates. Most either admire this trait, or mock her for it. ",
  "Steely: This character has a piercing gaze, and is happy to let it do the talking for her most of the time. their squad-mates are exceptionally careful around her, for fear of their dark glare. ",
  "Strict: This character loves rules: the spirit, the letter, and everything in between. They are a stickler for the details of military regulations, and is quick to chastise their squad-mates for any laxity. ",
  "Superstitious: This character has a number of odd personal beliefs about the nature of the universe that diverge from those of their comrades, and is quick to see patterns in runs of bad luck, or offer explanations for strange phenomena that their squad-mates find outlandish. ",
  "Talkative: This character is extremely loquacious, and has trouble keeping silent. They voice their opinions and observations to anyone willing to listen. ",
  "Thief: According to this character, they merely partake in “aggressive sharing,” but most people would call her a thief, or any number of other names not suited to polite company. Any item left unattended is liable to mysteriously find its way into their kit bag. ",
  "Twitchy: For some reason, this character has trouble remaining still for long periods of time, short periods of time, or, in truth, any period of time. ",
  "Unlucky: This character has a history of extremely poor fortune, and they and their squad-mates have noticed this trend. Whether they accept their fate with quiet resignation, complains vociferously, or cheerily denies it, nobody in the squad thinks that their luck is likely to improve any time soon."
]
