{
  "title": "Drugs & Consumables",
  "info": "# Drugs & Consumables\n\n† Drug is Addictive",
  "component": "Equipment",
  "data": [
    {
      "name": "Recaf",
      "id": "recaf",
      "weight": "-",
      "availability": "Abundant",
      "description": "These common beverages offer a mild stimulant effect as well as pleasing taste. Hot recaf starts many days across the sector, from Imperial Guardsmen fighting on combat lines against the xenos threat to Acolytes striving to stay alert on an all-night vigil near a suspected cult hideout. Consuming recaf helps to hone senses dulled by exhaustion, and a dose removes one level of Fatigue from the character. The cumulative penalty to Toughness tests taken for consuming additional doses of recaf is -20 instead of the normal -10.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Tranq",
      "id": "tranq",
      "weight": "1 kg",
      "availability": "Abundant",
      "description": "The drug tranq covers an array of artificial, alcoholic chem-distillates brewed by underhive scum, criminals, and even Guardsmen desperate for respite from their wretched lots. It numbs the body and mind, which provides a very different feeling than being drunk on amasec, rotgut, or other spirits. Though similar in the end result, the effects of tranq are unpleasant, depressive, and require an acquired taste.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Ration Pack",
      "id": "ration_pack",
      "weight": "2 kg",
      "availability": "Plentiful",
      "description": "These small pouches contain concentrated or dehydrated foodstuffs suitable for one complete meal, and also include vitamin supplements, water puri-tabs, a protein bar, and heating pellets. Well-made packs are actually quite palatable, but even a master Ratling chef would have difficulty with the poor ingredients used in cheaper packs. Besides the benefits of holding off starvation, ration packs can help to keep an Acolyte effective in the field. Eating one or more ration packs (or other, comparable meals) during a period of rest of at least two hours removes one additional level of Fatigue",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Lho-Sticks",
      "id": "lho_sticks",
      "weight": "-",
      "availability": "Common",
      "description": "A mild narcotic, each stick contains dried and cured plant leaves that release a scented, stimulating smoke when ignited and inhaled through a cheap tube that burns away with the drug. As the leaves vary with the planet, lho-sticks can vary from world to world as well, often making them useful trade items.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Amasec",
      "id": "amasec",
      "weight": "1 kg",
      "availability": "Average",
      "description": "This refreshment is made from distilled wine or other fermented beverages, and is popular in many regions of the Imperium. It is usually a fine-quality product, with some well-aged vintages renowned across the sector for bouquet and flavour.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Manic†",
      "id": "manic",
      "weight": "-",
      "availability": "Average",
      "description": "A favourite of depraved princelings, Manic induces exactly the emotional state its name suggests. Feelings and sensations become exaggerated and uncontrolled as the user feels a sense of boundless energy.\n\nThe user adds +30 to any Willpower Tests, ignores Fatigue, and cannot be Stunned or Pinned. These effects last for 3d10 minutes.\n\nSide Effects: Once the drug wears off, the user falls unconscious for 1d5 hours unless he can pass a Hard (-20) Toughness Test.",
      "source": "Tome of Excess"
    },
    {
      "name": "Spur†",
      "id": "spur",
      "weight": "-",
      "availability": "Average",
      "description": "Spur is a powerful stimulant that increases overall stamina, ideal for nasty firefights or assaults where a quick burst of energy is literally a lifesaver, but with a serious depressive crash occurring afterwards. Each dose lasts 2d10 minutes, during which the user cannot be Stunned and takes no Fatigue. Afterwards however the character takes -20 Penalty for Toughness and Agility Tests for one hour, as well as one Fatigue level for every two they would have received while the drug was active. Spur is very habit forming, and tests to withstand Addiction must be taken at a -10 penalty.",
      "source": "Black Crusade"
    },
    {
      "name": "Stimm†",
      "id": "stimm",
      "weight": "-",
      "availability": "Average",
      "description": "A dose of stimm is enough to energise the weary and mask pain with short-term vitality, often enough to finally bring a protracted combat to a successful conclusion. Each dose lasts for 3d10 rounds. During this time, a character ignores any negative effects to his characteristics from damage, Critical damage, and Fatigue, and cannot be Stunned. When the stimm wears off, the character suffers a -20 penalty to Strength, Toughness, and Agility tests for one hour and gains one level of Fatigue. Stimm is Addictive.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Sweep†",
      "id": "sweep",
      "weight": "-",
      "availability": "Average",
      "description": "Sweep is a bizarre chemical commonly used to cure addiction to other drugs. Ironically, Sweep is itself quite addictive, and dulls the senses of those who consume it. \n\nA single dose of Sweep allows the user to remove any addictions he currently has. Note it does not eliminate any other side effects a drug may impart.\n\nSide Effects: The user suffers -10 to all Agility and Perception Tests for 1d5 hours. Sweep addictions are twice as hard to remove than other addictions. Sweep cannot be used to cure an addiction to Sweep.",
      "source": "Tome of Excess"
    },
    {
      "name": "Pan-Immune",
      "id": "pan_immune",
      "weight": "-",
      "availability": "Average",
      "description": "This highly potent medicinal compound serves to greatly enhance resistance to most forms of toxins, contaminations, micro-parasites and infection for a period of hours after its application, although repeated use can cause physiological damage. Pan-immune is found in the med-kits of many enforcer squads, tech-priests and other parties wishing to descend into the underhive or travel through hazard zones. The dose is usually applied by pressure-hypo directly to the neck and provides a +30 bonus on Toughness Tests made to resist toxins and diseases. The effects of a single dose lasts 1d5+1 hours. After the dose expires, the subject becomes Fatigued until he rests. The subject may immediately re-dose himself (which also negates the Fatigue), but each time this is done without a period of 8 hours rest, he must pass a Toughness Test or take a -10 penalty on Strength and Toughness Tests for 1 hour and permanently reduce Willpower by 1d5.",
      "source": "Inquisitor's Handbook"
    },
    {
      "name": "Desoleum Fungus",
      "id": "desoleum_fungus",
      "weight": "-",
      "availability": "Scarce",
      "description": "A hallucinogen made from unusual narcotic mushrooms that grow in ancient aquifers deep in a Hive's lower reaches, this drug has a disorienting, intoxicating effect that causes users to stumble about despite retaining the full spectrum of their senses. Depraved gangers particularly enjoy dosing themselves and then instigating extended gunfights, whirling about drunkenly and watching the havoc of their wayward shots. A dose of lasts 1d10 rounds, and the user immediately suffers 1 Fatigue as his body spins wildly. A character under the effects of the drug can take advantage of the skewed perspective this gives him: once during this time, he may invert the result of any 1d100 roll, exchanging the tens digit for the ones digit (turning a 73 into a 37 or a 91 into a 19, etc.).",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Slaught†",
      "id": "slaught",
      "weight": "-",
      "availability": "Scarce",
      "description": "This combat drug (also known as onslaught) is frequently taken to heighten awareness and improve reaction time. It literally speeds up the user, but causes neural and physiological damage with prolonged application. Taking a dose increases the user's Agility bonus and Perception bonus by 3 for 2d10 minutes. Note this does not increase the actual characteristic values. When the drug runs its course, the user must pass a Challenging (+0) Toughness test or suffer a -20 penalty to Agility tests and Perception tests for 1d5 hours. Slaught is Addictive.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Barrage†",
      "id": "barrage",
      "weight": "-",
      "availability": "Rare",
      "description": "Barrage enhances the users physical abilities to super-human levels for a short period of time but rapidly causes damage to the strained flesh.\n\nThe user gains Unnatural Strength (5) and Unnatural Toughness (5) for a number of rounds equal to his base Toughness Bonus. \n\nSide Effects: Once the effect has worn, off the user suffers 1d5 temporary Strength and Toughness Damage and becomes Stunned for 1d5 rounds.",
      "source": "Tome of Excess"
    },
    {
      "name": "De-Tox",
      "id": "de_tox",
      "weight": "-",
      "availability": "Rare",
      "description": "De-tox can negate most of the dangerous effects of other drugs or toxins. A dose immediately ends the effects, both positive and negative, for any chemicals the subject has inhaled, ingested, or injected, unless the item specifically states de-tox cannot work against it. Its use is extremely unpleasant, however, with common side-effects so extreme (excessive vomiting and diarrhoea being the mildest) that many would rather abide their current woes. Using de-tox, however, is both painful and debilitating, and can cause several unpleasant side effects such as vomiting, nose bleeds, and a great voiding of the bowels. Upon taking this drug, a character is Stunned for a number of rounds equal to 1d10 minus his Toughness bonus. A result of 0 or less means that the character suffers no ill effects.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Obscura†",
      "id": "obscura",
      "weight": "-",
      "availability": "Rare",
      "description": "Though often illegal, obscura is popular in many fighting units where combatants are eager for respite from constant battle, as well as among civilians seeking relief from the drudgeries of harsh life. Obscura-users enter a dream-like state for 1d5 hours (if required to engage in combat, consider them under the effects of a hallucinogen grenade). For 1d10 hours after the effects wear off, they enter a deep depression, unless another dose of obscura is taken. Obscura is Addictive.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Rose†",
      "id": "rose",
      "weight": "-",
      "availability": "Rare",
      "description": "Many a Chaos worshipper has had to depart from the strict confines of Imperial society as their desires for new sensations become too extreme. For such adventurers, Rose is the drug of choice, as it heightens all sensory input to a thrilling degree. The slightest touch becomes a razor's caress, the softest whisper a sonic dagger of delight. A dose of rose lasts for roughly three hours. During that time the user gains the Dark Sight Trait and gains a +20 bonus to Perception based Tests. If the user ever passes a Test by five Degrees or more, however, he becomes overloaded by sensations and must take a Challenging (+0) Willpower Test or become Stunned for 1d5 rounds.",
      "source": "Black Crusade"
    },
    {
      "name": "Spook†",
      "id": "spook",
      "weight": "-",
      "availability": "Rare",
      "description": "A highly-proscribed drug, spook creates and augments that most hazardous of effects: psychic abilities. Even the briefest of connections to the Warp and the Ruinous Powers that dwell within can allow daemonic incursions or worse, but in desperate instances, even these horrific effects are brushed aside. If a character without any psy rating takes a dose of this drug, he must successfully make a Challenging (+0) Willpower test or gain 1d5 Insanity points due to his mind being filled with terrifying visions of the Warp. If he succeeds, the user gains a psychic power from Table Spook Effects. The power lasts for 1d5 hours, and the user makes all Focus Power tests during this time as if he had a psy rating of 1. If a character with a psy rating of 1 or more uses spook, he must make a Challenging (+0) Willpower test. If he fails, he gain 1 Insanity Point and the drug has no further effects. If he passes, he adds 1 to his psy rating for the next hour. However, add +25 to rolls he makes on Psychic Phenomena. Spook is Addictive, and depending on the setting, its mere possession can incur intense and even lethal punishment from local authorities.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Frenzon†",
      "id": "frenzon",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Frenzon is a term for a number of combat drugs used in conscript and assault forces, especially in penal legions. A dose creates a fanatical and fearless state, leaving the user ready to fight any foe, no matter how suicidal it may seem. A character using frenzon gains the Frenzy talent and immediately becomes Frenzied. These effects last for the duration of the drug; a single dose of which lasts for 1d10 minutes. Frenzon is Addictive.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Glimmerdust†",
      "id": "glimmerdust",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Cultivated from the nests of Glimmerwings on Q'Sal, this highly addictive drug fortifies the user against the machinations of psykers. \n\nThe user gains the Resistance (Psychic Powers) Talent for a number of hours equal to his Willpower Bonus. If they already has this Talent, he gains a further +10 to Resistance Tests. \n\nSide Effects: Whilst under the influence of Glimmerdust, everything appears blindingly bright and more colourful than usual. The user suffers a -30 to all Perception Tests until the drug wears off. Psykers that take this Drug cannot Push their powers until the drug's effects subside.",
      "source": "Tome of Excess"
    },
    {
      "name": "Mortis†",
      "id": "mortis",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Mortis acts to shut down metabolic processes to a near death level, rendering the user a corpse to all but the most dedicated of examiners. Users who have taken Mortis are so near death for the following 4d10 minutes that any Tests to determine the user's status suffer a -30 penalty, with failure indicating the user is dead. Good Craftsmanship doses can be administered so the user can specify how long they last (up to 1 hour), while Poor doses only offer a -10 penalty to Tests.",
      "source": "Black Crusade"
    },
    {
      "name": "Night Dust†",
      "id": "night_dust",
      "weight": "-",
      "availability": "Very Rare",
      "description": "A single dose imposes a -20 penalty on all Tests, while the imbiber experiences mild hallucinations and becomes disassociated from their emotions. After 2d10 minutes, the afflicted character slips into a deep feverish slumber filled with vivid and often violent dreams reflecting the darkest facets of their own mind. This state lasts for 1d10 hours and upon wakening the character must succeed on an Ordinary (+10) Willpower Test or gain 1d5 Insanity Points from the experience. Drinking the dust is far more potent and dangerous: the effects last 41d0 hours and the Willpower Test to avoid Insanity Points is Difficult (-10).",
      "source": "Inquisitor's Handbook"
    },
    {
      "name": "Plas",
      "id": "plas",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Most wastrels of the nobility use this biomorphic chemical to mildly alter their facial features for such frivolities as romantic assignation or humour. Others apply it in stronger doses to let them meld their flesh more painfully, rearranging the flesh into new forms and new identities for clandestine rendezvous' or other more serious applications. When applied to the skin, plas softens it to the consistency of soft wax for roughly five minutes, allowing the user to reshape it into new forms. Multiple applications allow even the flesh underneath to be moulded but with intense pain. These will gradually ware off in 1d5 days causing pain proportional to the extent of modification. This gives the subject a +30 against any Perception tests to determine his true identity and also to fool anyone into believing the false one. Poor doses will only do +10 to the same, while Good Craftsmanship applications will last 1-10 days as desired.",
      "source": "Black Crusade"
    },
    {
      "name": "Sacred Unguents",
      "id": "sacred_unguents",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Holy lubricating oils that have received the blessings of the Omnissiah, these liquids are highly sought after for their calming effect on recalcitrant machine spirits. If applied to a weapon— which requires a Full Action—the weapon becomes immune to jamming for a number of shots equal to its clip size. If the unguent is applied to an already jammed weapon, the jam immediately clears, but there is no further effect.",
      "source": "Dark Heresy 2e"
    },
    {
      "name": "Satrophine†",
      "id": "satrophine",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Satrophine is a tremendously powerful drug that enhances the user's reflexes, strength, and endurance, but does so at a dire cost. Most users become shells of their former selves, and some believe that the Warp itself drains the user's soul as they slip deeper and deeper into Satrophine addiction.\n\nThe user gains +30 to Agility, Perception, Strength, and Toughness Tests for 1 hour.\n\nSide Effects: Characters addicted to Satrophine do not gain Fatigue from withdrawal. Instead they gain 1d5 Corruption points every day until they take their next dose.",
      "source": "Tome of Excess"
    },
    {
      "name": "Verita†",
      "id": "verita",
      "weight": "-",
      "availability": "Very Rare",
      "description": "The substance's composition is unknown with many of its trace constituents completely defying analysis. When encountered, it usually takes the form of a viscous deep blue liquid, with a scent suggestive both of flower blossoms and subtle rot. Verita is a drug restricted by its rarity and cost to the very wealthy. Consuming verita imposes a -10 penalty on Willpower Tests and a -20 penalty on Perception Tests for 3d10 minutes. While affected, the imbiber experiences visions and altered perceptions as determined by the GM. The user is always convinced of the truth of these visions and indeed, the contents of their “waking dream” can be valuable for overcoming some challenge or difficulty. Once the drug has run its course, the imbiber must succeed on a Willpower Test or gain 1d5 Insanity Points. Those victims who gain at least 1 Insanity Point also have a 20% chance of gaining 1d5 Corruption Points as well.",
      "source": "Inquisitor's Handbook"
    },
    {
      "name": "Blue Fire†",
      "id": "blue_fire",
      "weight": "-",
      "availability": "Extremely Rare",
      "description": "Also known as Cerulean Flames to the nobility and other social elites and simply Blue to hive gangers, blue fi re comes as small crystals that shine as if they had absorbed the sky on a perfectly clear day. When dropped in a vessel of water they dissolve, releasing a heatless flame of an even stronger hue. Users quickly breathe the cold fi re into their lungs, where it rapidly travels in shivering tingles through the nerveways to the brain, lighting their eyes into glowing sapphires and igniting psychic consciousness. Blue fire lasts for 1d10 rounds and allows the user to reroll any Focus Power Test attempts made during that time. His soul burns brighter than normal during this time, however, and they always trigger Psychic Phenomena as if they were Pushing. The user must also make a Difficult (-10) Willpower Test or gain +1 Corruption Point when using this. This counts as gaining Corruption through a failing.",
      "source": "Black Crusade"
    },
    {
      "name": "Barkweed Juice",
      "id": "barkweed_juice",
      "weight": "-",
      "availability": "Near Unique",
      "description": "Vast groves of barkweed cover large areas of the Gates of Moment, and the Helwyr tribes use the distilled juice to help perfect their fighting prowess. Outside the Gates, warlords and princes pay ludicrous sums for even the smallest amount.\n\nThe user gains Lightning Reflexes, Rapid Reaction, Unnatural Agility (1) and Unnatural Willpower (1) for a number of rounds equal to his base Toughness Bonus.\n\nSide Effects: Barkweed Juice is not addictive, but imparts 1d5 temporary Toughness Damage after its effects pass.",
      "source": "Tome of Excess"
    }
  ]
}
