{
  "info": "# Cybernetics\n\nImplants and bionics are only available if the character has access to both the resources and the skilled labour to have them installed; commonly this is only available in substantial medicae facilities and worlds with a high technological base. If a character can find a chirurgeon willing to install a bionic or implant, then the process takes no less than 2d10 days, minus one day for each point of his Toughness bonus—to a minimum of one day. How difficult it is to attach a bionic or implant is up to the GM. He might decide that given enough time, and in an advanced enough facility, it is automatic, or he can call on the chirurgeon to make a series of Medicae or even Tech-Use tests that could lead to such damage conditions as permanent crippling or Blood Loss.\n\n† Cybernetic requires the Mechanicus Implants trait",
  "type": "Equipment",
  "data": [
    {
      "item": "Bionic Arm",
      "weight": "-",
      "availability": "Scarce",
      "description": "Bionic arms are a common replacement, and Common models can mimic normal hand and arm functions, including dexterity and even sense of touch.\n* Poor craftsmanship versions are more cumbersome and visibly artificial; halve the owner's Agility characteristic (rounded up) where matters of fine dexterity are involved. In addition, Weapon Skill and Ballistic Skill tests made when using the limb suffer a -5 penalty.\n* Good craftsmanship bionic arms improve on natural design and provide a +10 bonus on Agility tests requiring delicate manipulation.\n* Best craftsmanship bionic arms provide a +10 bonus on Agility tests requiring delicate manipulation and add a +10 bonus to Strength tests using the arm. They can be also used to store small items (such as pistol ammo clips) inside concealed interior compartments within the arm.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Bionic Legs",
      "weight": "-",
      "availability": "Scarce",
      "description": "These bionics are fully integrated into the hip with a spinal link, and Common versions allow the user to walk, run, and climb at normal human levels.\n* Poor craftsmanship models are lumbering affairs that reduce a character's Movement rate by 1, and when running, the user must succeed on an Ordinary (+10) Agility test or fall Prone at the end of his movement.\n* Good craftsmanship bionic legs grant the owner the Sprint talent, and add a +20 bonus to Agility tests that he makes when attempting to jump or leap.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Cranial Armour",
      "weight": "-",
      "availability": "Scarce",
      "description": "This augmentation covers or replaces most of the skull with layers of plasteel and gel padding to better prevent concussion and other brain injuries. This implant adds +1 Armour point to the Head, and stacks with any worn armour on that location.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Inbuilt Blade",
      "weight": "-",
      "availability": "Scarce",
      "description": "A character with a cybernetic limb such as a bionic arm that does not already have a weapon installed in it can have an inbuilt weapon installed in the limb. If the inbuilt blade is of Best Craftsmanship, then it is concealed within the bionic limb when not active. Observers must pass a Hard (-20) Scrutiny Test to notice it when searching for concealed weapons. The inbuilt blade counts as a Low-Tech Weapon and has the following profile: Melee; 1d10 R; Balanced. The inbuilt blade is a part of the cybernetic limb, and does not count as a separate cybernetic system. If the cybernetic limb becomes unpowered for any reason, the mechanism controlling the blade also becomes unpowered.\n* Inbuilt weapons can be added to cybernetic limbs such as bionic arms and mechadendrites, and count as part of the system to which they are bound. Installing an inbuilt weapon requires proper tools, a Challenging (+0) Tech-Use Test, and several hours.",
      "source": "Hammer of the Emperor"
    },
    {
      "item": "Mining Helot Augmetics",
      "weight": "-",
      "availability": "Scarce",
      "description": "A forge world is a hungry monster, devouring raw materials without pause or satiation. This hunger is fed by the blood and sweat of countless indentured labours (known as helots) and servitors who toil to feed the macro forges and titanic foundries. The Machine God is not without gifts for those that labour to feed it. In the deep mines, the helots are fitted with massive implant-drills and rams bonded into their nervous system, and their bodies are augmented to better perform their duties. Such improvements are often crudely fitted, and endlessly recycled for use again after the failure of their current fleshy housing.\n* Common: Mining Helot Augmetics give the character an extra limb fitted with a breacher. This implant increases the character's Strength and Toughness Characteristics each by +10, thanks to surgically implanted muscle tissue and bionic skeletal reinforcement.\n* Drawbacks: Unfortunately, the side effects of these somewhat crude and bulky flesh-metal fusions reduce the character's Agility Characteristic by -10. These implants are performed with little thought given to the level of pain or discomfort they inflict, thus recipients gain 1d10 Insanity Points.",
      "source": "Inquisitor's Handbook"
    },
    {
      "item": "Vocal Implant",
      "weight": "-",
      "availability": "Scarce",
      "description": "This implant is usually found with those who use their voice to project commands or proclamations, such as Ecclesiarchy Preachers or Adeptus Arbites Crowd Dispersal Officers. This implant works to amplify the vocal cords to an inhuman range in order to shout commands over the noise of a raging battle, and counts as using a laud hailer.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Augur Array",
      "weight": "-",
      "availability": "Rare",
      "description": "These implanted devices duplicate the effects of sensor systems that go beyond normal human senses. In all cases, their use requires concentration and a Half Action. Common systems function identically to a standard hand-held auspex device.\n* Poor systems possess only a single detection ability (heat, radiation, electromagnetics, or very rarely daemonic taint) and have the limited range of 20 metres. If the augur is set to detect daemonic taint, it has the possibility to be overwhelmed and malfunction should a Warp-denizen get too close.\n* Good systems function as a full auspex, but also allow the character to re-roll all Perception-based tests.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Bionic Respiratory System",
      "weight": "-",
      "availability": "Rare",
      "description": "Common bionic lungs and implanted respiratory systems mimic the action of human lungs and keep the body supplied with oxygen. Such characters gain a +20 bonus to Toughness tests made to resist airborne toxins and gas weapons.\n* Poor bionic lungs offer the same benefits as the Common system, but are raucously loud affairs and characters suffer a -20 penalty to Stealth tests. Their generally poor oxygen supply to the body means that the character suffers a -10 penalty on all tests involving strenuous physical activity.\n* Good bionic lungs count as a full life support system—if for any reason the user's own respiratory system fails, his bionic lungs keep his blood oxygenated—and can be designed to be unnoticeable if desired.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Bionic Senses",
      "weight": "-",
      "availability": "Rare",
      "description": "Eyes, ears, and even noses are often lost through combat or accident, and replacement versions use cranial interfaces to allow a very close approximation to natural senses. Bionic eyes in particular are frequently seen amongst senior Imperial Guard officers, Rogue Traders, and other powerful individuals. Common systems, while usually clearly artificial and often oversized, manage to more or less duplicate the approximate human range of senses adequately and have no further game effects.\n* Poor quality cybernetic senses are problem-ridden imitations of the real thing. Hearing might be troubled by static, for example, or vision rendered in low-resolution monochrome. A character with this system suffers a -20 penalty to tests made involving the cybernetic sense.\n* Good cybernetic senses grant a +10 bonus to tests using that particular sense, and a +20 bonus to tests made to resist attacks on the sense itself, such as deafening noises and blinding flashes. Advanced cybernetic eyes can also incorporate magnifying lenses, a full photo-visor, or a system granting the Dark-sight trait. Advanced cybernetic ears can also include an internal micro-bead system. Each additional upgrade requires a separate Requisition test to be fitted into existing cybernetic senses.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Blade-tines",
      "weight": "-",
      "availability": "Rare",
      "description": "The blade-tines grant the Character +5 to Medicae Tests, +5 to Interrogation Tests, and can be used as a melee weapon in close combat, dealing 1d5+2 (plus Strength Bonus) Damage with a Penetration of 2.\n* Good Craftsmanship versions can vibrate the blades at high frequencies, increasing the cutting power. The weapons gain the Tearing Trait.\n* Best Craftsmanship versions also include drug producing bio-mechanical glands, with thin tubules to carry the venomous liquids to small openings underneath the blades. This grants the weapons the Toxic (0) Quality.\n* Poor Craftsmanship versions only deal 1d5 plus Strength Bonus Damage without any Penetration.",
      "source": "Black Crusade"
    },
    {
      "item": "Chem Injector",
      "weight": "-",
      "availability": "Rare",
      "description": "Many warriors who rely on pharmacological boosts in combat have taken this implant, allowing them to inject themselves as needed with the chemicals they crave. One dose of a single drug may be loaded into the injector via a skin-mounted port (if this implant is taken multiple times, then multiple drugs may be loaded). The user may activate the injector as a Half Action requiring a Routine (+20) Willpower Test. A Failure means that injector has malfunctioned, and will require a Challenging (+0) Tech-Use Test to repair.",
      "source": "Black Crusade"
    },
    {
      "item": "Interface Port",
      "weight": "-",
      "availability": "Rare",
      "description": "The Acolyte now has a mechanical port implanted in his body, commonly in the rear of the neck, which can be connected to machines via a data cable. This allows the user faster and smoother access to the valuable information within, and grants a +10 bonus to Common Lore, Inquiry, or Tech-Use tests whilst connected to a relevant mechanism or data spool.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Internal Reservoir",
      "weight": "-",
      "availability": "Rare",
      "description": "This implant acts as a powerful battery, storing energy for various implants and (especially) for functions that require energy to be expended in rapid or violent fashions. When it is fully charged, the Acolyte no longer gains Fatigue from using Luminen Capacitors either to recharge or attack something, but each use of those implants drains the reservoir by half. The battery fully recharges after one day of resting.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Locator Matrix",
      "weight": "-",
      "availability": "Rare",
      "description": "Micro-cogitators implanted at the base of the skull allow the user to be aware of the direction of the planetary poles, the Acolyte's present location to within a few metres, relative velocity, altitude, time of day, and other valuable information. The user must still have access to maps and other planetary data in order to benefit from this information, however—knowing one is at a specific location on a planetary surface has little meaning without knowing what is over the next rise, or what is the direction needed to reach a given destination.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Memorance Implant",
      "weight": "-",
      "availability": "Rare",
      "description": "This implant is a neurally-linked datavault and pict-capture array, often incorporating augmetic replacement of one or both eyes, that records information on people or scenes viewed. It can then later replay that information, or overlay the present view with additional data on people and objects viewed. It is a tool of chroniclers, loremancers, and masters of ceremonies, as well as factors or nobles who like to see the secrets of their rivals overlaid upon their view of the negotiating table. It provides a +10 bonus to Trade (Loremancer) tests or other tests in social situations where the recorded information provides leverage or value.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Mind Impulse Unit",
      "weight": "-",
      "availability": "Rare",
      "description": "These devices, also known as sense-links, allow the owner to interface directly with a machine or technological device. MIUs see widespread use among the Adeptus Mechanicus, who regard them as objects of divine communion. A basic model involves a single spinal or cortex connector, while advanced variants include wrist connector probes—and possibly mechadendrite connectors—in addition to the spinal plug. Common models impose no modifiers to machine spirit communication, and add a +10 bonus to Tech-Use or Operate tests used in conjunction with devices capable of MIU linking.\n* Poor MIU systems require a Challenging (+0) Willpower test to use and impose a -10 penalty when attempting to interface with a device.\n* Good models grant a +10 bonus to commune with machine spirits and for Tech-Use, Operate, Logic, Inquiry, and Ballistic Skill tests made as part of interfacing with the MIU systems.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "MIU Weapon Interface",
      "weight": "-",
      "availability": "Rare",
      "description": "Unlike the more advanced MIU version normally only granted to priests of the Adeptus Mechanicus, this model is more simplified, allowing the user to remotely operate a single weapon which is attached user's body. While not as elaborate, it is easier to use and a favourite of many militant professions. This system allows the user to fire the linked ranged weapon as a Free Action during his turn. Note that he can still only take a single Action with the Attack subtype during his turn. This additional weapon must be connected to the user via the MIU weapon interface, and is usually equipped as a shoulder mount.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Nerve Induction Tines",
      "weight": "-",
      "availability": "Rare",
      "description": "Thin flexible metal spikes are implanted underneath the fingernails, where they can emerge to a length of 5cm. Their nano-sharp ends enclose electrochemical induction ports, and can slice into skin to reach vulnerable nerves underneath to create excruciating pain or pleasure. This grants the user +20 to Interrogation Tests against prone or restrained subjects or alternatively +20 to Charm Tests against the same.",
      "source": "Black Crusade"
    },
    {
      "item": "Respiratory Filter Implant",
      "weight": "-",
      "availability": "Rare",
      "description": "These are implanted inside the lungs or involve masses of tubes, wires, vox-grills, or other augmetic parts replacing the neck and upper chest. The implant sifts out most toxic gases; inhaled particulate matter is also filtered, making breathing easier in heavily polluted atmospheres. This implant grants the user a +20 bonus to resist inhaled poisons, gas weapons, or atmospheric toxins.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Scribe-tines",
      "weight": "-",
      "availability": "Rare",
      "description": "The hand and lower forearm are replaced with specialised and sensitive tools ideal for manipulating parchment, auto-scribing, dataslate tuning, and other efforts to record and preserve information. While somewhat disquieting in appearance, they are viewed with favour by hive-world scholars and lex-mechanics. This implant gives the user a +10 bonus to all Lore skill tests.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Skeletal Petrifaction",
      "weight": "-",
      "availability": "Rare",
      "description": "More a chemical treatment than an implant, metallic fluids are injected into bone marrow in a series of painful operations. The skeletal system incorporates them into the bone structure, making them heavier, stronger, and more damage resistant. A Character so altered gains the Bulging Biceps and (often literally) Iron Jaw Talents, and gains a +2 bonus to Damage for all unarmed attacks.",
      "source": "Black Crusade"
    },
    {
      "item": "Synthmuscle",
      "weight": "-",
      "availability": "Rare",
      "description": "Ropey strands of vat-grown muscle tissue, thick with slurried nutrients and laced with flakweave, are woven into existing muscle groups, granting increased strength of varying levels. This implant grants the Unnatural Strength (1) trait; Best craftsmanship grafts instead grant the Unnatural Strength (4) trait but also impose a -10 penalty on Agility tests due to the newly misshapen and unnatural body form.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Volitor Implant",
      "weight": "-",
      "availability": "Rare",
      "description": "The subject has cranial surgery to implant neural receptors and artificial nerve routing, and can be compelled not to reveal a certain item of information, remain within a set area, or perform a specific task. If the subject attempts—or is forced—to counter this compulsion, his brain shuts down into unconsciousness, or even death for some severe volitor patterns.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Autosanguine†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "This ancient and blessed microscopic technology flows as a metallic liquid within the character's bloodstream, repairing minor injuries and accelerating healing. It repairs minor injuries and speeds recovery. When applying healing, the character is always considered Lightly Damaged, and heals at an increased rate, removing 2 points of damage per day instead of 1.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Ballistic Mechadendrite†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Designed for ranged combat, this mechadendrite is fitted with a weapon that functions as a laspistol that does not require recharging. The user does not need weapon training in this weapon class to fire the mechadendrite's weapon without the normal untrained penalty, and can attack with this weapon as his Reaction.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson-robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Bionic Heart",
      "weight": "-",
      "availability": "Very Rare",
      "description": "The paranoid (or the prepared) are ever-willing to replace crude flesh with more durable, armoured materials—the light armour shielding of a bionic heart provides a last line of defence. Superior models can be triggered to pump more rapidly to increase physical capacity, though this risks bodily strain as the rest of the circulatory system is put under pressure. A character with this implant gains +1 Armour point to the Body location—this bonus stacks with any armour worn—and gains the Sprint talent.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Calculus Logi Upgrade",
      "weight": "-",
      "availability": "Very Rare",
      "description": "These bionics are internal cogitator implants which aid in data retention and processing. The user can rapidly sift through stacked dataslates and parchments, applying intuition to vast reams of data far beyond the capabilities of a normal man. This implant grants the user a +10 bonus to Literacy, Logic, and Scholastic Lore tests.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Cerebral Implants",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Commonly used to repair a severely damaged brain or (hopefully) augment its abilities, these often-risky implant systems represent a major step from simply replacing a limb to altering a character from human to mechanism. Common-level implants can restore paralysed and brain-damaged users to a semblance of normality, but with a permanent loss of 1d10 points from the character's Weapon Skill, Ballistic Skill, Agility, Intelligence, and Fellowship characteristics.\n* Poor versions restore brain function, but destroy the subject's personality and memories, rendering them no better than a servitor, and as such are unsuitable for PCs.\n* Good cerebral implants are very rare even among high ranking Imperial officials, and are exceedingly difficult to acquire, becoming Near Unique in Availability. These grant the user the Unnatural Intelligence (2) trait and a +20 bonus to Logic and Lore tests, thanks to the superior mental capabilities he now enjoys.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Chem Gland",
      "weight": "-",
      "availability": "Very Rare",
      "description": "These rare and expensive implants are wonders of the bio-sculptor's craft. Invisibly concealed within the body are miniaturised chemical factories that consume the user's own natural resources to synthesise powerful chemical agents. Pick up to three substances when the implant is performed (such as Stimm, Pan-immune, and so on). The character can “gland” any one of these at will as a Half Action by succeeding on a Routine (+10) Toughness Test. A failed Test however inflicts a level of Fatigue. A failure by four or more degrees deals 1d10 points of Toughness Damage.",
      "source": "Inquisitor's Handbook"
    },
    {
      "item": "Constructer Interface",
      "weight": "-",
      "availability": "Very Rare",
      "description": "All Constructer Interfaces are of at least Good Quality and allow a user to make Command Tests to a Cyber- Mastiff or Grapple-Hawk silently, using Tech-Use in place of the Command skill. The device can interface with up to five constructs, but can only actively issue commands to 2, the others may report data back to the user, but may not be commanded. Only Cyber-Mastiff's and Grapple-Hawks may be issued commands, other constructs may only report data. A Best Quality Constructor Interface allows for 3 constructs to be commanded, but is still limited to 5 total uplinks. A user may make a Full Action to upload a pattern into a Cyber-Mastiff or Grapple-Hawks cogitator, granting one of the following abilities:\n* Defence: +10 Weapon Skill, Parry Rank 1\n* Restrain: +20 Weapon Skill when attempting to Grapple\n* Harass: +10 Dodge, Dodge Rank 1\n* “Vanes Out” Alpha: +10 Perception, Awareness Rank 1\n* “Vanes Out” Beta: +10 Perception, Survival Rank 1\n* Pursuit: +1 Agility Bonus, Accustomed To Crowds",
      "source": "Book of Judgement"
    },
    {
      "item": "Ferric Lure Implants†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Powerful electromagnets are implanted in the Acolyte, allowing him to cast forth a net of invisible energy as a Full Action after a successful Challenging (+0) Willpower test. He can call an unsecured metal object into his hand; the object cannot mass more than 1 kg per point of Willpower bonus, and must be within 20 metres. He must already have Mechanicus Implants trait for this system to function, and it can be improved through certain talents",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Luminen Capacitor†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "This implanted energy source charges internal capacitors, allowing the character to recharge devices or even unleash powerful energy blasts. With a successful Toughness test, the character recharges or powers machinery. This requires one minute of mental focus and meditation. The difficulty of the Toughness test varies depending on the nature of the powered system.\n* Ordinary (+10): Simple power cell, glow-globe\n* Challenging (+0): Lasgun charge pack, dataslate\n* Difficult (-10): Shuttle launch systems, servo-skull\n* Hard (-20): Lascannon charge pack, servitor\n* Very Hard (-30): Cogitator core, xenos technology\n\nThe device can also be used offensively, but requires talents to use properly. Only an Acolyte with the Mechanicus Implants trait  may use this device. Poor craftsmanship variants impose a -10 penalty to all Toughness tests made to use them. Good craftsmanship variants grant a +10 bonus to all Toughness tests made to use them.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Maglev Coils†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Archaeotech systems of powerful gravimetric coils are implanted in the body, allowing the user to become unshackled from gravity's grasp for short periods. Using a Half Action, the user may hover 20-30 centimetres off the ground for a number of minutes equal to 1d10 plus the character's Toughness bonus. The character must employ a Half Action each round to concentrate on operating this implant and may use the other action to move normally. The character can slow his rate of descent when falling so long as this implant is active when the character reaches the ground, reducing all falling damage to a maximum of 1d10+3 Impact damage. Each time the character activates the coils, it drains the stored power and cannot be used again until recharged (which takes 24 hours).",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Manipulator Mechadendrite†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "A heavy and powerful attachment, this mechadendrite is designed for heavy lifting and handling of industrial gear. It grants the user +20 to Strength-based tests; the vicious gripping and crushing pincers can also tether the user to gantries or suitably heavy objects as a Free Action. Once per round, the character can utilise this mechadendrite as a weapon by spending a Half Action or a Reaction to make a Standard Attack action with it. It counts as a melee weapon that inflicts 1d10+2 Impact damage, Pen 0. While powerful, the manipulator is not subtle, and attempts to use it for such tasks as dataslate typing, inscribing sacrificial etchings, handling delicate objects, or the like only ends with equipment being dropped, smashed, or otherwise ruined.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Medicae Mechadendrite†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "This model hosts a variety of medical and surgical tools ideal for combat first aid, and grants a +10 bonus to Medicae and Interrogation tests. The mechadendrite houses six injector pistons, each of which may be filled with one dose of a drug. In addition to providing first aid, the mechadendrite's flesh staplers may be used to staunch Blood Loss as a Half Action. A small chain-scalpel attachment reduces the difficulty of limb amputation to Challenging (+0). Once per round, the character can utilise this mechadendrite as a weapon by spending a Half Action or a Reaction to make a Standard Attack action. It counts as a melee weapon with the Balanced quality that inflicts 1d5 Rending damage, Pen 0.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Optical Mechadendrite†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Often consisting of highly flexible, snake-like tubing, this contains pict-capture and other sensory devices for inspection and detection. It is long for a mechadendrite, extending to 3 metres, and grants a +10 bonus to all vision-based Perception tests. The mounted pict-devices allow it to examine surfaces at a microscopic level or to be used as telescopic sight. It contains an infrared torch and sensors with a range of 40m, and so within this area the user ignores combat or other penalties due to darkness. The mechadendrite is also fitted with a stablight that can be tinted a variety of different colours depending on the controller's whim.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Pheromone Generator",
      "weight": "-",
      "availability": "Very Rare",
      "description": "A combination of biological glands and injection systems, this implant allows the user to exude unseen but powerful chemicals into the air through modified sweat glands on a Routine (+20) Willpower Test. Charm Tests will gain a +10 bonus, rising to +20 if the test is taken in an enclosed area with little or no strong air movement.",
      "source": "Black Crusade"
    },
    {
      "item": "Servo-Arm†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "A servo-arm can extend up to 1.5 m from its shoulder or back mounting and has a fixed Strength value of 75 with the Unnatural Strength (7) Trait—the servo-arm always uses this value, regardless of the character's Strength Characteristic or Talents. Though incapable of fine manipulation, the servo-arm's powerful claw can be used to lift heavy objects or tether the user to a suitable anchor as a Free Action. In combat, the character can use the servo-arm to make a Standard Attack Action or strike with it as his Reaction for the Round (so long as he only uses it once per Round). A servo-arm has the following profile: Melee; 2d10+14 I; Pen 10; Unwieldy.\n\nBest Craftsmanship servo-arms have a Strength of 85 with the Unnatural Strength (7) Trait (increasing Damage to 2d10+15). \n\nTo use an installed servo-arm, a character must have the Mechadendrite Use (Utility) Talent. To use it as a weapon, a character must also have the Mechadendrite Use (Weapon) Talent.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Hammer of the Emperor"
    },
    {
      "item": "Servo-Claw†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "A servo-claw is usually mounted at waist height as not to interfere with the movement of the arms or any other mechadendrites. A servo-claw has the following profile: Melee; 1d10+10 I; Pen 4; Tearing. The user can use it to make attack actions as normal. He can also spend a Reaction to make a Standard Melee Attack Action with the servo-claw. The servo-claw never adds the user's strength to its Damage. The servo-claw can lift objects using its Strength of 50 and Unnatural Strength (+5) Trait. The Mechadendrite Use (Manipulator) Talent applies to the servo-claw.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Inquisitor's Handbook"
    },
    {
      "item": "Subskin Armour",
      "weight": "-",
      "availability": "Very Rare",
      "description": "Thin carapace plating is inserted under the skin in various locations, giving the user added protection against damage. While not as impressive as most augmentations and sometimes uncomfortable, subskin armour is very reliable. This implant adds +2 Armour points to the Arms, Body, and Legs locations, which stacks with any other Armour points for these locations.",
      "source": "Dark Heresy 2e",
      "": ""
    },
    {
      "item": "Utility Mechadendrite†",
      "weight": "-",
      "availability": "Very Rare",
      "description": "The most common type of mechadendrite, these are tipped with a variety of mechanisms for the repair and succour of blessed technologies. It counts as a combi-tool, granting a +10 bonus to all Tech-Use tests. The limb also houses six injector pistons, each of which may be filled with one dose of a sacred unguent. In addition to this, the limb contains an electrically-powered censer, which can gust incense fumes over troublesome faults. Unless the censer is deactivated, all Perception tests made to detect the Tech-Priest that rely on a sense of smell gain a +10 bonus. As a Half Action, the censer can create one “blast” of smoke every fifteen minutes, which imposes a -5 penalty to Weapon Skill tests made by all living creatures within a two-metre radius for one round. Once per round, the character can also utilise this mechadendrite as a weapon by spending a Half Action or a Reaction to make a Standard Attack action. It counts as a melee weapon with the Defensive quality that inflicts 1d5 Rending damage, Pen 2.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Alatus-Pattern Jump Pack†",
      "weight": "-",
      "availability": "Extremely Rare",
      "description": "The Alatus-pattern jump pack doubles the user's base movement value and can be used to gain the Flyer (12) Trait for up to one minute. Extended flights tend to drain potentia coils far quicker than short jumps, so the user must pass a Challenging (+0) Toughness Test after using the Flyer Trait or gain one level of Fatigue. The mechanical wings grant the user the Fear (1) Trait, and can be used to buffet the enemy in combat, granting the user a +10 to all Parry Tests. Use of the Alatus-pattern jump pack requires the Operate (Aeronautica) Skill and the Mechanicus Implants Trait.",
      "source": "Shield of Humanity"
    },
    {
      "item": "Hermetic Infusion†",
      "weight": "-",
      "availability": "Extremely Rare",
      "description": "As another departure from the frailties of the flesh, the infuser system replaces human blood and blood processing organs with a far more efficient biomechanical serum, the most advanced forms of which contain legions of microscopic homunculitic machines that can search out and repair damage on a cellular level with frightening speed. In addition to Mechanicus Implants, a Hermetic Infusion also requires the Autosanguine Implant.\n* Common: The tech-priest gains a +10 bonus on Tests made to resist toxins, diseases and radioactive contamination. As well, the tech-priest gains the Die Hard talent.\n* Good: As Common, but the bonus on Tests increases to +20 and the tech-priest gains the Regeneration trait.\n* Disadvantages: Aside from a greying of the flesh and visible withering of the tissues, Hermetic Infusion has one marked side effect: the tech-priest's body can no longer use human blood, and so cannot be treated for Blood Loss or severe injuries by transfusion or regular medical treatments. Instead, the tech-priest must look to his own care (if possible) or that of a Magos Biologis to replace his lost serum.",
      "source": "Inquisitor's Handbook"
    },
    {
      "item": "Ocular Sight",
      "weight": "-",
      "availability": "Extremely Rare",
      "description": "An ocular sight is an implant that grants the same benefits as a cybernetic eye (see cybernetic senses). Until it is activated, this is the only mechanical benefit it provides. A character with an ocular sight can activate (or deactivate) its combat mode as a Half Action. When he does, he gains the Unnatural Ballistic Skill (1) Trait (or the Unnatural Ballistic Skill (2) Trait if the cybernetic sight is of Best Craftsmanship) but suffers a -20 penalty to Awareness Tests while it is active as his vision tunnels in to focus on his targets. Further, while it is active, he cannot benefit from any sight attached to his gun.",
      "source": "Hammer of the Emperor"
    },
    {
      "item": "Plasma-cutter Mechadendrite†",
      "weight": "-",
      "availability": "Extremely Rare",
      "description": "A plasma-cutter is a mechadendrite fuelled by photonic hydrogen stowage-flasks. It can cut through a metre of adamantine plating up to 20 centimetres thick every minute (thinner material can be cut through faster). In addition, a Tech-Priest with a plasma-cutter mechadendrite may boost the power past its safety tolerances to use it as a weapon. The Tech-Priest may use this mechadendrite as his Reaction for the round, or as a Half Action Attack during his turn (so long as the mechadendrite only makes one attack per round). When used to make an attack, the mechadendrite counts as a Plasma Pistol with a range of 10 metres and no option to fire on Maximal Mode. The plasma-cutter may operate for 20 minutes of cutting, or may fire 40 shots before it must be refuelled. The Mechadendrite Use (Ballistic) Talent applies to this mechadendrite.\n\nMechadendrites are mechanical attachments of brass and steel that act as additional arms. They are normally mounted on the shoulders or back, though some within the Mechanicum also project these cybernetics from their waists or chests. Each is usually 2 metres in length when fully extended, and has a specialised function based around the mechanisms affixed at their end. The number of mechadendrites coiled or folded around a Tech-Priest's crimson robed figure is often an excellent indicator of his rank within the Priesthood of Mars. Unless stated otherwise, mechadendrites can only be used to perform tasks that the owner already knows how to do. For example, a character with a medicae mechadendrite must have the Medicae skill in order to take advantage of the extra abilities the limb grants. A character must have the appropriate Mechadendrite Use talent to operate his mechadendrite, and the maximum number of mechadendrites he can have installed upon his body is equal to his Toughness bonus.",
      "source": "Ascension"
    },
    {
      "item": "Baleful Eye",
      "weight": "-",
      "availability": "Near Unique",
      "description": "This legendary archaeotech bionic pattern incorporates a tiny las weapon. Each baleful eye has been passed from recipient to recipient across centuries or millennia, reclaimed by the Machine Cult whenever its owner dies. As might be imagined, it is very intimidating when used as a part of negotiations with primitive societies. A character with this implant has a weapon in his eye that counts as a hot-shot laspistol with a range of 10m. The baleful eye can be fired even if the character's hands are full. It has no clip size, however a jam result causes the character to lose sight in the eye for a number of rounds equal to the degrees of failure on the attack.",
      "source": "Dark Heresy 2e"
    },
    {
      "item": "Enhanced Potentia Coil†",
      "weight": "-",
      "availability": "Unique",
      "description": "Designed as a more heavy-duty replacement for standard internal power units. the Enhanced Potentia Coil can be taxed at a far greater level in order to enhance the many abilities common to members of the Machine Cult. Installation of an Enhanced Potentia Coil involves difficult and invasive surgery, and thus the time taken to add the Enhanced Potentia Coil is 1d5+1 weeks. Poor Quality Enhanced Potentia Coils leave the user with a noticeably hunched form. permanently reducing their Agility by 1d10. An Enhanced Potentia Coil can be used for all of the following benefit:\n* Luminen Blast / Luminen Flare: Gain +1d10 Damage and a Penetration value equal to the user's Willpower Bonus.\n* Luminen Shock / Luminen Surge: Gain a Penetration value equal to the user's Willpower Bonus as well as the Tearing Qualities.\n* Luminen Shield / Luminen Barrier: Can be activated as a Reaction.\n* Luminen Capacitors: Tests are 2 steps easier.\n* Maglev Grace/Maglev Transcendence: Maintaining these abilities becomes a Free Action. Maglev Grace can be performed once every 6 hours. Maglev Transcendence can be performed twice every 6 hours.\n* Electrical Succour: Takes half a minute to conduct and becomes an Easy (+30) Toughness Test.\n* Ferric Lure Implants / Ferric Summons: Become Free Actions.\n* Integrated Weapon: The weapon gains the Reliable Weapon Quality.",
      "source": "The Lathe Worlds"
    },
    {
      "item": "Inbuilt Pistol",
      "weight": "-",
      "availability": "Same as Pistol",
      "description": "A character with a cybernetic limb such as a bionic arm that does not already have a weapon installed in it can have an inbuilt weapon installed in the limb. An inbuilt weapon can be any Pistol class weapon with the Compact Upgrade. If the inbuilt pistol is of Best Craftsmanship, then it is concealed within the bionic limb when not active. Observers must pass a Hard (-20) Scrutiny Test to notice it when searching for concealed weapons. The inbuilt pistol is a part of the cybernetic limb, and does not count as a separate cybernetic system. If the cybernetic limb becomes unpowered for any reason, the mechanism controlling the pistol also becomes unpowered. An inbuilt pistol has the same profile as the weapon normally would, but its Clip Size is halved. An inbuilt pistol cannot fire if separated from the cybernetic appendage. The Availability of an inbuilt pistol is the same as that of the normal version of the weapon.\n\nInbuilt weapons can be added to cybernetic limbs such as bionic arms and mechadendrites, and count as part of the system to which they are bound. Installing an inbuilt weapon requires proper tools, a Challenging (+0) Tech-Use Test, and several hours.",
      "source": "Hammer of the Emperor"
    }
  ]
}
